[{
  "_id": {
    "$oid": "62d664fe42db5b65466e5565"
  },
  "title": "Introduction to OpenID Connect",
  "description": "This is how you “authenticate” users using OAuth2.0. Still based on my own experience & Nate Barbettini’s speech.",
  "slug": "introduction-to-openid-connect-62d664fe42db5b65466e5565",
  "body": "<p>This is how you “authenticate” users using OAuth2.0. Still based on my own experience & Nate Barbettini’s <a href=\"https://www.youtube.com/watch?v=996OiexHze0&t=163s\" rel=\"noopener noreferrer\" target=\"_blank\"><em>speech</em></a>.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658369175/obyzyew4wfvipfxqxo2h.jpg\"></p><p>As discussed earlier OAuth2.0 is a protocol for “authorization”. It </p><p>doesn’t provide any out of box solution for authentication. </p><p>Authentication is the process of identifying yourself with a system.</p><p>OAuth2.0</p><p> became a global sensation in 2012 and developers worldwide started </p><p>adopting the specification. One of the side effects of widespread </p><p>adoption is engineers started tweaking the OAuth2.0 protocol for </p><p>authentication. That is how “Log in with Google” and buttons like that </p><p>appeared. But there was no governing structure or protocol in place. To </p><p>address this OpenId connect came into existence.</p><p>Before speaking about OpenId Connect let’s understand why OAuth2.0 was not suitable for authentication.</p><ul><li>OAuth2.0 doesn’t provide a common set of scopes</li><li>OAuth2.0 doesn’t provide a standard way to retrieve user information</li><li>Authentication flows using OAuth2.0 doesn’t have a standard architecture</li></ul><p>The</p><p> answer to these shortcomings is OpenID Connect. OpenID Connect is an </p><p>extension on top of OAuth2.0. It is really just a small tweaking on top </p><p>of the OAuth2.0 protocol.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658369175/jxmtx0q7i00gs3wmlsi0.png\"></p><p>The flow on how the token exchange happen described in <a href=\"https://dinanjana.medium.com/oauth2-0-explained-c64008ea09e2\" rel=\"noopener noreferrer\" target=\"_blank\">my post on OAuth2.0</a>. It is pretty much the same in OpenID connect with more information on user.</p><p>If you’ve gone through <a href=\"https://dinanjana.medium.com/oauth2-0-explained-c64008ea09e2\" rel=\"noopener noreferrer\" target=\"_blank\">my first post</a>,</p><p> you will notice that there is a slight difference between OAuth2.0 and </p><p>OpenId Connect. In OpenId Connect, we have a new standard scope called “<strong>openid</strong>”. Also, when exchanging tokens, an <strong>id token</strong></p><p> is issued together with the access token. This id token has a standard </p><p>structure and it contains the user's information. Additionally, the </p><p>authentication provider has exposed an endpoint called “<strong>userinfo</strong>” which can be called with the access token as a bearer token to retrieve more information on the user.</p><p><strong>Claims</strong></p><p><em>Claims are pieces of information that are asserted about an entity</em>.</p><p> An example of a claim in an authentication context would be “username”.</p><p> So in the context of OpenId Connect claims will bear information about </p><p>the user and authentication event. A set of standard claims is defined </p><p>by OpenId connect protocol and it is described <a href=\"https://openid.net/specs/openid-connect-core-1_0.html#StandardClaims\" rel=\"noopener noreferrer\" target=\"_blank\">here</a>.</p><p><strong>id token</strong></p><p>Id token is a JWT token. It contains information about the user. In the JWT, the following claims have to be present</p><p><em>iss, sub, aud, exp, iat, auth_time (Conditionally required), nonce (Conditionally required). </em>Claims can be requested from the id token and userinfo endpoint<em>. </em>More information on id token structure is available <a href=\"https://openid.net/specs/openid-connect-core-1_0.html#IDToken\" rel=\"noopener noreferrer\" target=\"_blank\">here</a>. </p><p>Id token must be validated before use. The steps for validation are described <a href=\"https://openid.net/specs/openid-connect-core-1_0.html#IDTokenValidation\" rel=\"noopener noreferrer\" target=\"_blank\">here</a>.</p><p><strong><em>scope</em></strong></p><p><strong>OpenID</strong></p><p> scope must be present in scopes. Other scopes can be present and they </p><p>must be handled by the authentication server as it sees fit.</p><p><strong>userinfo</strong></p><p><em>userinfo </em>endpoint</p><p> must be present and must be able to consume as a GET endpoint or a POST</p><p> endpoint with the access token retrieved while authentication is </p><p>presented as a bearer token which will be present in the authorization </p><p>header.</p><p>Response for userinfo request may or may not include values </p><p>for all the requested claims. Responding to claims is governed by auth </p><p>server. It is a good practice to validate the user info response’s “sub”</p><p> claim against the id token’s “sub” claim’s value to mitigate the “<strong>Token substitute attack</strong>”.</p><p><strong>response_type</strong></p><p>Described</p><p> here is the OpenID connect the flow for auth code response type. There </p><p>is a total of 6 flows presented with OpenID connect.</p><p>At the end of these 2 posts, you must have a basic idea on</p><ul><li>When to use OAuth2.0?</li><li>When to use OpenId Connect?</li><li>Why OpenId connect?</li></ul>",
  "author": {
    "$oid": "62a2e971949b34418e39f93d"
  },
  "tagList": [
    "auth",
    "token",
    "openconnect"
  ],
  "favorited": [
    {
      "$oid": "62a2e971949b34418e39f93d"
    },
    {
      "$oid": "62a2e97f949b34418e39f945"
    }
  ],
  "comments": [],
  "createdAt": {
    "$date": {
      "$numberLong": "1658217726420"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659756623823"
    }
  },
  "__v": 0,
  "publishAt": {
    "$date": {
      "$numberLong": "1658217726420"
    }
  }
},{
  "_id": {
    "$oid": "62d919b5ac1e7ebd6a3f12ff"
  },
  "title": "How Google [ Security Team ] cheated ME!",
  "description": "Google cheated me or it has employees with zero knowledge of the Security field",
  "slug": "how-google-security-team-cheated-me-62d919b5ac1e7ebd6a3f12ff",
  "body": "<p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658395064/cwgiiwr8rff2lxqjrkns.png\"></p><p>Timeline:</p><p>bug reported : Dec 23, 2021 04:11PM</p><p>Marked as Intended behavior : Dec 23, 2021 06:25PM</p><p>Cross checked : Feb 07, 2022 12:47 AM</p><p>Hello fellow hackers, I’m Saransh Saraf an Indian bug bounty hunter</p><p><strong>I claimed google, give the appropriate bounty. Don’t cheat with bug bounty hunters who are working day and night to make google more secure every day.</strong></p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658395064/sv31ei7a07kdamnu5j4w.png\"></p><p>On Dec 23, 2021 I targeted <a href=\"http://cloud.google.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Google Cloud Platform</a> And I’ve found Html Injection.</p><p>After investing 3 hours I escalated it from self html injection to reflected Html injection.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658395065/jdjqr1wezdn2e4knra8t.png\"></p><p>I reported the bug to google, as every bug bounty hunter does…</p><p>On Dec 23, 2021 04:11PM, I reported the bug</p><p>And got this as the response :</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658395064/xfs6rcujqumxmu31v3fg.png\"></p><p><br></p><p>I told them multiple times with proper exploit and PoC but they denied to accept in and fix it.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658395064/uz21xd7l3sbxkep6tygi.png\"></p><p>ut they never accepted the issue.</p><h1><strong>Exploit :</strong></h1><p>Vulnerable URL : <a href=\"https://console.cloud.google.com/monitoring/metrics-explorer?pageState=Payloads&project=Project\" rel=\"noopener noreferrer\" target=\"_blank\">https://console.cloud.google.com/monitoring/metrics-explorer?pageState=Payload&project=Project</a>_ID</p><p><br></p><p><br></p><p>Now you have to fill the project-Id and send it to the associated email owner to exploit the vulnerability.</p><p>But After Some time when I checked it again, on Feb 07, 2022 12:47 AM</p><p>Surprisingly they fixed the vulnerability, you can check that by yourself</p><p>And I checked my <strong>Gmail</strong> and <strong>issuetracker</strong> but I didn’t got any update that they accepted the bug and fixed it, because they didn’t Informed me :|</p><p><strong>Now I need your </strong><a href=\"https://www.change.org/bughunters\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>support</strong></a><strong>, to raise my voice against Google to get the appropriate reward & Recognition.</strong></p><p><strong>As you are also a bug bounty hunters or security researcher if you agree with me (they should give an appreciation or even a bounty for our efforts and time)</strong></p><p><strong>Please support me by signing this Petition : </strong><a href=\"https://www.change.org/bughunters\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.change.org/bughunters</a></p><p><strong>PoC : </strong><a href=\"https://youtu.be/ELEPzoI2j8w\" rel=\"noopener noreferrer\" target=\"_blank\">https://youtu.be/ELEPzoI2j8w</a></p><p><strong><em>Hope no one faces these type of problems…</em></strong></p><p>Thanks <a href=\"https://www.instagram.com/bugxploit/\" rel=\"noopener noreferrer\" target=\"_blank\">Sumon Nath (@bugxploit)</a> Sir for support</p><p>Do connect with us on Instagram :</p><p>@bugxploit : <a href=\"https://www.instagram.com/bugxploit/\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.instagram.com/bugxploit/</a></p><p>@sarans0x00h : <a href=\"https://www.instagram.com/sarans0x00h/\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.instagram.com/sarans0x00h/</a></p><p>Linkedin :</p><p><a href=\"https://www.linkedin.com/in/saransh-saraf-2b514b20b/\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.linkedin.com/in/saransh-saraf-2b514b20b/</a></p><p><strong>Thank You Everyone for your support.</strong></p>",
  "author": {
    "$oid": "62a2e971949b34418e39f93d"
  },
  "tagList": [
    "google",
    "bug"
  ],
  "favorited": [
    {
      "$oid": "62b12f43096b5f8c461f0e80"
    },
    {
      "$oid": "62a2e97f949b34418e39f945"
    }
  ],
  "comments": [],
  "createdAt": {
    "$date": {
      "$numberLong": "1658395061794"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659754424199"
    }
  },
  "__v": 0,
  "publishAt": {
    "$date": {
      "$numberLong": "1658395061794"
    }
  }
},{
  "_id": {
    "$oid": "62d91f0dac1e7ebd6a3f1511"
  },
  "title": "Why I stopped using Gmail — and why you should too",
  "description": "Everyone uses Gmail, right? I use it, you use it, depending on whether you created a Facebook profile for your grandmother, you probably created a Gmail address for her as well.",
  "slug": "why-i-stopped-using-gmail-and-why-you-should-too-62d91f0dac1e7ebd6a3f1511",
  "body": "<p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658396432/ar9f3fdmo9778rpxwy6r.png\"></p><p>And all of that is nice and sounds good — but the issue is that Gmail stopped being just a contact channel ages ago. It’s tightly bound to your identity, and nowadays not only on the internet.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658396432/hckvq4qkbqd9aqt7ppqc.png\"></p><p>Just think about all the apps, websites, etc. that you use, and which for you use your Gmail address. Your Youtube account, Google Play, Facebook, Tiktok, and even Medium probably.</p><p>Everything is linked to your Gmail address, and you either use it as a Single-Sign-On option or at least as your 2FA method.</p><p><strong>Gmail got to be a part of our identity, a long time ago.</strong> Without exaggerating, we wouldn’t be able to function if someone took it away from us at this moment.</p><p>Losing access to your Gmail address now isn’t that easy on you. You don’t actually lose your email, but access to all the applications that your day-to-day life depends on.</p><p>There are many ways how all of this can go sideways, especially if you think about how Google is getting more and more protective and defensive because of security risks. More security — more chances you get locked out. But it’s a paradox, as you actually need more security to keep other people out of your Gmail — <em>read</em> <strong>identity</strong>.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658396432/azztn9sh6rueocjsbumz.png\"></p><p><br></p><p>And these security risks are a huge problem even on their own — Hackers don’t target your profile on the super new cool app, or your bank account — but they get it all by just getting your email.</p><p>I’m not suggesting you should use Outlook or Yahoo. I’m suggesting that we as the whole internet community, and all of us as <em>users</em> and businesses as well — rethink how we identify on the web, and how much we actually depend on a single communication channel; <em>email</em>.</p><p>A whole other problem is — how much everything depends on a single communication channel.</p><h2>Takeaway</h2><p>If you think you’re safe, just remember how many security issues Gmail alone asks you, and how many checks it has in a place, such as IP checks, your birthday, etc. All of these yield potential for you to get locked out, literally, of your identity.</p><p><br></p><p>Think about how and what tools we use and at what scale.</p><p>Make sure you use other means that identify you, not only your email channel.</p><p>If you end up here, I want to say, thank you for reading this article! 🎉</p>",
  "author": {
    "$oid": "62a2e971949b34418e39f93d"
  },
  "tagList": [
    "gmail",
    "safe",
    "security"
  ],
  "favorited": [
    {
      "$oid": "62a2e97f949b34418e39f945"
    },
    {
      "$oid": "62cff2fbc7ffb94bfe4eba48"
    }
  ],
  "comments": [],
  "createdAt": {
    "$date": {
      "$numberLong": "1658396429618"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659955186817"
    }
  },
  "__v": 0,
  "publishAt": {
    "$date": {
      "$numberLong": "1658396429618"
    }
  }
},{
  "_id": {
    "$oid": "62d921dcac1e7ebd6a3f16f2"
  },
  "title": "My privacy journey: A path to better password practices",
  "description": "Policy and Privacy Analyst Intern at Tucows",
  "slug": "my-privacy-journey-a-path-to-better-password-practices-62d921dcac1e7ebd6a3f16f2",
  "body": "<p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658397150/afuyxw1wgg60xaov9box.png\"></p><p><em>**This article was originally posted on Hanna’s LinkedIn account </em><a href=\"https://www.linkedin.com/pulse/my-privacy-journey-path-better-password-practices-hanna-diress/?trackingId=M%2FtirMRZT9WWTeAic1nTlQ%3D%3D\" rel=\"noopener noreferrer\" target=\"_blank\"><em>here</em></a><em>. With her permission, we are excited to share her insights with the Tucows audience.</em></p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658397151/kzvbyddf2ccrbuzvnqyd.png\"></p><p>I haven’t always been the most careful when it comes to ensuring my personal information is secure online. Having tons of accounts and dreading the idea of memorizing passwords, I would often use the same password across several different sites. I’ve broken nearly every rule in the book when it comes to ensuring my own safety and security on the internet, including using simple passwords and passwords that are too similar to one another.</p><p>Luckily, <a href=\"http://www.google.com/url?q=http%3A%2F%2Fhaveibeenpwned.com&sa=D&sntz=1&usg=AOvVaw2hW7PQi3wPwDEXqGNOyxgs\" rel=\"noopener noreferrer\" target=\"_blank\">my private information has not yet been compromised.</a></p><p>However, in an age where the risk of identity theft and private information breaches is increasingly common, it’s not safe to assume your personal information will continue to stay safe when using risky tactics. After just a few weeks working here at Tucows, I’ve learned how costly being ignorant of privacy risks on the internet can be.</p><p>One of the biggest reasons people’s private information is compromised over the internet is a lack of knowledge surrounding password hygiene. The good news is that privacy breaches that happen as a result of non-secure password practices are relatively easy to prevent. What I’ve learned here at Tucows has helped me implement several more secure practices to protect my personal data when surfing the web.</p><p>Here are three changes you should consider making to your existing passwords and accounts to help ensure that your personal information is as secure as possible on the internet:</p><h1>1. Use a different password for every account. Do not recycle old passwords!</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658397151/d7wz5sb8jodjjazdatbf.png\"></p><p>I can’t stress this enough. Using the same password for multiple accounts means that if someone were to obtain the password for one account, they could get into all of them. Recycling passwords can also be dangerous because hackers often have access to <a href=\"http://www.google.com/url?q=http%3A%2F%2Fhaveibeenpwned.com&sa=D&sntz=1&usg=AOvVaw2hW7PQi3wPwDEXqGNOyxgs\" rel=\"noopener noreferrer\" target=\"_blank\">a list of previously-compromised passwords</a>. For example, when <a href=\"https://www.google.com/url?q=https%3A%2F%2Fwww.cbsnews.com%2Fnews%2Flinkedin-2012-data-breach-hack-much-worse-than-we-thought-passwords-emails%2F&sa=D&sntz=1&usg=AOvVaw0b9dnEvHC3FgWki5a_WyVd\" rel=\"noopener noreferrer\" target=\"_blank\">LinkedIn experienced a data breach</a>, all users were required to change their passwords. However, for users that had recycled that password, malicious hackers were able to use those compromised LinkedIn passwords to successfully log in to other websites.</p><p>Using a new password every time you set up credentials limits anyone’s ability to access your accounts on multiple sites.</p><h1>2. Use long, complex passphrases and multi-factor authentication</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658397151/eaatcplksmkf4yz21boz.png\"></p><p>This may come as a surprise, but the length of a password is what ensures the most security — complexity is secondary. One good way to create very strong passwords is to use phrases rather than letter/number combinations. Phrases tend to be much longer and easier for users to remember but are still difficult for anyone else to guess. This is especially important since malicious hackers often use software to crack users’ passwords.</p><p>When passwords are simple (if you use the word “password” as a password, I’m talking to you), hacker software can figure it out in a matter of minutes. On the other hand, a passphrase with a minimum of 14 characters, as well as numbers and symbols, would take <a href=\"https://www.google.com/url?q=https%3A%2F%2Fwww.lmgsecurity.com%2Fhow-long-should-your-password-be-a-technical-guide-to-a-safe-password-length-policy%2F%23%3A~%3Atext%3Dapproximately%25207%2520days.-%2CIn%2520contrast%252C%2520the%2520time%2520required%2520for%2520LMG%2520to%2520compute%2520the%2Cmore%2520than%2520147%2520trillion%2520years&sa=D&sntz=1&usg=AOvVaw0zffRTZ9p37LeAcklr3WJi\" rel=\"noopener noreferrer\" target=\"_blank\">nearly 4 trillion years to crack!</a></p><p>Using two-factor authentication can also further improve your account security by requiring an additional step to verification when logging in. This process requires you to log in to your account using your primary credentials and then confirm your identity by providing a code that the service sends to a secondary device.</p><h1>3. Be cautious when using single sign-on (SSO)</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658397151/gr4fwpaup7cmghzln8mz.png\"></p><p>Single sign-on (SSO) options like signing in with Google can be both convenient for users as well as a secure and easy-to-control access method for work services. However, it’s important to be mindful of the risks associated with SSO. For example, because Google and Facebook offer single sign-on options across several apps, if a malicious hacker gains access to just one of these accounts, it automatically grants them access to any website you used these credentials to sign in to. Similarly, being locked out or losing access to your Google or Facebook account could mean losing access to all accounts associated with them.</p><p>This could happen in one of two ways. First, if you were to ever post something on your Facebook page that Facebook takes issue with or violates their Terms of Service, you could be locked out of your account and therefore every other account you used Facebook to sign in to. Second, if you were to use your business or employee account to sign in to a personal service, such as accessing your health insurance, once you no longer work there you would likely lose access to your business email and consequently lose the ability to sign in to your health insurance service.</p><p>My time at Tucows thus far has not only taught me about potential privacy threats online but has also provided me with effective tools to ensure my personal information stays private. By following these three simple tips, you can feel more confident about the security of your personal information online too!</p><h1>About the Author</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658397151/hlxjj3otkltgoe6j1hwj.png\"></p><p>Hello, my name is Hanna. I’m a recent graduate and Toronto native. I have an interest in privacy, policy research, drama series, and my dog Nova.</p><p>— —</p><p>Learn more about Tucows and how you can start a career in #MakingTheInternetBetter at <a href=\"https://tucows.com/careers/\" rel=\"noopener noreferrer\" target=\"_blank\">https://tucows.com/careers/</a></p><p><br></p>",
  "author": {
    "$oid": "62a2e971949b34418e39f93d"
  },
  "tagList": [
    "password",
    "security"
  ],
  "favorited": [
    {
      "$oid": "62a2e97f949b34418e39f945"
    },
    {
      "$oid": "62cff2fbc7ffb94bfe4eba48"
    }
  ],
  "comments": [],
  "createdAt": {
    "$date": {
      "$numberLong": "1658397148571"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1660904371078"
    }
  },
  "__v": 0,
  "publishAt": {
    "$date": {
      "$numberLong": "1658397148571"
    }
  }
},{
  "_id": {
    "$oid": "62d92990ac1e7ebd6a3f18ee"
  },
  "title": "5 Hacking Gadgets everyone should be aware of in 2022.",
  "description": "After the birth of internet in 1983, technology has grown with a whizz. Today we can’t even spend a single day without checking our phone. It has made our life so easy and everything is under our sleeves",
  "slug": "5-hacking-gadgets-everyone-should-be-aware-of-in-2022-62d92990ac1e7ebd6a3f18ee",
  "body": "<p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658399123/nabefdl9fk4q382phoxz.jpg\"></p><p>On the contrary side — we <strong>unknowingly</strong> put our data at risk while using our devices carelessly. There are many harmless looking (actually harmful) hacking devices that attacker uses to attack their targets.</p><p>Today, let’s have a look at some of those gadgets and be aware of their use against us.</p><h1>1. Keystroke Injectors</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658399123/cv6fqfxgbdbws5hnxv4f.jpg\"></p><p><strong>Keystroke Injectors</strong> disguised as a USB drive, are devices with firmware that when connected to any device will register it as a keyboard. It’ll then send preloaded key-strokes to the device and perform different attacks that are FUD (Fully Un-Detectable). Attacker can preload the key strokes inside it and send it to the target as a gift.</p><p>It can perform below tasks and many more</p><p>1. Download & Execute malware.</p><p>2. Execute System Commands.</p><p>3. Get a reverse shell.</p><p>4. Steal Passwords.</p><p><br></p><h1>2. Hardware Keyloggers</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658399122/hzvokhawpqg1yhe55fnr.jpg\"></p><p>This tiny device is able to store all the keystrokes of our device inside it and also on the cloud, if it is used to connect keyboard to your device. It can store information of every keystroke you make. This includes your browsing data, your passwords you type, your banking details & many more information. See below how every keystroke is recorder on the memory & cloud.</p><blockquote><em>[2021/5/14] 12:23:51] [F6]gmail.com[Enter]</em></blockquote><blockquote><em>[2021/5/14] 12:24:02]</em><strong><em> david.34@gmail.com</em></strong><em>[Tab]</em><strong><em>dav1223456</em></strong><em>[Enter]</em></blockquote><h1>3. USB Killer</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658399122/kaxmodpekfojwpqlslfw.jpg\"></p><p>The next device is a killer one as the name suggests. Imagine you get this drive somewhere and you plug it in any of your device. What will happen is — after few seconds you’ll hear some ticking sound and the device screen will go off. It’ll kill your device 🥴.</p><p>It also looks similar to a USB drive but has capacitors inside it that charges from the power line and discharges -200V DC current back to the victim device. This cycle is repeated many times per second, resulting in device being burned & unrepairable.</p><p>You can see how it works — <a href=\"https://www.youtube.com/watch?v=I6bRoSK39io\" rel=\"noopener noreferrer\" target=\"_blank\">here</a>.</p><h1>4. ProxMark 3 Card NFC & RFID Reader</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658399123/jcvwnqnduza2qghkgemp.png\"></p><p>Many of the day-to-day devices uses RFID (Radio Frequency Identification) to share data. You might have seen many door locking systems using RFID that unlocks when a card is held in front of it. Also our tapping of credit cards uses RFID.</p><p>This device can read any of the card and clone it into an empty one which can further be used as many times as required. It also provides multiple functionalities when connected to PC.</p><p>Knowing how this works, <strong>we can prevent this</strong> <strong>if we keep our cards in RFID blocking case</strong>. This will stop it from sending radio frequencies that this device detects. 😁</p><h1>5. Android phone with NetHunter</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658399123/cxtyq2mgpc5nq7wtbx9b.png\"></p><p>Almost all of us use a smartphone and sometimes it’s essential for us to connect someone else’s phone to our desktops or PC; and that’s totally fine right? — NO! it isn’t.</p><p>We have seen hackers working on their PC’s in movies, but never seen them hacking with their phones. Can they really do it ? 🤔 — A big YES!</p><p>NetHunter is a mobile penetration testing platform that comes with a large number of hacking tools preinstalled. Let’s say you are at a coffee shop and someone asks you if they can quickly charge their phone on your laptop. Being kind you let the person connect it to your laptop. Now, without even touching the phone it can send keystrokes to your laptop to perform different tasks like setting up a backdoor, stealing passwords and many more.</p><p>This was the list of some of the devices that you should be aware of. I hope this was helpful.</p><blockquote>Until next time. (<strong>>‿◠)</strong>✌</blockquote><blockquote>Stay vigilant!</blockquote><p><br></p><p><br></p><p><br></p><p><br></p><p><br></p>",
  "author": {
    "$oid": "62a2e976949b34418e39f941"
  },
  "tagList": [
    "hacker"
  ],
  "favorited": [
    {
      "$oid": "62a2e971949b34418e39f93d"
    },
    {
      "$oid": "62ef2b30279d8fd4f9f2d6d6"
    }
  ],
  "comments": [],
  "createdAt": {
    "$date": {
      "$numberLong": "1658399120228"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659841708054"
    }
  },
  "__v": 0,
  "publishAt": {
    "$date": {
      "$numberLong": "1658399120228"
    }
  }
},{
  "_id": {
    "$oid": "62d92ab6ac1e7ebd6a3f193c"
  },
  "title": "The most important lessons I’ve learned after a year of working with React",
  "description": "Starting out with a new technology can be quite troublesome. You usually find yourself in a sea of tutorials and articles, followed by millions of personal opinions",
  "slug": "the-most-important-lessons-ive-learned-after-a-year-of-working-with-react",
  "body": "<p><br></p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658399417/p5wyrsqq3uchnsqk2iiy.png\"></p><p>Starting out with a new technology can be quite troublesome. You usually find yourself in a sea of tutorials and articles, followed by millions of personal opinions. And every single one states that they found the <strong>“right and perfect way.”</strong></p><p>This leaves us debating whether our chosen tutorial will be a waste of time or not.</p><p>Before diving into the ocean, we must understand the underlying concepts of a technology. Then we need to develop a technology-based mindset. If we are starting to learn React, we first have to think in React. Only later on we can start mixing various mindsets into one.</p><p>In this article we’ll be covering some lessons I learned regarding this mindset from my personal experiences with React. We’ll go over the days at work and nights with personal projects and even the talk I gave at a local JavaScript event.</p><p>So let’s go!</p><h1>React is evolving, so you must be up to date</h1><p>If you remember the initial announcement of version 16.3.0, you’ll remember how excited everyone was.</p><p><br></p><p>Here are some of the changes and improvements we received:</p><ul><li>Official Context API</li><li>createRef API</li><li>forwardRef API</li><li>StrictMode</li><li>Component Lifecycle Changes</li></ul><p>The React Core team and all the contributors are doing a great job trying to improve the technology we all adore. And in version 16.4.0 we received <a href=\"https://reactjs.org/blog/2018/05/23/react-v-16-4.html\" rel=\"noopener noreferrer\" target=\"_blank\">Pointer Events</a>.</p><p>Further changes are surely coming, and it’s only a matter of time: Async Rendering, Caching, version 17.0.0 and many others not yet known.</p><p>So if you want to be at the top, you have to be up to date with things that are happening in the community.</p><p>Know how things work and why they are being developed. Learn what problems are being solved and how development is being made easier. It’ll really help you out.</p><h1>Don’t be afraid to split your code into smaller chucks</h1><p>React is component-based. So you should leverage this concept and not be afraid to split bigger pieces into smaller ones.</p><p><br></p><p>Sometimes a simple component can be made of 4–5 lines of code, and in some cases, it is totally fine.</p><p>Make it so that if a new person jumps in, they won’t need days to understand how everything works.</p><p>// isn't this easy to understand?</p><p><br></p><p>You don’t have to make components that all have complex logic built-in. They can be only visual. If this improves code readability and testing, and reduces further code smells, it’s a great win for everyone on the team.</p><p>import ErrorMessage from './ErrorMessage';</p><p><br></p><p>In the above example, the properties are static. So we can have a pure component which is responsible for the website’s error message Not Found, and nothing more.</p><p>Also, if you don’t like having CSS classes as class names everywhere, I would recommend using styled components. This can improve readability quite a lot.</p><p><br></p><p><br></p><p>  {skipRatePre}</p><p>  Skip Rate</p><p>If you’re afraid of creating more components because of polluting your folders with files, rethink how you structure your code. I have been using the <a href=\"https://hackernoon.com/fractal-a-react-app-structure-for-infinite-scale-4dab943092af\" rel=\"noopener noreferrer\" target=\"_blank\">fractal structure</a> and it’s awesome.</p><h1>Don’t stick to the basics — become advanced</h1><p>You might think sometimes that you don’t understand something enough to move on to the advanced stuff. But often times you shouldn’t worry about it too much — take up the challenge and prove yourself wrong.</p><p><br></p><p>By taking up the advanced topics and pushing yourself, you can understand more of the basics and how they are used for bigger things.</p><p>There are many patterns which are yours to explore:</p><ul><li>Compound Components</li><li>High Order Components</li><li>Render Props</li><li>Smart/Dumb Components</li><li>many others (try out Profiling)</li></ul><p>Explore them all, and you’ll know why and where they are used. You’ll become more comfortable with React.</p><p>// looks like magic?</p><p>// it's not that hard when you just try</p><p><br></p><p><br></p><p>Also, don’t be afraid to try something new at your work — within certain boundaries, of course! Don’t just experiment on personal projects.</p><p>People will ask questions, and that is normal. Your task is to defend your work and decisions with strong arguments.</p><p>Your aim should be to solve an existing problem, make further development easier, or just clean some pasta in the code. Even if your suggestions are rejected, you’ll go home knowing more than by sitting silent.</p><h1>Don’t over-complicate things</h1><p>This might sound like a counter argument, but it’s different. In life, and everywhere, we must have balance. We shouldn’t over-engineer to show off. We must be practical. Write code which is easy to understand and fulfills its purpose.</p><p><br></p><p>If you don’t need Redux, but you want to use it because everyone uses without knowing it’s true purpose, don’t. Have an opinion and don’t be afraid to stand up for yourself if others push you.</p><p>Sometimes you might think that by leveraging the latest technologies and writing complex code you’re saying to the world:</p><p>“I’m not a junior, I am becoming a mid/senior. Look what can I do!”</p><p>To be honest, that was my mindset in the beginning of my developer journey. But over time you understand that the code which was written without showing off or because “it works” is easier to live with.</p><ol><li>Co-workers can work on your projects and you’re not the only person who’s responsible for developing / fixing / testing <<strong>insert task>.</strong></li><li>The team can understand what others did without sitting through a long meeting. A couple of minutes is enough to discuss.</li><li>When your colleague goes out for a two week vacation, you can take over their task. And you won’t have to work on it for 8 hours, because it can be done in an hour.</li></ol><p>People respect people who make other people’s lives easier. Thus if your goal is to gain respect, move up the ranks, and improve, aim to code for the team and not yourself.</p><p>You’ll become everyone’s favorite team player.</p><h1>Refactor, refactor and refactor — it’s normal</h1><p>You will change your mind dozens of times, although the project manager will change theirs more often. Others will criticize your work, and you will criticize it. As a result, you’ll have to change your code many, many times.</p><p><br></p><p>But don’t worry, it’s a natural learning process. Without faults and errors we cannot improve.</p><p>The more times we fall down, the easier it becomes to get back up.</p><p>But here’s a hint: make sure you test your current software. Smoke, unit, integration, snapshot — don’t be shy of them.</p><p>Everyone has faced or will face a scenario when a test could have saved precious time.</p><p>And if you, like many people, think that they are a waste of time, just try thinking a little different.</p><ol><li>You won’t have to sit with your colleague explaining how things work.</li><li>You won’t have to sit with your colleague explaining why things broke.</li><li>You won’t have to fix bugs for your colleague.</li><li>You won’t have to fix bugs which were found after 3 weeks.</li><li>You will have time to do stuff you want.</li></ol><p>And these are quite big benefits.</p><h1>If you love it, you’ll thrive</h1><p>Over the previous year, my goal was to get better at React. I wanted to give a talk about it. I wanted others to enjoy it with me.</p><p><br></p><p>I could sit all night coding non-stop, watching various talks and enjoying every minute of it.</p><p>The thing is, if you want something, somehow everyone starts helping you. And last month, I gave my first React talk to a crowd of 200 people.</p><p>During this year period I became stronger and more comfortable with React — the various patterns, paradigms, and inner workings. I can have advanced discussions and teach others about topics that I was afraid to touch.</p><p>And today I still feel the same excitement and enjoyment I felt a year ago.</p><p>Therefore I would recommend everyone to ask themselves: “Do you enjoy what you do?”</p><p>If not, continue looking for that special piece which you can talk about for hours, learn about every night, and be happy.</p><p>Because we have to find something that is closest to our hearts. Success cannot be forced, it must be achieved.</p><p>If I could go back a year in time, this is what would I say to myself to prepare before the big journey ahead.</p><p>Thank you for reading!</p><p>If you found this article helpful, 👏👏👏.</p>",
  "author": {
    "$oid": "62a2e976949b34418e39f941"
  },
  "tagList": [
    "react",
    "learn"
  ],
  "favorited": [
    {
      "$oid": "62a94e8bf5905f38ca3c13c2"
    },
    {
      "$oid": "62a2e971949b34418e39f93d"
    },
    {
      "$oid": "62ef2b30279d8fd4f9f2d6d6"
    }
  ],
  "comments": [],
  "createdAt": {
    "$date": {
      "$numberLong": "1658399414200"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659841703594"
    }
  },
  "__v": 0,
  "publishAt": {
    "$date": {
      "$numberLong": "1658399414200"
    }
  }
},{
  "_id": {
    "$oid": "62d92ccaac1e7ebd6a3f19b9"
  },
  "title": "The Ski Lift Pitch — LivenPay in 90 Seconds",
  "description": "Liven is a mobile payment and rewards wallet enabling instant crypto-payments at point of sale, and rewarding customers for spending with LVN — The Digital Currency for Food",
  "slug": "the-ski-lift-pitch-livenpay-in-90-seconds-62d92ccaac1e7ebd6a3f19b9",
  "body": "<p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658399950/mepafxl9qxdwdalogzac.png\"></p><p>LivenPay is a payment network and token reward protocol powering the Liven wallet, and enabling tens of thousands of retail brands to natively accept integrated fiat+crypto payments with intelligent network rewards.</p><p>The Liven ecosystem is a closed-loop economy where businesses subscribe to a payments & marketing software, consumers are rewarded for spending, and Liven facilitates seamless flow of LVN tokens as the network’s native currency.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658399950/imsmxswanuji6z2sczjj.png\"></p><p>Founded in Melbourne, Australia, and now operating in 3 cities, 350,000 consumers use Liven to pay for goods and services, share money with friends, and discover new experiences at any of the 1000+ business partners. Liven has been in operation for three years as a mobile payment wallet, and employs over 40 people in 5 cities.</p><p>Liven aims to use blockchain technology and cryptocurrencies to create a globally interoperable payment network, solving issues in the usability and efficacy of loyalty and payment solutions, and bringing a practical, consumer centric use case to cryptocurrencies as a medium of exchange.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658399950/d1llkmyjwvtjvpiexpxn.png\"></p><p>The Liven Wallet and payment gateway are available publicly on the <a href=\"https://itunes.apple.com/au/app/liven-eat-earn/id857653005?mt=8\" rel=\"noopener noreferrer\" target=\"_blank\">Apple App Store</a> and the <a href=\"https://play.google.com/store/apps/details?id=au.com.liven.android&hl=en_AU\" rel=\"noopener noreferrer\" target=\"_blank\">Google Play Store</a>. LVN can be earned, spent, traded between users, and purchased, but cannot be withdrawn until conclusion of the public sale.</p><p><a href=\"https://livenpay.io/\" rel=\"noopener noreferrer\" target=\"_blank\">livenpay.io</a></p>",
  "author": {
    "$oid": "62a2e976949b34418e39f941"
  },
  "tagList": [
    "bitcoin",
    "lamgiau"
  ],
  "favorited": [
    {
      "$oid": "62ef2b30279d8fd4f9f2d6d6"
    }
  ],
  "comments": [
    {
      "$oid": "62dfa249a165192a6116a16e"
    },
    {
      "$oid": "62dfa4ea47e9940cc49364fb"
    },
    {
      "$oid": "62dfa50c47e9940cc493651e"
    },
    {
      "$oid": "62dfa55b47e9940cc493654b"
    },
    {
      "$oid": "62dfa72247e9940cc4936671"
    },
    {
      "$oid": "62dfa9ca86d767c2345d5d51"
    },
    {
      "$oid": "62eca2bf1ae43d76a2577434"
    },
    {
      "$oid": "62eccaa38c8ef1bd1262d174"
    }
  ],
  "createdAt": {
    "$date": {
      "$numberLong": "1658399946663"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659841697706"
    }
  },
  "__v": 0,
  "publishAt": {
    "$date": {
      "$numberLong": "1658399946663"
    }
  }
},{
  "_id": {
    "$oid": "62da2250223d2a499532e86d"
  },
  "title": "10 GitHub Security Best Practices",
  "description": "GitHub is the largest source code host in the world and is used by over 73 million developers, and 4 million organizations and hosts over 200 million repositories.",
  "slug": "10-github-security-best-practices",
  "body": "<p>While the organizations’ teams are growing, GitHub security can be more complicated and challenging to track. Also, GitHub’s security misconfigurations, public repositories, and hardcoded credentials could attract attackers. Today, we’re going to talk about 10 GitHub security best practices and why we should configure these. Let’s start together!</p><h1>1. Never store credentials in GitHub</h1><p>Lots of developers tend to store secrets such as API keys, database username/password, and private keys in their GitHub repositories. This is the easiest way to deal with a functional coding problem, but the worst idea for the security side. <a href=\"https://www.darkreading.com/application-security/companies-code-leaking-more-passwords-and-secrets\" rel=\"noopener noreferrer\" target=\"_blank\">In a recent research,</a> on average, three out of every 1,000 commits to GitHub leaked a secret.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658462798/s1sfgqj3wsi8n2ue5yuu.png\"></p><p>GitHub repositories are meant to be shared, with your teammates, your company, or publicly. However, every secrets key and credentials do not need to be shared with everyone. For example, when a temporary developer joins the repository to solve a quick problem and then the team forgets the delete the developers from the repository. After that, an attacker can capture developers’ password and gets all the secrets from the repository. Besides user credentials being captured, all company secret keys are leaked, leading to a disaster.</p><p>Additionally, there’s a risk that source code is leaked. Sometimes repositories are created publicly accessible accidentally and attackers love the public repositories to get secrets. Also, developers work in a local copy of the repository and this may leak due to malware, hacking or accidental disclosure. Attackers get all secrets from local copies, that’s also a disaster.</p><p><br></p><p>To prevent accidentally pushing secrets to the GitHub repository, you can use some open source tools such as <a href=\"https://github.com/awslabs/git-secrets\" rel=\"noopener noreferrer\" target=\"_blank\">git-secrets.</a> You need an audit to your repositories with some tools such as <a href=\"https://github.com/trufflesecurity/trufflehog\" rel=\"noopener noreferrer\" target=\"_blank\">truffleHog</a> for your regular checks.</p><h1>2. Always use MFA</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658462798/tahkiaghpsyqhrfhbfyb.png\"></p><p>As you know, only using strong passwords isn’t secure enough anymore. Attackers have developed lots of tested methods of stealing credentials such to gain unauthorized access to our accounts. For this reason, it has become very important to enable MFA in our GitHub user accounts, as it is in any account. Besides MFA enabling, you should enforce MFA for every GitHub user in your organization. To enforce, select Your Profile Photo → Your Organizations→ Settings → Security →Authentication Security. You can see all the details here.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658462798/vsolw4d8fbibeijnds82.png\"></p><h1>3. Create a SECURITY.md file</h1><p>In addition to the README.md file, you need to include a <a href=\"https://docs.github.com/en/code-security/getting-started/adding-a-security-policy-to-your-repository\" rel=\"noopener noreferrer\" target=\"_blank\">SECURITY.md</a> file that includes security information for your project. SECURITY.md file should contain:</p><ul><li><strong>Disclosure policy:</strong></li><li> You need to define the procedure for who is the person that found </li><li>security issues, and who is the contact person for these. You can </li><li>configure the ‘security@’ email.</li><li><strong>Security Update policy:</strong> You need to define how you intend to update users about new security vulnerabilities as they are found.</li><li><strong>Security-related configuration:</strong> This part includes settings that users should consider that would impact the security posture of deploying this project.</li><li><strong>Known security gaps & future enhancements.</strong> This part includes security improvements you haven’t implemented yet.</li></ul><h1>4. Disable forking</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658462798/gxoo52dvu1mcwreppkpk.png\"></p><p>Forking means creating a copy of a repository that we manage. The fork option is very useful in such cases because we can make changes to a project without affecting the original repository. However, from a GitHub security perspective, forking causes the harder tracking of security issues. Also, repository users can fork all code repositories to their private accounts. To disable/enable the forking option, select Your Profile Photo → Your Organizations→ Settings→ Member Privileges. In the repository forking part, you can see the disable/enable option.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658462798/lylrqw3rlc3pnpnthx4g.png\"></p><h1>5. Review your third-party access and GitHub applications</h1><p>GitHub applications are very useful to add lots of features to our repositories, but we need to be careful. Before adding a GitHub application, you need to review the applications and their credibility. If applications have any security issues, negative comments, or unknown authors, you need to think twice before authorizing your GitHub organization. Also, for each application, you need to audit the permissions they require and you need to be sure they do not have more permissions than they need. You should review both the “Third-party access” and “Installed Github Apps” regularly to make sure no unauthorized access is granted.</p><h1>6. Disable public repository creation</h1><p>If your organization does not need public repositories, you need to disable public access to prevent the accidental creation of publicly accessible repositories. To do this, Your Profile Photo → Your Organizations→ Settings→ Member Privileges. In the repository creation part, you can see the settings.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658462798/hrrgmaoar5xko7glu1r2.png\"></p><h1>7. Use GitHub teams for access control</h1><p>Everyone in your organization does not need access to every repository. You need to create teams for your organization’s workflows such as <em>developers</em>, security engineers, managers, etc. You can also set a role for every repository like read, write, and admin. Always think of the least privilege principle for every case.</p><h1>8. Configure IP whitelisting</h1><p>Tracking everyone’s actions is very important and hard for large organizations. When someone leaves the organization and is not deleted from the repositories, it can be very risky.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658462798/v9pvwwp4ppijtsohel7v.png\"></p><p>Also when an attacker captures a GitHub user’s password with different methods, they can get full access to the organization’s repositories. To prevent these situations, you need to use IP whitelisting for your GitHub organizations as <em>an</em> additional method. You can use your VPN or office network CIDR for this.</p><p><strong><em>Note:</em></strong><em> You need to use GitHub Enterprise for IP whitelisting option.</em></p><h1>9. Scan your repositories regularly</h1><p>Regular code scanning provides vulnerabilities to be detected and remediate as <em>soon</em> as <em>possible</em>. <em>For</em> your GitHub repositories, you can use the code scanning feature in GitHub or you can use third-party sources such as <em>SonarQube</em>.<em>Scanning</em> your repositories regularly helps you to find and prioritize fixes for existing security vulnerabilities. It also prevents developersfrom creating new security problems. You can do this by defining new workflows, and new push/pull mechanisms. For example, when a new vulnerability is founded in code, your repository does not allow the committing.</p><h1>10. Review your audit logs</h1><p>GitHub audit log allows organizations to quickly review the actions performed by members of their organization. It includes details such as who performed the action, what the action was, and when it was performed. You should periodically review the audit log and make sure that there are no anomalous or suspicious activities.</p><h1>Conclusion</h1><p>GitHub is the world’s largest code management system, but still, are you sure if your code is being stored securely? In this blog, we’ve summarized 10 GitHub Security Best Practices for you. We also share some useful steps that you can use in these best practices. We hope you enjoyed it! You can start to implement these today to stay secure in GitHub!Check out our Devops services to stay secure!If you want to read more on this topic, feel free to check out the PurpleBox Blog Section.</p>",
  "author": {
    "$oid": "62a94e8bf5905f38ca3c13c2"
  },
  "tagList": [
    "security",
    "github"
  ],
  "favorited": [
    {
      "$oid": "62a2e971949b34418e39f93d"
    }
  ],
  "comments": [],
  "createdAt": {
    "$date": {
      "$numberLong": "1658462800256"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659514517652"
    }
  },
  "__v": 0,
  "publishAt": {
    "$date": {
      "$numberLong": "1658462800256"
    }
  }
},{
  "_id": {
    "$oid": "62da5b4af1e8c8edf84247d8"
  },
  "title": "Clean Code — A practical approach",
  "description": "After giving some talks about Clean Code I have decided to summarize the most important things in an article. ",
  "slug": "clean-code-a-practical-approach-62da5b4af1e8c8edf84247d8",
  "body": "<p>Because there is a lot of posts and information in the net about Clean </p><p>Code, I think that a new article talking about it simply explaining some</p><p> the principles is not going to be very worthy.</p><p>In this article I will try to give you a practical approach to Clean Code. I will not go deep into the theory, <strong>I want to show how I write Clean Code</strong>.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658477385/h2gfyifs2miokznvy5zz.png\"></p><h1>What is Clean Code and why should we care?</h1><h2>Origin and a definition</h2><p>It’s mandatory to talk about the <a href=\"https://www.goodreads.com/book/show/3735293-clean-code\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>book written by Robert C. Martin</strong></a></p><p> in 2008 with the same name. But there are more books and experienced </p><p>developers talking about similar concepts before the first release of </p><p>the book.</p><p>I have built a kind of <strong>definition of Clean Code</strong> joining the opinions of several authors and sources and what I get is that Clean Code has these features:</p><ul><li>It is <strong>important</strong>, at least as important as other concepts like performance, cover the functionality, avoid bugs, …</li><li>It is <strong>easy</strong> for any developer<strong> to read</strong>.</li><li>It is <strong>easy</strong> for any developer <strong>to modify</strong>.</li><li>It was written by someone who <strong>cares it</strong>.</li><li>It does what is expected. The code does not fool you, <strong>no surprises</strong>.</li></ul><h2>Why you should write clean code</h2><p>I really believe that writing Clean Code is important because it’s the first step to cover the main goal of any architecture: <strong>minimize the human effort needed to create and maintain the required system</strong>.</p><p>When we are coding, <strong>we</strong> use to <strong>spend more time</strong> (much more time) <strong>reading code than writing</strong>.</p><p> We read legacy code, libraries code, your team mates code, code written</p><p> by you several months ago (that you don’t remember), code written by someone who left the company, code in Stack Overflow… Robert Martin puts</p><p> some numbers to this:</p><p>“Indeed, the ratio of time spent reading versus writing is well over 10 to 1” — Robert C. Martin, Clean Code</p><p>Taking this in consideration, is not it worth a little extra writing effort? <strong>You will get back several times the extra time you spend cleaning your code</strong>. Think about it the next time you are going to commit a piece of code.</p><p>Last thought about why we should care our code is that we, the </p><p>developers, do not write code solely to be interpreted by machines. <strong>We write code to be read by humans</strong>. Let’s think that <strong>we are authors</strong>, in the same way that a journalist writes in a newspaper or a writer creates a novel.</p><h1>Some principles</h1><p>There are many principles and ideas about what is clean and what is not.</p><p> You can find them in the book and also on the net. But because I need <strong>some basic principles to have something to play with</strong>,</p><p> I am going to introduce some of them. If you already know them you can </p><p>skip to the next section, if not I think they will allow you to get an </p><p>idea of the style of the rest of the theory and, perhaps, the motivation</p><p> to know more.</p><p>So, let’s see some principles with code.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658477385/okox1n74jtblwt9eyghm.png\"></p><h2>Naming</h2><p>We are <strong>deciding names</strong> everywhere when we are coding: <strong>variables</strong>, <strong>functions</strong>, <strong>classes</strong>, <strong>packages</strong>, <strong>files</strong>… Taking it seriously is a first step to having Clean Code.</p><p>Some tips to get clean names:</p><ul><li>Use <strong>intention-revealing names</strong>:</li></ul><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658477385/umdi7gzjijdvy52ecwls.png\"></p><ul><li>Choose pronounceable names:</li></ul><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658477385/cyhhknjwktod3ybk26gl.png\"></p><ul><li>Use searchable names:</li></ul><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658477385/bjjhsojqfegrnaqyeaaw.png\"></p><ul><li>Avoid prefixes and suffixes and abbreviations</li></ul><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658477385/lt2yv7ypahxh7z9gxwcq.png\"></p><p>There are many other tips about choosing good names. Probably use </p><p>intention-revealing names is the most important but what is really </p><p>important is to <strong>take the naming seriously</strong>.</p><p><strong>Take your time to choose good names</strong>. And don’t be afraid to <strong>change an existing name</strong> if you think that the code is going to be more readable after the change.</p><h2>Functions</h2><p>Between all the ideas about clean functions I am going to highlight three for this post.</p><p>First rule is basic and easy to remember: <strong>Functions should do one thing</strong>,</p><p> they should do it well and they should do it only. Not too much to </p><p>explain here: avoid side effects, split your functions if you notice </p><p>that they are doing several things at the same time.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658477385/p2vejl62bqygs4hl88w8.png\"></p><p>Functions <strong>should be small</strong>. Ok, but how short they should be? How to measure it? Let’s force our functions to have <strong>no more than2 levels of indentation</strong>.</p><p> If this is hard for you, you can start setting a higher limit (3 </p><p>levels, for example), but please put a limit on the levels of </p><p>indentation you allow.</p><p><br></p><p>Regarding the arguments… <strong>The fewer arguments a function has, the cleaner it is</strong>.</p><p> Why? Arguments need a lot of context knowledge. In each call a reader </p><p>must have context to understand each argument. More arguments→ more </p><p>context you need to understand. Arguments are also hard from a testing </p><p>point of view. More arguments, more test cases to ensure that all the </p><p>combinations of arguments work properly</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658477385/xerr9ojor1nuqyylmzdw.png\"></p><h2>Comments</h2><p>When I learned to code in the 90's, my teachers used to ask me to write </p><p>comments everywhere. It was typical to hear them say things like “<em>If you don’t comment your code, I’m not going to correct your exam…</em>”.</p><p> The goal of those comments was to make our code easier to read. This is</p><p> a goal that we also have when writing Clean Code, but maybe comments </p><p>are not the best way to achieve it.</p><p>“Comments compensate for our failure to express ourselves in code. Comments are always failures” — Robert C. Martin, Clean Code</p><p>I agree with Martin in this point. He also says that <strong>comments lie</strong>, and I am sure that we have all found old comments saying something outdated. Because the code is maintained, but <strong>there is nothing that forces the comments to be maintained</strong> as well. Is there anything worse than a fake comment?</p><p><strong>The truth is only in the code</strong>. When you think you need to write a comment, always think if there is not a <strong>better way to express this using the code</strong>.</p><p>The most important idea is to try to <strong>avoid comments to explain the code. </strong>For example:</p><ul><li>Avoid comments to explain a variable. Instead, choose a good name for this variable and you won’t need a comment</li><li>Avoid comments to explain a function. Instead, force your function to do only one thing, have few arguments and choose a good name for it and its arguments and you won’t need a comment</li></ul><p><strong>Let’s see a practical case:</strong></p><p>1. We have something complex. We feel that is going to be hard to understand in the future:</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658477385/qjba99n0r0oitwh53bd3.png\"></p><p>2. We can add a comment to make it easier to understand:</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658477385/urcdj7nc4znmrwvrcstd.png\"></p><p>3. Let’s try another option, let’s extract the complex code to a method with a cool name:</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658477385/cpmjjaa6kcyf0lgtfkrl.png\"></p><p>Think about what a future <strong>reader will want to know</strong> when they find this if. They will be interested to know that this if is checking if the year is a leap year, but probably <strong>they will not be interested in how</strong> we are getting it. If they are curious, they can navigate to the implementation of this coolly named method. Unintentionally, <strong>by avoiding a comment we are separating different levels of abstraction</strong> in our code.</p><p>So, in general, avoid comments to explain code. And, because you will be</p><p> using GIT or any other distributed version control system, avoid </p><p>commented-out code (delete it!), attributions and bylines, and this kind</p><p> of stuff.</p><p>Comments are not forbidden, there are situations where comments make sense:</p><ul><li>Legal comments</li><li>TODO comments</li><li>Amplifications about the importance of something or the reason of a concrete decision in the code</li><li>Mandated</li><li> comments (JavaDocs, …) in public APIs (but, avoid this in non-public </li><li>code… don’t force a team to comment the all the functions of all your </li><li>classes!!!)</li></ul><h2>More principles</h2><p>As I told before, I was going to comment just a few principles to get a basic understanding of the Clean Code theory. So, these are only some of the most basic ideas about Clean Code. If you find them interesting and you want to know more, look for more resources on the net or, directly,read Martin’s book.</p><h1>How to clean your code? Refactor is the key</h1><p>Well, good naming, small functions, no comment to explain the code… got </p><p>it. But, how can I do it? How can I write code following these ideas?</p><p>Our job is hard in itself. Writing code and getting it to work can </p><p>already be enough challenge. And that without worrying about leaving it </p><p>clean.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658477386/aelwx753nuzl5autcmok.png\"></p><p>So, the keyword here can be Refactor. A good way can be to <strong>write code without worrying too much about cleanliness</strong>, and <strong>later</strong>, when we have the code doing what we want, <strong>clean it up with a refactor</strong>.</p><h2>Definition of Refactor</h2><p>Code refactoring is the process of <strong>restructuring</strong> existing code <strong>without changing</strong> its external behavior. It means that the code before and after the refactor must do exactly the same.</p><p>Things that are not refactors:</p><ul><li>Change an algorithm</li><li>Replace one type of loop with another</li><li>Upgrade the performance of a piece of code</li></ul><p>Things that are refactors:</p><ul><li>Extract a piece of code to a Function</li><li>Rename things</li><li>Extract several functions to a new Class.</li><li>Create a constant to store a hardcoded value</li><li>…</li></ul><h2>Safe Refactoring</h2><p>Maybe you are thinking that “<em>I don’t want to break the code, it’s working fine!</em>”. Yes, of course. It could have been quite difficult to get the <strong>code working, we don’t want to break it </strong>when<strong> refactoring</strong>. And this is the typical reason people argue for not changing very bad code. But don’t worry, there is safe way.</p><p>We can rely on two things to <strong>refactor without fear:</strong></p><p><br></p><p><br></p>",
  "author": {
    "$oid": "62a94e8bf5905f38ca3c13c2"
  },
  "tagList": [
    "clean",
    "refactor",
    "code"
  ],
  "favorited": [],
  "comments": [],
  "createdAt": {
    "$date": {
      "$numberLong": "1658477386431"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659514512906"
    }
  },
  "__v": 0,
  "publishAt": {
    "$date": {
      "$numberLong": "1658477386431"
    }
  }
},{
  "_id": {
    "$oid": "62da5e86f1e8c8edf8424920"
  },
  "title": "Incident response playbooks, where to start?",
  "description": "What goes on in your mind when you think about “Incident Response Playbooks”?",
  "slug": "incident-response-playbooks-where-to-start-62da5e86f1e8c8edf8424920",
  "body": "<p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1658478214/iaqcoyimjcrjlihpd0hl.jpg\"></p><p>Reading this, your background will most likely fit in one of two categories:</p><p>1. You are a manager for a while now and really dig deep into processes, ensuring a corporate quality standard. You made sure to have written documents available about every scenario you and your news reader have been able to think of. Your playbooks will align to those scenarios (top-to-bottom).</p><p>2. You are a technical person or affiliated to, so you did what us techies do: staring at logs for some weeks and making a list of every log entry appearing suspect (<em>or comes climbing out a cyber ventilator, definitely sus</em>:)). You put those into a nice Excel file (egrep/cut/piped the crap out of the log files) and took them as “to be categorized” (bottom-to-top).Whatever category sounds more appealing to you, both approaches needs to translate into an incident response playbook worthy of the name.Personally, I like the top-to-bottom approach. It is not recommendable to start with the limitations of the platform, stick to your best practice and close the gaps in between by improving the detection as well as respond capabilities of your favorite platform.</p><p>As a result:</p><ul><li><strong>Awareness of gaps</strong>. Maybe your process isn't really doable, <em>that happens</em>. That could be resolved by improving on the technology side or updating your processes focusing on the “doable” factor.</li><li><strong>You save a lot of work.</strong> As the flow feature of many modern SOAR or Incident Response platforms is already pretty close to the swim-lane designs you have put in your processes - translating those into playbooks is rather fast and easy.</li><li><strong>You know your repeatable work </strong><em>(Sisyphus adios). </em>Let’s be honest, many response playbooks look the same for 30% of the tasks.Those 30% consisting mostly of dismantling and enrichment as well as some queries to your active directory or other internal platforms. These parts can be standardized and reused as a part of all incident response playbooks.</li></ul>",
  "author": {
    "$oid": "62a94e8bf5905f38ca3c13c2"
  },
  "tagList": [],
  "favorited": [
    {
      "$oid": "62a2e971949b34418e39f93d"
    },
    {
      "$oid": "62c7f547787600079e1fe7ae"
    }
  ],
  "comments": [],
  "createdAt": {
    "$date": {
      "$numberLong": "1658478214880"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659685818245"
    }
  },
  "__v": 0,
  "publishAt": {
    "$date": {
      "$numberLong": "1658478214880"
    }
  }
},{
  "_id": {
    "$oid": "62edc0b14479193a536409dd"
  },
  "title": "6 Ways I Made Money from Coding (without a job)",
  "description": "If you can’t get a job as a programmer, try these options.",
  "slug": "6-ways-i-made-money-from-coding-without-a-job-zKiaOALOZ5",
  "body": "<p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659748528/yg6ypkjnez9psgwppayg.jpg\"></p><p>Getting a job as a programmer is tough. Sometimes you might not have enough experience for the job or the salary offered isn’t what you expect.</p><p><br></p><p>However, that doesn’t mean we can’t make money from coding. There are different reliable options that can help you earn money while waiting for your dream job (and can even become your main income).</p><p>Here are 6 ways I made money from coding. I’ve tried all of them, so I’ll also share the pros, cons, and potential income based on my own experience.</p><p><em>If you don’t feel like reading, you can watch my video below.</em></p><h2>1. Freelancing</h2><p>Websites such as Fiverr and Upwork make the life of freelancers easier. We don’t need to actively look for clients anymore, but they come to us on these platforms. Of course, both websites will take their cut for every service we deliver, but this still is worth it.</p><p>I have some experience on Fiverr as a buyer as well as a seller and I think it’s a good option if you already have some clients, so you don’t start from scratch but have someone who can help you start off on the right foot. Good ratings and reviews attract new clients on Fiverr.</p><p>On Fiverr, you only need to create an account to start offering a service (aka gigs). You can create as many gigs as you want from web development to web scraping, but I recommend you start in a small niche.</p><p>For example, Fiverr has already many gigs in web development, so you might find it hard to get clients in that niche because there is too much competition. However, if you’re in a small niche within web development, your chances to get a client will increase.</p><p><strong>Pros: </strong>You don’t have to actively look for clients.</p><p><strong>Cons:</strong> There’s already too much competition, so you have to choose your niche wisely.</p><p><strong>Potential income: </strong>You can set the price. Some people’s gigs start at $20 while others at $100.</p><h2>2. Making online courses</h2><p>Selling online courses is very profitable, but there are so many online courses out there that only a few get a good piece of the pie.</p><p>Again, you need to find a niche where there is little competition. If there aren’t many bestseller courses in a field, probably that field is worth it.</p><p>Also, you need to check what are the strengths and weaknesses of the other online courses. How? Just check out the feedback section of the course. For example, on Udemy, there are many positive and negative comments on the “students feedback” section of any course. Try to read some of them and keep them in mind when building your own course.</p><p>If it’s your first time making online courses, you could buy a cheap course and learn the structure of it. If the course you’re getting belongs to the competition, then you could see firsthand what you should do and what you should avoid.</p><p><strong>Pros: </strong>Online courses are good for building a passive income.</p><p><strong>Cons:</strong> Some fields are so crowded that is too hard to sell courses</p><p><strong>Potential income: </strong>I started making more than $450/month with my first course.</p><h2>3. Making video tutorials (without showing your face)</h2><p>Everyone knows that people make money on YouTube, but only a few know that you don’t need to have many subscribers (or show your face) to earn a decent amount of money.</p><p>Yes,YouTube videos make money through ads, but the thing is, this isn’t the only way (or the most profitable way) to make money on YouTube. You can also make money with affiliate links and sponsored content.</p><p>If your channel has a small, yet valuable niche like technology or artificial intelligence, companies could contact you to sponsor one of your videos or to make a dedicated video about their platform. The payment for a single video tends to be more than for the other options listed in this article.</p><p><strong>Pros: </strong>You not only get paid for making videos, but you build your own brand.</p><p><strong>Cons:</strong> Growing on YouTube might be slow.</p><p><strong>Potential income: </strong>If it’s sponsored content, it depends on the client’s budget and how you negotiate. If it’s ads, depends on the Revenue Per Mille, which is a metric that represents how much money you’ve earned per 1,000 video views. Programming channels have an RMP above $3.</p><h2>4. Tutoring</h2><p>You can make money by teaching others what you know either in your city or online.</p><p>There are many school and university students who need to learn how to code for an exam, project, or homework. Here’s when you can use your skills to teach others. The best part about this is that you learn twice by teaching.</p><p>Also, there are some platforms that allow you to connect with students to teach them stuff live. One of them is Lighthall. This is a live-streaming platform that enables instructors to offer live interactive classes at scale. It’s in beta mode but there must be other platforms out there with the same functionality.</p><p><strong>Pros: </strong>It’s not as complicated as creating content or working for clients.</p><p><strong>Cons:</strong> You could get bored of teaching the same things over and over again.</p><p><strong>Potential income: </strong>You can set your hourly wage.</p><h2>5. Technical Writing</h2><p>Think of the last time you had a problem with your code or didn’t know how to solve something. Where did you find the solution? Probably on Google.</p><p>Nowadays developers search for solutions on the internet. This is why websites need to have content in the form of articles or guides that help them increase the number of visitors to their websites. You can use your technical knowledge to write an article and get paid for it. Websites usually paid a flat fee of $200-$500 per piece.</p><p>Here are some websites that pay developers to write technical articles.</p><ul><li>Digital Ocean: You can write about cloud hosting, OSS, software development, etc.</li><li>Auth0: You can write about frameworks, programming languages, and more.</li><li>LogRocket: You can make tutorials about React, JavaScript, Vue, etc.</li></ul><p><strong>Pros: </strong>You develop an online presence and get paid for it.</p><p><strong>Cons: </strong>There are a limited number of topics you can talk about. Your article can be rejected and never get published on a specific website.</p><p><strong>Potential income: </strong>$200–$500 per piece.</p><h2>6. Sharing knowledge online</h2><p>If the idea of technical writing seems interesting to you, but $300 per article is little, you can try blogging. This is similar to writing for a company or website, but instead of getting a flat fee, you get paid based on the number of views, reads, etc.</p><p>There are some blogging platforms that have this type of pay-for-performance model. In this model, the more people spend time reading your articles, the more money you’ll earn. This can be good because you might earn a lot of money from a single article, but also the earnings can be low. That’s up to the readers.</p><p>The topics you can write about when blogging are endless. You can write guides, share your opinion about something, write about your working experience, etc.</p><p><strong>Pros: </strong>You can write about anything you want and the payment can be huge.</p><p><strong>Cons:</strong> The payment can also be little to almost nothing.</p><p><strong>Potential income: </strong>It’s up to the article. An article can earn you $10, $100, or even $1000 or more.</p><h2>Bonus: Hackathon</h2><p>I’ve never won a hackathon, but this is another way to make money while putting your coding skills into practice.</p><p>Obviously, just very few people would make money in a hackathon, but if you’re good at what you do, you should definitely give it a try.</p>",
  "author": {
    "$oid": "62c7f547787600079e1fe7ae"
  },
  "tagList": [
    "software"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659748529014"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659748529015"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659748529015"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62edc70f4479193a53640a17"
  },
  "title": "Uncle Maker: (Time)Stamping Out The Competition in Ethereum",
  "description": "The First Evidence of An Attack on a Major Cryptocurrency",
  "slug": "uncle-maker-timestamping-out-the-competition-in-ethereum-Ia6uTQzdOo",
  "body": "<p>In a new <a href=\"http://dx.doi.org/10.13140/RG.2.2.27813.99043\" rel=\"noopener noreferrer\" target=\"_blank\">paper</a>, we (<a href=\"http://avivyaish.com\" rel=\"noopener noreferrer\" target=\"_blank\">Aviv Yaish</a>, Gilad Stern & <a href=\"http://avivz.net\" rel=\"noopener noreferrer\" target=\"_blank\">Aviv Zohar</a>)present and analyze a new attack vector on Proof-of-Work cryptocurrencies, such as Ethereum. We then go over recent Ethereum blocks to give the <strong><em>first</em> </strong>evidence of a consensus-level attack on a major cryptocurrency!</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659750158/zuj99brkrsnnn8cfl2x3.png\"></p><h2>Mining Difficulty in Ethereum</h2><p>In Ethereum, the difficulty of mining the current block changes on-the-fly and decreases the longer the time that has passed without anyone mining a new valid block; this is done to ensure that inter-block times will not be too high in expectation. <strong>What could go wrong?</strong></p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659750157/yw9tmf54yx8y7yoe1apr.png\"></p><h2>(Time)Stamping Out The Competition</h2><p>The time between blocks, and thus also mining difficulty, is determined according to block timestamps. The problem with this is that miners have a certain degree of freedom when setting them, and can even set false timestamps. For example, a miner can start mining a block now, but set the block’s timestamp to actually be 5 seconds in the past, or 10 seconds in the future. As long as this timestamp is within a certain reasonable bound, the block will still be considered valid, according to Ethereum’s consensus laws.</p><p>These same consensus laws say that in case of ties between blocks of the same height, the block with a higher total mining difficulty should be picked to be the parent of the currently mined block, while the other one should be its uncle.</p><p>Thus, a miner who wishes to replace the last block on the blockchain, can do so by mining a new block of its own which has a timestamp which is low enough to increase the block’s mining difficulty. This can be useful, for example, in cases where this last block has high paying transactions, or in order to double-spend a transaction contained within the block. Another possibility is for an attacker to preemptively mine blocks with such false timestamps, in order to make sure they win in case of ties with other blocks which might be mined concurrently, or which might’ve been mined in the recent past but haven’t reached the attacker yet.</p><p>Note that this is in stark contrast to most of the existing literature, which attempts to replace blocks by requiring that miners secretly create a heavier chain, withhold it and then publish it.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659750158/ugfioi6puwvxes2jgdih.png\"></p><h2>No Risk, No Gain? No!</h2><p>In our paper, we formally describe the aforementioned attack and rigorously analyze it. We show that by executing the attack in a specific manner, the attack does not entail any behavior which has a non-zero probability of earning less than mining honestly, meaning that <em>our attack dominates the honest mining strategy</em>.</p><h2>In Search of Lost Time: Uncle Making in the Wild</h2><p>By analyzing publicly available on-chain data, we can finally say that the answer to the long-standing question <em>do miners attack the consensus layer of major cryptocurrencies?</em> is a resounding <strong>yes!</strong></p><p>Although most mining pools produce relatively inconspicuous-looking blocks, F2Pool blatantly disregards the rules and uses false timestamps for its blocks. Specifically, whenever a block should have a timestamp difference from its parent which is divisible by 9 (precisely the time at which mining difficulty decreases), F2Pool hangs at the preceding second a while longer, thereby increasing mining difficulty and profits.Thus, in the past two years, <em>F2Pool didn’t have even a single block with a timestamp which is divisible by 9</em>.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659750157/ilwhw32iroj50yczh3ac.png\"></p><p>When looking at blocks mined by other pools, one can observe that practically all others have an over-representation of uncle blocks with timestamps differences which are divisible by 9, meaning that F2Pool specifically attempts to replace these blocks.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659750158/npqsncg9tdxdkxwgeeun.png\"></p><h2>Take Home Message</h2><p>We feel that it is very fitting to publish this paper on the cusp of The Merge, e.g. Ethereum’s migration to Proof-of-Stake. The current version of Ethereum’s consensus, which relies on Proof-of-Work, is known for adopting changes rapidly, without always carefully examining them and the effect they might have on the incentives of miners.Thus, changes which were designed to mitigate one <a href=\"https://eips.ethereum.org/EIPS/eip-100\" rel=\"noopener noreferrer\" target=\"_blank\">vulnerability</a>, open the door for <a href=\"https://dl.acm.org/doi/pdf/10.1145/3490486.3538250\" rel=\"noopener noreferrer\" target=\"_blank\">new ones</a>. Our paper shows that consensus mechanisms and changes to them should be rigorously analyzed, especially with regards to mining incentives.</p><p><br></p><p>This was responsibly disclosed to the Ethereum Foundation.</p><p>If you have comments, feedback, improvements or suggestions don’t be shy and reach out to us, we’d be glad to hear from you! You can do so and also see what else we’re up to via our websites: <a href=\"http://avivyaish.com/\" rel=\"noopener noreferrer\" target=\"_blank\">AvivY</a>, Gilad, <a href=\"https://www.avivz.net/\" rel=\"noopener noreferrer\" target=\"_blank\">AvivZ</a>.</p>",
  "author": {
    "$oid": "62c7f547787600079e1fe7ae"
  },
  "tagList": [
    "security"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659750159895"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659750159895"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659750159895"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62edc8c34479193a53640a27"
  },
  "title": "Aurox Launches Smart Contract Library to Increase Web3 Security",
  "description": "web security issues and solutions",
  "slug": "aurox-launches-smart-contract-library-to-increase-web3-security-a-SdHRC7cs",
  "body": "<p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659750594/a4moh2gysieajgewxqfe.png\"></p><p><strong>Partnership with FIO will help Create Open-Source Database of Trustworthy and Untrustworthy DeFi Contracts</strong></p><p>At Aurox, we have made it our mission to make decentralized wallets more secure, simpler and safer to use. That’s why, building off of leading DeFi consortium FIO’s cross-blockchain layer, we are launching an </p><p>innovative solution: whitelist@aurox. This <a href=\"https://github.com/GetAurox/Smart-Contract-Monitoring-Library\" rel=\"noopener noreferrer\" target=\"_blank\">open-source and decentralized library </a>of  trustworthy DeFI contracts will offer a major boost to security in our   web3 wallet and redefine security and the DeFi user experience for the   foreseeable future.</p><h1><strong>DEFI — THE FUTURE</strong></h1><p>We know that DeFI wallets are the future of crypto. Web3 wallets deliver the very utility that all of us want — control over our own funds and free of an expensive middleman.</p><p>The problem with most decentralized wallets being offered currently are their nightmarish user experience. Users have to constantly jump between protocols and exchanges. This can be overwhelming to many users, especially for those new to crypto.</p><p>Additionally, the confusing user interface leads to major security gaps. Foremost among those security threats are scams and hacks that attempt to mislead users with bogus addresses to then plunder their wallets.</p><p>Aurox is now partnering with FIO to create the first decentralized smart contract monitoring library to protect users against these very attacks.</p><h1><strong>HOW WHITELIST@AUROX WORKS</strong></h1><p>Every interaction users make via the Aurox Wallet will query the </p><p>whitelist@aurox handle on the Fio Protocol. This new handle will store </p><p>all of the contract addresses that are deemed secure. As an open-source </p><p>library, other web3 platforms will also be able to use the library to </p><p>see if an address is safe or not.</p><p>In other words, when Aurox wallet users create a transaction, the wallet will automatically check the address on the whitelist@aurox library. If the contract is identified as whitelisted, the transaction will move forward.</p><p>However, if the contract is not whitelisted or, worse, is included on the blacklist@aurox handle, the user will receive an error message and will be urged not to transact with the address. Of course, as is primary in </p><p>decentralized finance, the user is able to make their own choices and can override any blocks.</p><p>We believe this industry-leading level of security will protect users from attacks like the one recently experienced by OpenSea users. Under that attack, users received links that appeared to be an official OpenSea </p><p>website, however, they were actually hacker created contracts. Many </p><p>experienced users understand that they should never enter their twelve </p><p>word passphrase — ever. But dozens of users fall prey to this scam.</p><p>With Aurox’s new whitelist@aurox solution, users would immediately receive </p><p>an error message and realize that the address is not what it appears to </p><p>be.Its DeFI made simple, safe and secure.</p><p>Trustworthy contracts will include entities that are open-source, transparent and have high liquidity and usage rates. Examples would be Uniswap, Aave, </p><p>Pancake Swap and Compound, among others. The new integration will be </p><p>multi-chain.</p><p>In order to construct the library, Aurox developers have already worked to input data from hundreds of contracts into the two handles.</p><h1><strong>INTEGRATIONS TO COME</strong></h1><p><a href=\"https://fioprotocol.io/\" rel=\"noopener noreferrer\" target=\"_blank\">FIO</a> is the perfect partner for this integration. Like the Aurox team, FIO’s consortium is committed to making decentralized finance simple and easy-to-use. And their usability-focused blockchain is the perfect technology for Aurox’s specific web3 wallet security feature. It goes without saying that we are proud to work with them and excited to launch a series of new integrations in the future.</p>",
  "author": {
    "$oid": "62c7f547787600079e1fe7ae"
  },
  "tagList": [
    "security"
  ],
  "favorited": [
    {
      "$oid": "62f0959bbc71187f4b1524d9"
    }
  ],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659750595819"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659750595820"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659934614455"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62edca4f4479193a53640a3a"
  },
  "title": "Passwordless Future is Here",
  "description": "Hate remembering or managing passwords? Good news: the future is passwordless and it’s already happening. You might be able to go passwordless for some services you already use right now.",
  "slug": "passwordless-future-is-here-w1-TSp9l7G",
  "body": "<p>Passwordless means you don’t need passwords to authenticate apps. Instead, users enter their mobile phone number or email address and receive a one-time code or link, which they can then use to log in.</p><p>Apple is also added a new service called Passkeys in iOS 16 and macOS Ventura. Passkeys use Touch ID or Face ID for biometric verification, and iCloud Keychain to sync across iPhone, iPad, Mac, and Apple TV with end-to-end encryption.</p><h1>Passwords Are Vulnurable</h1><p>Authentication methods that require only username and password are vulnerable. Attackers can guess or steal credentials and gain access to sensitive information and IT systems using a variety of techniques, including:</p><ul><li><strong>Credential stuffing </strong> — using stolen or leaked credentials from one account to gain access to other accounts (people often use the same username/password combination for many accounts)</li><li><strong>Phishing</strong> — using fake emails or text messages to trick a victim to enter their credentials.</li><li><strong>Brute force methods</strong> — using programs to generate random username/password combinations or exploit common weak passwords like 123456</li><li><strong>Keylogging</strong> — installing malware on a computer to capture username/password keystrokes</li><li><strong>Man-in-the-middle attacks</strong> — intercepting communications streams (over public WiFi, for example) and replaying credentials</li></ul><h1>Types of Passwordless Authentication</h1><p>Passwordless authentication reduces risk and improves user satisfaction. It can be achieved in many ways. Here are a few:</p><ul><li><strong>Magic links:</strong> The user enters their email address, and the system sends them an email. The email contains a link which grants access to the user.</li><li><strong>One Time Passwords:</strong>The user enters their phone number, and the system sends them an SMS. Message contains a one-time-password, which grants access to the user.</li><li><strong>Biometrics: </strong>Physical traits, like fingerprint or retina scans, and behavioral traits. Apple’s new Passkeys feature uses Face ID or Touch ID to confirm that it’s you who’s trying to sign in before confirming or denying the request to the app or website.</li><li><strong>Possession factors:</strong>Authentication via something that a user owns or carries with them. For example, the code generated by a smartphone authenticator app, OTPs received via SMS, or a hardware token.</li></ul><p><br></p><h1>Is Passwordless Authentication Safe?</h1><p>There’s no authentication system out there which can’t be hacked. If safe means harder to crack and less prone to the most common cyberattacks, then yes, passwordless authentication is definitely safe.</p><p>There is no obvious way to hack it, but it doesn’t mean that the most sophisticated hackers can’t work their way around its defenses.</p><p>With that said, passwordless techniques are inherently safer than passwords. E.g., to hack a password-based system, a bad actor may use the variety of techniques listed above like phising, leaked credentials, brute-force etc. Even the amateur hackers can perform a these kind of attacks. Conversely, it takes a significantly higher level of hacking experience and sophistication to infiltrate a passwordless system.</p><h1>Which Apps Are Passwordless?</h1><blockquote>“This isn’t a future dream to replace passwords. This is something that’s going to be a road to completely replace passwords, and it’s starting now.” Kurt Knight, Apple</blockquote><p>The future is definitely passwordless and it’s already happening now. We use passwordless authentication in our fintech app <a href=\"https://alternatif.app\" rel=\"noopener noreferrer\" target=\"_blank\">Alternatif SuperApp</a>!</p><p>We definitely love to try new technologies and tools at Macellan. We try to experience new technologies as early as possible. We are very keen on our R&D studies, stay tuned for our upcoming posts about Macellan and Alternatif SuperApp!</p><p>If you want to know more about us, take a look at Macellan’s <a href=\"https://www.instagram.com/macellan_net/\" rel=\"noopener noreferrer\" target=\"_blank\">Instagram</a> and <a href=\"https://www.linkedin.com/company/macellan\" rel=\"noopener noreferrer\" target=\"_blank\">Linkedin</a> pages too.</p><p>We are always on a lookout for great talents. If you are interested in what we do, check out our <a href=\"https://jobs.macellan.net/\" rel=\"noopener noreferrer\" target=\"_blank\">career page</a>, you can become a member of Macellan’s <em>Mürettebat</em> too!</p><p><br></p>",
  "author": {
    "$oid": "62c7f547787600079e1fe7ae"
  },
  "tagList": [
    "scurity",
    "password"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659750991624"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659750991624"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659750991624"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62edcbaa4479193a53640a88"
  },
  "title": "Loyalty of Immigrants?",
  "description": "I work with refugees and do some consulting for some organizations working with immigrants.",
  "slug": "loyalty-of-immigrants-E244MgOfK9",
  "body": "<p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659751338/ugbyyuaeghonnwsmhwmz.jpg\"></p><p>I would say, most refugees are in the country because their country or situation is unsafe. They have no choice, and when they are in the country, most of them are grateful just to be there.</p><p>Like refugees, many migrant workers are also very grateful to be in the host countries because they can get higher salaries. In most cases, a few years of work can allow them to buy a house or start a business in their home countries.</p><p>I’ve spoken to many migrant workers who have worked overseas. Most of them still have fond memories of the countries they worked in. For example, I’ve a friend who worked in Singapore in construction for 10 years and returned to Bangladesh where he had enough money to buy a house and start a small shop selling portable solar light and chargers.</p><p>He was one of the fortunate ones who managed to find an ethical agent to get to Singapore without paying too much and taking up heavy loans to come. Even though his salary was S$17 a day, he managed to save up S25,000 after 10 years to return home and start his new life.</p><p>In Bangladesh, these stories attract many people to leave their villages to risk their lives for a better life. However, they do not hear the stories of exploitation which are far too common, and many don’t even make enough to pay for their debts.</p><p>However, I feel that economic migrants and refugees and immigrants who choose to be citizens are very different. Their view of a country is a safe place to be, and it make sense to be there as it benefits them. But once the safety is gone or the benefit of having a job is gone, they would find another country to be in.</p><p>I’ve a friend who was from India, and he became a citizen in 2018. He has nothing but praises to day about Singapore. He was last in India in 2000 and always compare Singapore today to India in 2000, so he loves the “stable energy supply” and “24x7” streetlights on every street. Similarly, one of my classmates that was originally from China and now a Singaporean also have nothing but praises. </p><p>Strangely, when I complain about some of the government website which are down for maintenance every night, they would step up and defend Singapore, saying that it is already much better than their home countries.</p><p>So, it seems that these new immigrants are very loyal to the government and seem to support all new policies — EVEN THE INCREASE OF GST.</p><p>But does this make them more loyal?  </p><p>I’m not very sure. My interaction with my friend who was born in China is that they still have their PRC view on things. When it comes to policies, they believe that Taiwan is part of China and if China were to invade Taiwan, it would be justified.  </p><p>I asked him a question, “So, what happens if China wants Singapore? Would you defend Singapore?” </p><p>His reply is, “Many of us are already here, there is no difference, and maybe Singapore should be part of China as the majority of the people are Chinese.” </p><p>When I ask my India born friend the same question, his response is, “There are already so many China born Chinese here, why would they attack? They could just send more and take over.”  </p><p>Still I did not get a real answer about loyalty. When it comes to war, can we rely on the new citizens to defend Singapore?</p>",
  "author": {
    "$oid": "62c7f547787600079e1fe7ae"
  },
  "tagList": [
    "security"
  ],
  "favorited": [
    {
      "$oid": "62f0959bbc71187f4b1524d9"
    }
  ],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659751338864"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659751338864"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659934601404"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62edce3b4479193a53640b17"
  },
  "title": "When to use and when not to use Redux?",
  "description": "What is Redux, it is a state management library that is based on the Flux architecture.",
  "slug": "when-to-use-and-when-not-to-use-redux-vGq5BctTt6",
  "body": "<p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659751994/u6zqr5bv6fwbpxbxmoig.png\"></p><p>What is Flux architecture? It is an architecture that was created by <a href=\"https://github.com/gaearon\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Dan Abramov</strong></a> and <a href=\"https://github.com/acdlite\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Andrew Clark</strong></a> from<strong> </strong>the Facebook team. Initially, the team used MVC but when the web app was scaled with more features, it became a mess of inter-connected models, views, and controllers. Due to such a mess, it had become difficult to use and maintain the code.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659751995/eqdsrn27fwvrgsma3jyt.png\"></p><p>Hence, they came up with a unidirectional architecture, ie, Flux. (<a href=\"https://medium.com/nonstopio/slicing-redux-in-reactjs-43ee5f1d4855\" rel=\"noopener noreferrer\" target=\"_blank\"><em>here’s how to use redux-toolkit</em></a>)</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659751995/ekr7b7nxskc8ygg6bkyn.png\"></p><h1>When not to use Redux?</h1><p><br></p><p>If you think the size of the project defines whether we should use Redux then you are wrong. Even the biggest project may not need redux or even the smallest one may need redux or vice versa. If you are only concerned about separating the view from business logic then Redux is not the answer, you can create custom hooks for the same. Then when to use Redux?</p><h1>When to use Redux?</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659751994/skqpihhiyxe3ueydranr.png\"></p><p>It is essential to know the use case of Redux before we use it. I have noticed that a lot of new developers use Redux only because they have heard of it from other senior developers. Well, it is not bad to try and learn new technologies but using them in an actual project without understanding their real use case can lead you to messy and less maintainable code which defeats the purpose of using new technologies. 😅</p><p>One of the use cases is that if you want to maintain some state globally, then it is perfect to use Redux.</p><h1>A real-life example of Redux use case</h1><p>I had to create a 4-tabs-view (<em>the below image is an example of the tabs</em>), it was like a multistep form. The tabs should be able to be changed directly ie, clicking on the tab should change the view beneath it. Apart from direct clicking the tabs, there were other conditions/actions too by which the selected tab should change.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659751995/e2fgsl2wltit74keospx.png\"></p><p>You must be thinking that all of this could have been done using a local component state. Yes, it is possible, in fact, that’s what I did initially. But, that resulted in a single giant component. I could not bear the guilt that I did not break it into smaller components. Even after breaking them into components, I would have had to pass the state and the functions to update the state in the components as props, which would create a deep/long chain of passing props (🚫). That’s when I introduced the redux-toolkit into the picture. Now, I could create components for each tab view, the tabs themselves, the parent view, and the small reusable components inside the form (✅). I could change the tab from any component using Redux. Below is a simple redux slice that maintains the state of the form step.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659751995/pp8zvss7ggfruiigpo5p.png\"></p><p>Changing the step as below:</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659751994/selepzm5r4lszf7ttaer.png\"></p><p>Listening to changes as below:</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659751994/n6wkl7enspkrzndwcrxw.png\"></p><h1>Conclusion</h1><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659751994/lkemrdareyluvmjptb8g.png\"></p><p><strong><em>If you wish to know more about react, redux or slice then let me know in the comments.</em></strong></p><blockquote><em>Here to make the community stronger by sharing my knowledge and experience. </em><a href=\"https://arnoldparge.medium.com/\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Follow me</em></a><em> and </em><a href=\"https://medium.com/nonstopio\" rel=\"noopener noreferrer\" target=\"_blank\"><em>my team</em></a><em> to stay updated on the latest and greatest in the web & mobile tech world</em></blockquote><p><br></p>",
  "author": {
    "$oid": "62a2e976949b34418e39f941"
  },
  "tagList": [
    "react",
    "redux"
  ],
  "favorited": [
    {
      "$oid": "62ef2b30279d8fd4f9f2d6d6"
    }
  ],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659751995917"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659751995917"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659841695842"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62edd1164479193a53640bb8"
  },
  "title": "House of Commons -VueJs & React",
  "description": "we learnt about the hooks of Vue that match with the useEffect hook of React. If you missed it, please check out here.",
  "slug": "house-of-commons-vuejs-react-U4waAzNXrm",
  "body": "<p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659752724/c1hom8ejslgmceuuhis0.png\"></p><p>In this blog,</p><p>Let’s get to know about the properties of Vue i.e. <strong><em>computed</em></strong> & <strong><em>watch</em></strong> that help to achieve the <strong>useEffect()</strong> functionality of React.</p><p>So, with no delay, let’s dive into the topic.</p><p>As usual, let’s understand it with an example/scenario</p><p>This can also be done using <strong>useEffect </strong>hook by updating the dependency array.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659752725/qwvh2uchsrudplsemrwa.png\"></p><p>As long as the dependency gets updated till then UseEffect() hook gets called as below.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659752725/mg6glcc5bln1thsruvxh.png\"></p><p>In Vue, computed is not treated as a hook but, it is simply a function which gets triggered when the dependent state changes as above.</p><p>There is also one other approach in Vue instead of <strong><em>computed</em></strong> property i.e. <strong><em>watch.</em></strong></p><p><strong><em><span class=\"ql-cursor\">﻿</span></em></strong><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659752725/yt56qjay2aedteukbdo3.png\"></p><p>Thus, we have seen the working of hooks and properties of VueJs and React.</p><p>This way we can ideally make learning simple by just understanding the way framework works and relating them.</p><p>By just knowing the useEffect() hook from React, we were able to know about some hooks & properties of VueJs.</p><p>Please check the working code of the above examples</p><p>👉 <a href=\"https://codesandbox.io/s/floral-dust-gxi3h2?file=/src/App.vue\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Vue Examples</strong></a></p><p>👉 <a href=\"https://codesandbox.io/s/elegant-worker-jh90qj?file=/src/App.js:220-404\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>React Examples</strong></a></p><p>For more information, please refer to the below links👇</p><p>👉 <a href=\"https://v2.vuejs.org/v2/guide/computed.html\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Watch & Computed.</strong></a></p><p>👉 <a href=\"https://vuejs.org/api/options-lifecycle.html\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Vue Lifecycle hooks</strong></a></p><p>👉 <a href=\"https://reactjs.org/docs/hooks-intro.html\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>React Hooks</strong></a><strong>.</strong></p><p>Here we go, That’s it folks for this blog.</p><p>I hope everyone this blog.</p><p>If you like it, give it a clap 👏 ,</p><p>and share it with your friend.</p><p>For more exciting content on Frontend, Please do <em>follow me 🎯</em>.</p>",
  "author": {
    "$oid": "62a2e97f949b34418e39f945"
  },
  "tagList": [
    "react"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659752726109"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659752726109"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659752726109"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62edd31f4479193a53640bd8"
  },
  "title": "The biggest non-technical lesson I have learned in my journey as a developer?",
  "description": "If you asked me if I’m confident in my interpersonal skills and ability to work efficiently before starting my journey at Microverse I would answer without hesitation “Yes!”.",
  "slug": "the-biggest-non-technical-lesson-i-have-learned-in-my-journey-as-a-developer-bqkmsW3N6y",
  "body": "<p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659753246/s1cqrec76ficx5nrdhm4.png\"></p><p>What is the biggest non-technical lesson I learned in my journey as a developer? After years of being a self-driven designer and later CEO I faced a real challenge when I came back to “school”. I was required to establish good interpersonal relationships with guys from all over the world who are mostly younger and frequently more skilled than me. So, my wounded ego tags them “smarter”.</p><p>So, I made a decision to apply all my previous experience and skills to overcome that scary “Impostor syndrome” we read a lot about and the nerd party began…</p><h2>Working “efficiently”</h2><p>I have been sitting through the days and nights trying to come up with my perfect unique solution and prove I’m talented. I haven’t been reaching for help for days and tried to overperform working on the team tasks without clarifying the things of bad understanding.</p><h2>“Great” communicator</h2><p>At the end of the day, after all these issues and overperforming, I used to find myself rebuilding everything from scratch because I wasn’t attentive enough to delve into the task and notice all of the hints. Sometimes I have been spending hours on errors caused by typos.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659753247/nmwhspbccplcpiehyqlp.png\"></p><p>However, my progress was impressive. After my first capstone project, I felt like a superwoman! I have even drawn a custom design. However, I didn’t get to soar in coding skies for long and I got hardly stuck on the to-do list. That was the first time a Micronaut helped me significantly. That priceless help made me revise my learning approach and take the process and every collaboration as an experience and opportunity. I came up with a few principles I try to follow:</p><h2>Don’t waste your time reinventing the wheel</h2><p>When you start your journey as a developer you will definitely come with   the idea that you are a genius who can build a unique solution for an   existing problem. Definitely, you can, but not now. Trying to reinvent   something having a lack of knowledge will obviously lead you to   disappointment and even worth to impostor syndrome.</p><h2>Asking for help is a skill</h2><p>Sometimes, we avoid asking for help for different reasons such as shame,   ego, self-confidence, and even pride. Working in a team you will be   forced to communicate with different people and there can always be   someone more skilled. Not asking for help shows you unprofessional and   causes a delay in reaching team and project objectives.</p><p>In conclusion, I would say no one is perfect. People make typos, forget things, and stack on errors. Teamwork, openness to help, and collaboration, as well as the skill to write a proper search request, are the habits to lead you to your unique and genius solution we started this article with. Keep a clear mindset, contribute to a healthy working environment and your journey will be not only professional but also really exciting!</p><p>Happy coding.</p>",
  "author": {
    "$oid": "62a2e97f949b34418e39f945"
  },
  "tagList": [
    "react"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659753300000"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659753247768"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659753247768"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62edd4f44479193a53640bfc"
  },
  "title": "16 incredibly useful React utility libraries for effective development",
  "description": "Recently discovered several useful React utility libraries, compiled for sharing with you. I wish you had some assistance.",
  "slug": "16-incredibly-useful-react-utility-libraries-for-effective-development-m03lauX7Sd",
  "body": "<p><strong>1.react-dnd</strong></p><p>React DnD is a set of React high-level components created by Dan Abramov, the core author of React and Redux, which can help build complex drag-and-drop interfaces while maintaining component separation. It is mainly used for drag and drop of components.</p><p>npm address: <a href=\"https://www.npmjs.com/package/react-dnd\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.npmjs.com/package/react-dnd</a></p><p><strong>2. react-intl</strong></p><p>To internationalize   React web apps, React Intl. offers a React component and Mixin. It   offers a mechanism to format string, date, and number message   descriptions.</p><p>npm address: https://www.npmjs.com/package/react-intl</p><p><strong>3. react-router</strong></p><p>React.js has a routing solution called react-router. While providing first-rate support for nesting, transformation, and server-side rendering, it can effortlessly synchronize your app and URLs.</p><p>npm address: https://www.npmjs.com/package/react-router</p><p><strong>4. React Virtualized</strong></p><p>Long list rendering issues can be resolved using react-virtualized, a responsive component for quickly rendering huge lists and tables of data.</p><p>npm address: https://www.npmjs.com/package/react-virtualized</p><p><strong>5. react-beautiful-dnd</strong></p><p>A stunning and simple drag-and-drop library for React lists is react-beautiful-dnd.</p><p>npm address: https://www.npmjs.com/package/react-beautiful-dnd</p><p><strong>6. redux</strong></p><p>A JavaScript state container called Redux offers dependable state management. It enables you to create dependable programs that are simple to test and work in a variety of settings (client, server, and native apps).</p><p>npm address: https://www.npmjs.com/package/redux</p><p><strong>7. react-redux</strong></p><p>Redux’s official React binding library. versatile and effective.</p><p>npm address: https://www.npmjs.com/package/react-redux</p><p><strong>8. redux-saga</strong></p><p>redux-saga is a library for managing application Side Effects (side effects such as asynchronous fetching of data, access to browser cache, etc.). Its goal is to make side effect management easier, execution more efficient, testing simpler, and troubleshooting easier. </p><p>The npm address: https://www.npmjs.com/package/redux-saga</p><p><strong>9. Ant Design</strong></p><p>antd is a library of React UI components based on the Ant Design design system, mainly used for developing enterprise-level middle and backend products.</p><p>Official website: https://ant.design</p><p><strong>10. draftjs</strong></p><p>Draft JS is a rich text editor library. It can be seamlessly integrated into React applications.</p><p>Official website address:<a href=\"https://draftjs.org/\" rel=\"noopener noreferrer\" target=\"_blank\">https://draftjs.org</a></p><p><strong>11.Material-UI</strong></p><p>Material-UI is a library of simple, customizable components for building faster, prettier, and easier-to-use React applications.</p><p>Official website address: https://mui.com</p><p><strong>12. react-custom-scrollbars</strong></p><p>react-custom-scrollbars is a library of scrollbars components that allow smooth use of scrollbars on web and mobile, and can be fully customized by yourself</p><p>npm address: https://www.npmjs.com/package/react-custom-scrollbars</p><p><strong>13. recharts</strong></p><p>recharts is a React charting library.</p><p>npm address: https://www.npmjs.com/package/recharts</p><p><strong>14. react-spring</strong></p><p>react-spring is a react animation library based on spring-physics (spring physics), the animation effect is more smooth and natural. </p><p>npm address: https://www.npmjs.com/package/react-spring</p><p><strong>15. react-motion</strong></p><p>eact-motion is a powerful react animation library.</p><p>npm address: https://www.npmjs.com/package/react-motion</p><p><strong>16.react-hanger</strong></p><p>react-hanger is a custom React Hooks library that contains many useful custom hooks</p><p>npm address: https://www.npmjs.com/package/react-hanger</p>",
  "author": {
    "$oid": "62a2e97f949b34418e39f945"
  },
  "tagList": [
    "react"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659753716533"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659753716534"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659753716534"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62edd5b54479193a53640d47"
  },
  "title": "What next after a password leak",
  "description": "Change your password immediately. Access your device e.g. phone, tablet, desktop/laptop and change your password to a stronger one. In future I will write on creating a strong password that is hard to be cracked or guessed.",
  "slug": "what-next-after-a-password-leak-6nNrkgrcMB",
  "body": "<p><a href=\"https://bit.ly/38qK8n2\" rel=\"noopener noreferrer\" target=\"_blank\">https://bit.ly/38qK8n2</a></p><p><strong>Log out of all devices that your account is logged in</strong>.</p><p> After changing your password next step is to log out your account from all previously logged in devices. This will help you kick off users who may have accessed your account using the old password. <a href=\"https://www.blogger.com/blog/post/edit/3660775475981625638/3385062109474943816?hl=en\" rel=\"noopener noreferrer\" target=\"_blank\">Everything on Jumia</a></p><p><a href=\"https://medium.com/@inforsec/what-next-after-a-password-leak-d98e40680eb0#_top\" rel=\"noopener noreferrer\" target=\"_blank\">Easy Shop</a></p><p>Revoke <strong>third-party apps connected to your account. </strong>Bad actors connect through these apps even after a password change since third party apps do not log out accounts automatically. It is therefore advisable to revoke access or disconnect all third party connected apps from your account after a password exposure. <a href=\"https://www.blogger.com/blog/post/edit/3660775475981625638/3385062109474943816?hl=en\" rel=\"noopener noreferrer\" target=\"_blank\">Everything on Jumia</a></p><p><a href=\"https://bit.ly/38qK8n2\" rel=\"noopener noreferrer\" target=\"_blank\">https://bit.ly/38qK8n2</a></p><p>The final step is to<strong> prepare for next time. </strong>Note after a password change you can still be exposed. You cannot absolutely stop a cyberattack, but you can control through best practices such as use of unique hard to guess passwords. Advice here is to avoid use of one password in all your accounts, keep your password as a secret — do not share it with anybody. <a href=\"https://www.blogger.com/blog/post/edit/3660775475981625638/3385062109474943816?hl=en\" rel=\"noopener noreferrer\" target=\"_blank\">Everything on Jumia</a></p><p><a href=\"https://bit.ly/38qK8n2\" rel=\"noopener noreferrer\" target=\"_blank\">https://bit.ly/38qK8n2</a></p><p>Please subscribe for more stories as they unfold. Thanks and see you in the next article.</p><p><br></p>",
  "author": {
    "$oid": "62a2e97f949b34418e39f945"
  },
  "tagList": [
    "password"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659753909003"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659753909003"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659753909003"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62edd7064479193a53640d90"
  },
  "title": "One Time Passwords",
  "description": "Have you ever waited for a confirmation code to arrive at your email or mobile device? Which means that you have worked with an OTP implementation.",
  "slug": "one-time-passwords-llsJywd-R2",
  "body": "<h1>What is an OTP?</h1><p>OTP stands for One time Password. One Time Passwords are there in most of the authentication processes that we see on the web. Following are a few examples.</p><ul><li>Banking systems</li><li>Clinical systems</li><li>Email systems</li><li>Storage systems</li><li>…and almost every other types of systems.</li></ul><p><br></p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659754267/l96o5e4l9tqtn4abtfud.jpg\"></p><h1>OTP and TOTP</h1><p>One Time Passwords(OTP) should be related to one single session of the user. These should not be allowed to be reused for multiple sessions for security reasons. For additional security, there are Time based One Time Passwords(TOTP) which may expire after some time. When TOTP are there you must provide it within the indicated time.</p><h1>SFA and TFA</h1><p>Single Factor Authentication(SFA) and Two Factor Authentication(TFA) are two different models of authentication. SFA is when the user is asked for authentication details just one time. Traditional login forms are a good example for this. TFA is when the user is asked to provide two or more authentication factors. OTPs are a type of TFA authentication.</p><h1>Benefits of an OTP</h1><p>Implementing an OTP can be a bit costly but this can give your application the following benefits.</p><ul><li>Greater security level can be achieved with the additional level of authentication.</li><li>Difficult to crack with brute force and replay attacks if the OTP generation logic is powerful.</li><li>No threat of stealing the password since there is an additional verification step.</li></ul><h1>OTP architecture</h1><p>Following is a general architecture for a OTP implementation.</p><p>Note the following about this architecture.</p><ul><li>OTP verification is done before granting access to the user. If the OTP provided is incorrect, the user goes to an earlier stage at the execution.</li><li>OTP keys and the User data are separately stored.</li><li>OTP generation method is transparent from the client side application.</li></ul><p>We can always change the architecture due to the security requirements.</p><h1>OTP Complexity</h1><p>Even though an OTP can be set as time restricted, these can be theoretically cracked by several methods. (For example, by brute force.) We have increase the randomness and the uniqueness of the OTP. To make an OTP more complex and unique, we can combine it with a hash generated by the user password. Also the UNIX timestamp of the OTP generation time can be used for the same purpose.</p><h1>OTP Market</h1><p>There is a market sector including the OTP services, devices, etc. The OTP segment is part of a more global two-factor authentication market evaluated at $3,5B in 2018. It will reach $8,9B by 2024, as revealed by global market researchers. Primary customers are enterprises, banking, finance, insurance and securities, government, healthcare, and gaming where user account safety is more important.</p><p><br></p><p><em>I work as a Senior Software Engineer/Senior WebRTC Engineer at Telzee.io. We are based on USA and Sri Lanka and we develop custom Telehealth solutions.</em></p><p><em>Our telemedicine starter kit consists of all the tools necessary to start your online consultation. Built for both an individual or team. WebRTC ensures the security of your patient’s data.</em></p><p><em>Powerful features to improvise a real physical environment of a healthcare institute from high quality video conferencing, patient queues, payment collection, ERM integration, Staff Management, Whiteboard etc.</em></p>",
  "author": {
    "$oid": "62a2e97f949b34418e39f945"
  },
  "tagList": [
    "password"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659754246264"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659754246265"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659754283090"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62edd8a64479193a5364109d"
  },
  "title": "How to View Saved Wi-Fi Passwords on Android",
  "description": "If you need to check the Wi-Fi passwords you’ve saved on your Android device for whatever reason, you’ll be happy to know it’s very easy to do.",
  "slug": "how-to-view-saved-wi-fi-passwords-on-android-Sw1Os3LEuZ",
  "body": "<p>Whether you forgot the password of your Wi-Fi network and you need to share it with someone or you need to connect another device to the network of a friend or a public establishment, you’ll be able to check your saved passwords quickly.</p><p>Today, we will provide a helpful guide that will show you the different methods you can use to access saved Wi-Fi passwords on any Android device.</p><h1>How to Check Wi-Fi Passwords on Android 10 and Over</h1><p>If you have Android 10 or above, you will be able to check any Wi-Fi passwords you’ve saved without having to root the device, which is something we all want to avoid.</p><p>Here are the steps you need to follow:</p><ol><li>Go to Settings on your device and tap on “Network and Internet”.</li><li>Go to “Wi-Fi” where you will see the lists of available networks and the one you are using will be at the top of the list.</li><li>Select the Wi-Fi you want and it will take you to the options of the network.</li><li>There, you can tap on “Share”. You’ll have to enter your PIN or use the fingerprint sensor or face recognition to continue.</li><li>Once you do that, you’ll see the QR code to share the connection and the Wi-Fi password will be right below it.</li></ol><p>In some cases, only the QR code will appear when you try to share the Wi-Fi, so you can share the code with another device or person so they can connect to the Wi-Fi network very easily using a scanner.</p><p>Depending on the Android version, some of the options mentioned in the steps may look different, but the process will be the same.</p><p>If you go to Settings, you can search for the keyword “Wi-Fi” for easier access and then follow the steps or you can go to the control panel, go to Wi-Fi, and tap on “more settings”.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659754662/nywqqhc4i4ddltiqbm3n.png\"></p><h1>How to Check Wi-Fi Passwords on Android 9 and Under</h1><p>If you’re working with Android 9 or under, or if you find that your device doesn’t provide the option to share the Wi-Fi network, you will have to root the device because the Wi-Fi passwords you’ve saved are located in a protected directory.</p><p>You won’t be able to access that protected directory if you don’t root your Android device. If your device is already rooted, you can go use a file explorer app and go to /data/misc/wifi. Then, open wpa_supplicant.conf and you will see the name of your Wi-Fi network and the password.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659754662/d9mfamxckrdoxvfcap4s.png\"></p><p><strong>Find Wi-Fi passwords on other devices</strong></p><p>If your device is not rooted, there are many resources online that will help you do that. Such as this <a href=\"https://www.digitaltrends.com/mobile/how-to-root-android/\" rel=\"noopener noreferrer\" target=\"_blank\">guide from Digital Trends</a>. The process is easy to follow and you can unroot your device once you’re done if that’s what you want.</p>",
  "author": {
    "$oid": "62a2e988949b34418e39f949"
  },
  "tagList": [
    "password"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659754662917"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659754662917"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659754662917"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62edd9d14479193a536410b3"
  },
  "title": "Release 3.6: GUI redesign",
  "description": "As mentioned late 2021 in the “What’s cooking” blog article, the graphical user interface got a fresh lick of paint. Check it out:",
  "slug": "release-36-gui-redesign-3EOauuRm2l",
  "body": "<p><br></p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659754961/gqeubjyycnldvlnajovj.png\"></p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659754961/fudycrv7zh6ulnkefe4s.png\"></p><p>Of course the dark theme received the same level of attention:</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659754961/kpevvzvd2ptcfisrycse.png\"></p><p>We left no stone unturned, all the interface elements have been revised:</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659754960/lvuqhzjmofveznbvkbkt.png\"></p><p>Buttons, fields dialogs, workspaces, login pages even hover & active states have been re-styled.</p><p>Here’s a preview of the design-kit made with Figma:</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659754960/picz6ihgdl24yzqq7kqm.png\"></p><p>You can consult the original figma file here:</p><p><a href=\"https://www.figma.com/file/3QSxoPUkTds3ix3zL534gN/Design-kit?node-id=0%3A1\" rel=\"noopener noreferrer\" target=\"_blank\">https://www.figma.com/file/3QSxoPUkTds3ix3zL534gN/Design-kit?node-id=0%3A1</a></p><p>To align the browser app with the mobile app GUI, a new icon library has been adopted: “<a href=\"https://feathericons.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Feather</a>” by “<a href=\"https://twitter.com/colebemis\" rel=\"noopener noreferrer\" target=\"_blank\">Cole Bemis</a>”</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659754960/x9vwp8xvshfyjpejzpa3.png\"></p><p>Beyond these graphical changes which are the tip of the iceberg, a lot of work has been done on the code refactoring. The entire front-end code has been re-written and cleaned-up. As a result, new themes will be way easier to create, like for example a darker than dark, aka black mode 🤘. We’ll soon post a detailed blog article about how to create custom themes. Stay tuned.</p><p>Thanks to this rework, it is now much easier to customise and extend passbolt UI components. To reflect this, we have published our style guide which is now also available as a standalone storybook website here: <a href=\"https://passbolt.github.io/passbolt_styleguide\" rel=\"noopener noreferrer\" target=\"_blank\">https://passbolt.github.io/passbolt_styleguide</a></p><p>This refactoring and redesign will serve as a foundation to the upcoming features that were previously announced: improved grid, improved tags, password expiry and admin reports, planned to be released later this year. (SSO is also currently in progress).</p><h1>Share your thoughts</h1><p>Do you have something to say about this release? As always your feedback is very valuable for us, feel free to share it with us on the corresponding thread in <a href=\"https://community.passbolt.com/t/new-release-3-6-0-new-morning/5399\" rel=\"noopener noreferrer\" target=\"_blank\">the community forum</a>. ❤️️</p><p><br></p>",
  "author": {
    "$oid": "62a2e988949b34418e39f949"
  },
  "tagList": [
    "password"
  ],
  "favorited": [],
  "comments": [
    {
      "$oid": "62edde4c4479193a536413b7"
    },
    {
      "$oid": "62edde5a4479193a536413c8"
    }
  ],
  "publishAt": {
    "$date": {
      "$numberLong": "1659754961901"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659754961901"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659756431614"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef2f5d279d8fd4f9f2dde5"
  },
  "title": "OAuth2 là gì? Tìm hiểu về OAuth2",
  "description": "Tìm hiểu cách sử dụng OAuth2 để bảo mật.",
  "slug": "oauth2-la-gi-tim-hieu-ve-oauth2--De-J7ukjC",
  "body": "<h2>OAuth2 là gì?</h2><p><br></p><p><strong>OAuth2 là gì?</strong> – Nó là viết tắt của <strong>Open</strong> với <strong>Authentication</strong> hoặc <strong>Authorization. OAuth</strong> ra đời nhằm giải quyết vấn đề trên và xa hơn nữa, đây là một <em>phương thức chứng thực</em> giúp các ứng dụng có thể chia sẻ tài nguyên với nhau mà không cần chia sẻ thông tin <strong>username</strong> và <strong>password</strong>.</p><p><br></p><h2>Ứng dụng</h2><p><br></p><ul><li><strong>Authentication</strong>: xác thực người dùng.</li><li><strong>Authorization</strong>: người dùng ủy quyền cho ứng dụng truy cập tài nguyên của họ.</li></ul><p>Nếu bạn thấy một website (hay phần mềm) </p><p>nào đó cho phép đăng nhập bằng tài khoản Facebook hay Google mà không </p><p>cần tạo nick mới thì đó chính là <strong>OAuth</strong>.</p><blockquote><br></blockquote><blockquote>Thực tế, mỗi người trong chúng ta đã </blockquote><blockquote>từng có hàng vài chục tài khoản ở các website khác nhau đến nỗi phải đặt</blockquote><blockquote> các tài khoản này giống hệt nhau.</blockquote><blockquote><br></blockquote><p>Xem tiếp...</p><p><a href=\"https://topdev.vn/blog/?p=8326\" rel=\"noopener noreferrer\" target=\"_blank\">  Code nhanh và hiệu quả hơn với VSCode tips, tricks</a></p><p><br></p><p><a href=\"https://topdev.vn/blog/?p=7346\" rel=\"noopener noreferrer\" target=\"_blank\">  Những Plugin không thể thiếu cho VSCode</a></p><p><br></p><h2>Quá trình phát triển</h2><p><br></p><ul><li>Năm 2006, <strong>Twitter</strong> đưa ra chuẩn OAuth đầu tiên có tên là <strong>OpenID</strong>, điểm yếu đó là yêu cầu người dùng phải cung cấp thông tin cá nhân (username + password).</li><li>Năm 2010, phát hành phiên bản chính thức đầu tiên của Oauth 1.0 (<a href=\"https://tools.ietf.org/html/rfc5849\" rel=\"noopener noreferrer\" target=\"_blank\">RFC 5849</a>).</li><li>Sau đó lỗi bảo mật nghiêm trọng được phát hiện với tên gọi <a href=\"http://hueniverse.com/2009/04/23/explaining-the-oauth-session-fixation-attack/\" rel=\"noopener noreferrer\" target=\"_blank\">Session Fixation</a> cho phép Hacker chiếm quyền truy cập vào tài nguyên của người dùng.</li><li>Năm 2012, <strong>OAuth2</strong> ra đời, tuy vẫn còn những lỗi bảo mật như dùng <em>Chrome</em> để <a href=\"http://homakov.blogspot.co.uk/2013/02/hacking-facebook-with-oauth2-and-chrome.html\" rel=\"noopener noreferrer\" target=\"_blank\">Hack Facebook</a> nhưng hiện vẫn đang được sử dụng khá rộng rãi.</li></ul><h2>OAuth2 hoạt động như thế nào?</h2><p><br></p><p>Khi bạn đăng nhập bằng Facebook hay </p><p>Gmail, website sẽ dẫn bạn đến trang (hoặc phần mềm) Facebook và liệt kê </p><p>những quyền mà nó cần phải có để cho phép bạn đăng nhập và sử dụng dịch </p><p>vụ.</p><p>Nếu bạn đồng ý thì lúc này Facebook sẽ </p><p>phát cho website một cái token Token này chứa một số quyền hạn nhất định</p><p> giúp cho website có thể xác minh bạn là ai cũng như giúp cho website có</p><p> thể hoạt động được.</p><p>Nếu website này bị hacker tấn công thì </p><p>nó chỉ lấy được thông tin hay hoạt động của bạn trên website đó mà không</p><p> ảnh hưởng đến những website khác mà bạn đang sử dụng.</p><p>Do đó cách đăng nhập bằng phương thức OAuth này rất an toàn cho người dùng cuối như chúng ta.</p><p><br></p><h2>Sơ đồ luồng hoạt động của OAuth2</h2><p><br></p><p><a href=\"https://topdev.vn/blog/hoc-lap-trinh-the-nao-de-khong-that-nghiep/\" rel=\"noopener noreferrer\" target=\"_blank\">  Học lập trình thế nào để không thất nghiệp?</a></p><p><br></p><p><a href=\"https://topdev.vn/blog/lap-trinh-dau-chi-co-nhung-dong-code/\" rel=\"noopener noreferrer\" target=\"_blank\">  Lập trình đâu chỉ có những dòng code</a></p><p><br></p><p><a href=\"https://topdev.vn/blog/lieu-toi-co-lam-junior-developer-man-kiep/\" rel=\"noopener noreferrer\" target=\"_blank\">  Liệu tôi có làm Junior Developer \"mãn kiếp\"?</a></p><p><br></p><ol><li><strong>Ứng dụng (website hoặc mobile app)</strong> yêu cầu ủy quyền để truy cập vào <strong>Resource Server (Gmail,Facebook, Twitter hay Github…)</strong> thông qua <strong>User</strong></li><li>Nếu <strong>User</strong> ủy quyền cho yêu cầu trên, <strong>Ứng dụng</strong> sẽ nhận được ủy quyền từ phía <strong>User</strong> (dưới dạng một token string)</li><li><strong>Ứng dụng</strong> gửi thông tin định danh (ID) của mình kèm theo ủy quyền của <strong>User</strong> tới <strong>Authorization Server</strong></li><li>Nếu thông tin định danh được xác thực và ủy quyền hợp lệ, <strong>Authorization Server</strong> sẽ trả về cho <strong>Ứng dụng</strong> access_token. Đến đây quá trình ủy quyền hoàn tất.</li><li>Để truy cập vào tài nguyên (resource) từ <strong>Resource Server</strong> và lấy thông tin, <strong>Ứng dụng</strong> sẽ phải đưa ra access_token để xác thực.</li><li>Nếu access_token hợp lệ, <strong>Resource Server</strong> sẽ trả về dữ liệu của tài nguyên đã được yêu cầu cho <strong>Ứng dụng</strong>.</li></ol><p><img src=\"https://topdev.vn/blog/wp-content/uploads/2019/03/mo-hinh-oauth.png\"></p><h2>Tổng kết oauth2 là gì</h2><p><br></p><p>Luồng hoạt động thực tế có thể sẽ khác </p><p>nhau tùy thuộc vào việc ứng dụng sử dụng loại ủy quyền (authorization </p><p>grant type) nào, trên đây chỉ là ý tưởng chung để thực hiện.</p><p><br></p>",
  "author": {
    "$oid": "62ef2b30279d8fd4f9f2d6d6"
  },
  "tagList": [
    "oauth2"
  ],
  "favorited": [
    {
      "$oid": "62ef2b30279d8fd4f9f2d6d6"
    }
  ],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659842397736"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659842397737"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659843175920"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef3011279d8fd4f9f2dedc"
  },
  "title": "Kết nối tài khoản Gmail bằng cách sử dụng OAuth 2.0",
  "description": "Làm theo các bước trong bài viết này để thiết lập đồng bộ hóa phía máy chủ để gửi và nhận email trong các ứng dụng tương tác với khách hàng (chẳng hạn như Dynamics 365 Sales, Dynamics 365 Customer Service, Dynamics 365 Marketing, Dynamics 365 Field Service và Dynamics 365 Project Service Automation) từ tài khoản Gmail bằng cách sử dụng OAuth 2.0 làm cơ chế xác thực.",
  "slug": "ket-noi-tai-khoan-gmail-bang-cach-su-dung-oauth-20-0f7abH0Ts2",
  "body": "<h2>Bước 1. Bật IMAP hoặc POP trong Gmail</h2><p>Đối với IMAP, hãy làm theo các bước trong <a href=\"https://support.google.com/mail/answer/7126229\" rel=\"noopener noreferrer\" target=\"_blank\">Kiểm tra Gmail thông qua các nền tảng email khác</a>.</p><p>Đối với POP, hãy làm theo các bước trong <a href=\"https://support.google.com/mail/answer/7104828\" rel=\"noopener noreferrer\" target=\"_blank\">Đọc tin nhắn Gmail trên các ứng dụng email khác bằng POP</a>.</p><p><br></p><h2>Bước 2. Tạo dự án</h2><p>Sử dụng tài khoản Google (đây có thể là tài khoản bạn sẽ sử dụng để </p><p>gửi và truy xuất email hoặc một tài khoản khác), đi tới Bảng điều khiển </p><p>dành cho nhà phát triển của Google và tạo một dự án mới.</p><h2>Thực hiện theo các bước cho <strong>Tạo một dự án</strong> trong <a href=\"https://support.google.com/googleapi/answer/6251787\" rel=\"noopener noreferrer\" target=\"_blank\">Tạo, tắt và khôi phục dự án</a>.</h2><p><br></p><h2>Bước 3. Định cấu hình đồng ý OAuth</h2><ol><li>Chọn <strong>Màn hình đồng ý OAuth</strong> rồi chọn loại người dùng:</li><li><br></li><li><br></li></ol><ul><li class=\"ql-indent-1\">Chọn <strong>Nội bộ</strong> nếu bạn đang sử dụng một đối tượng thuê quản trị viên GSuite và sẽ tạo ứng dụng dành riêng cho tổ chức của bạn.</li><li class=\"ql-indent-1\">Chọn <strong>Bên ngoài</strong> nếu bạn đang thử nghiệm bằng cách sử dụng tài khoản Gmail độc lập.</li></ul><ol><li><br></li><li><br></li><li><img src=\"https://docs.microsoft.com/vi-vn/power-platform/admin/media/gmail-oauth-consent-screen.png\"></li><li><br></li><li><br></li><li>Chọn <strong>Tạo</strong>.</li><li><br></li><li>Trong <strong>Tên ứng dụng</strong>, nhập tên ứng dụng. Trong <strong>Miền được ủy quyền</strong>, hãy nhập tên miền riêng tư hàng đầu trong môi trường của bạn (ví dụ: dynamics.com). Chọn <strong>Lưu</strong>.</li><li><br></li><li><br></li><li><br></li><li><img src=\"https://docs.microsoft.com/vi-vn/power-platform/admin/media/gmail-oauth-consent-domain-name.png\"></li><li><br></li><li><br></li><li>Chọn <strong>Thông tin xác thực</strong> > <strong>Tạo thông tin xác thực</strong>.</li><li><br></li><li><br></li><li><br></li><li><img src=\"https://docs.microsoft.com/vi-vn/power-platform/admin/media/gmail-oauth-consent-create-credentials.png\"></li><li><br></li><li><br></li><li>Chọn <strong>ID máy khách OAuth</strong>.</li><li><br></li><li>Chọn <strong>Đặt cấu hình màn hình đồng ý</strong>.</li><li><br></li><li>Nhập các tùy chọn thiết đặt sau:</li><li><br></li><li><br></li><li><br></li><li><br></li><li><br></li><li>Thiết đặt</li><li>Sử dụng</li><li><br></li><li><br></li><li><br></li><li><br></li><li>Loại ứng dụng</li><li>Ứng dụng web</li><li><br></li><li><br></li><li>Tên</li><li>Tên của máy khách web</li><li><br></li><li><br></li><li>Nguồn gốc JavaScript được ủy quyền</li><li>URL môi trường của bạn (ví dụ: https://contoso.crm.dynamics.com)</li><li><br></li><li><br></li><li>URI chuyển hướng được ủy quyền</li><li>URL môi trường của bạn với /_grid/cmds/dlg_gmailoauth.aspx được thêm vào (ví dụ: https://contoso.crm.dynamics.com/_grid/cmds/dlg_gmailoauth.aspx)</li><li><br></li><li><br></li><li><br></li><li><br></li><li><img src=\"https://docs.microsoft.com/vi-vn/power-platform/admin/media/gmail-oauth-consent-create-clientid.png\"></li><li><br></li><li><br></li><li>Chọn <strong>Tạo</strong>. Trong màn hình xuất hiện, hãy ghi chú ID máy hàng và bí mật của máy khách. Bạn sẽ sử dụng dữ liệu này trong bước tiếp theo.</li><li><br></li></ol><h2>Bước 4. tạo cấu hình máy chủ email</h2><p><br></p><ol><li>Trong <a href=\"https://admin.powerplatform.microsoft.com\" rel=\"noopener noreferrer\" target=\"_blank\">trung tâm quản trị Power Platform</a>, hãy chọn một môi trường.</li><li><br></li><li>Trên thanh lệnh, chọn <strong>Cài đặt</strong> > <strong>Email</strong> > <strong>Cấu hình máy chủ</strong>.</li><li><br></li><li><br></li><li><br></li><li><img src=\"https://docs.microsoft.com/vi-vn/power-platform/admin/media/server-profile-settings.png\"></li><li><br></li><li><br></li><li>Trên thanh lệnh, hãy chọn <strong>Cấu hình máy chủ mới</strong>.</li><li><br></li><li><br></li><li><br></li><li><img src=\"https://docs.microsoft.com/vi-vn/power-platform/admin/media/new-server-profile.png\"></li><li><br></li><li><br></li><li>Đối với <strong>Loại máy chủ email</strong>, chọn <strong>Gmail</strong>, sau đó chỉ định <strong>Tên</strong> có ý nghĩa cho cấu hình.</li><li><br></li><li><br></li><li><br></li><li><img src=\"https://docs.microsoft.com/vi-vn/power-platform/admin/media/gmail-profile.png\"></li><li><br></li><li><br></li><li>Nếu bạn muốn sử dụng cấu hình máy chủ này làm cấu hình mặc định cho các hộp thư mới, hãy bật <strong>Đặt làm cấu hình mặc định cho hộp thư mới</strong>.</li><li><br></li><li>Đối với <strong>Loại xác thực</strong>, hãy chọn <strong>Gmail OAuth</strong>.</li><li><br></li><li>Đối với <strong>Id máy khách</strong> và <strong>Mã bí mật máy khách</strong>, hãy nhập thông tin bạn đã ghi lại trong bước 8 của quy trình trước.</li><li><br></li><li><br></li><li><br></li><li> Lưu ý</li><li><br></li><li><br></li><li>Các trường <strong>Vị trí và cổng</strong> được điền tự động.</li><li><br></li><li><br></li><li><br></li><li><img src=\"https://docs.microsoft.com/vi-vn/power-platform/admin/media/gmail-oauth-profile.png\"></li><li><br></li><li><br></li><li>Mở rộng phần <strong>Nâng cao</strong>, sau đó sử dụng chú giải công cụ để chọn các tùy chọn xử lý email của bạn.</li><li><br></li><li>Khi bạn đã hoàn tất, chọn <strong>Lưu</strong>.</li><li><br></li></ol><h2>Bước 5. Đặt cấu hình hộp thư</h2><p><br></p><p><br></p><p> Lưu ý</p><p><br></p><p><br></p><p>Các bước này nên được thực hiện bởi người dùng hộp thư.</p><p><br></p><ol><li>Trong ứng dụng web, hãy truy cập <strong>Thiết đặt</strong> (<img src=\"https://docs.microsoft.com/vi-vn/power-platform/admin/media/settings-gear-icon.png\">) > <strong>Thiết đặt nâng cao</strong>.</li><li><br></li><li>Chọn <strong>Thiết đặt</strong> > <strong>Quản trị</strong>.</li><li><br></li><li>Chọn <strong>Thiết đặt</strong> > <strong>Cấu hình email</strong> > <strong>Hộp thư</strong>.</li><li><br></li><li>Chọn hộp thư cho người dùng được định cấu hình trong các bước trước.</li><li><br></li><li>Sử dụng các tùy chọn thiết đặt sau:</li><li><br></li><li><br></li><li><br></li><li><br></li><li><br></li><li>Thiết đặt</li><li>Sử dụng</li><li><br></li><li><br></li><li><br></li><li><br></li><li>Cấu hình máy chủ</li><li>Hồ sơ được tạo ở bước 4</li><li><br></li><li><br></li><li>Email đến</li><li>Đồng bộ phía Máy chủ hoặc Bộ định tuyến Email</li><li><br></li><li><br></li><li>Email đi</li><li>Đồng bộ phía Máy chủ hoặc Bộ định tuyến Email</li><li><br></li><li><br></li><li><br></li><li><br></li><li><img src=\"https://docs.microsoft.com/vi-vn/power-platform/admin/media/gmail-oauth-mailbox-information.png\"></li><li><br></li><li><br></li><li>Chọn <strong>Lưu</strong>.</li><li><br></li><li>Chọn <strong>Đăng nhập vào Gmail</strong>.</li><li><br></li><li>Tiếp tục thông qua các trang đăng nhập và ủy quyền của Gmail.</li><li><br></li></ol><h2>Bước 6. Thêm người dùng thử nghiệm</h2><p><br></p><p>Trong Google Cloud Platform (Bảng điều khiển dành cho nhà phát triển), hãy thêm người dùng vào phần <strong>Người dùng thử nghiệm</strong> khi xuất bản ứng dụng. Thông tin khác: <a href=\"https://support.google.com/cloud/answer/7454865\" rel=\"noopener noreferrer\" target=\"_blank\">Trợ giúp bảng điều khiển Google Cloud Platform</a></p><p><br></p><p><br></p><p><img src=\"https://docs.microsoft.com/vi-vn/power-platform/admin/media/gmail-oauth-add-users.png\"></p><p><br></p><h2>Bước 7: Thử nghiệm và bật</h2><p><br></p><p><br></p><p> Lưu ý</p><p><br></p><p><br></p><p>Các bước này nên được thực hiện bởi người dùng hộp thư.</p><p><br></p><p>Chọn <strong>Kiểm tra & Bật Hộp thư</strong> để kiểm tra hộp thư được cấu hình ở bước 6.</p><p><br></p><p><br></p><p><img src=\"https://docs.microsoft.com/vi-vn/power-platform/admin/media/gmail-oauth-test-enable-mailbox.png\"></p><p><br></p><p><br></p><p><br></p>",
  "author": {
    "$oid": "62ef2b30279d8fd4f9f2d6d6"
  },
  "tagList": [
    "oauth2"
  ],
  "favorited": [
    {
      "$oid": "62ef2b30279d8fd4f9f2d6d6"
    },
    {
      "$oid": "62cff2fbc7ffb94bfe4eba48"
    }
  ],
  "comments": [
    {
      "$oid": "62ef319f279d8fd4f9f2e4c4"
    },
    {
      "$oid": "62ef31eb279d8fd4f9f2e4ec"
    },
    {
      "$oid": "62ef3a6f279d8fd4f9f2eeb7"
    },
    {
      "$oid": "62ef421c279d8fd4f9f2f582"
    }
  ],
  "publishAt": {
    "$date": {
      "$numberLong": "1659842577098"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659842577099"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659847196248"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef436c279d8fd4f9f2f9bc"
  },
  "title": "Giải Ngoại hạng Anh 2022-2023: Vẫn có thể là cuộc đua tay đôi ",
  "description": "Giải VĐQG hấp dẫn nhất thế giới sẽ khai mạc vào cuối tuần này và người hâm mộ sẽ lại một lần nữa mải mê theo dõi kết quả trực tiếp của giải Ngoại hạng Anh trên điện thoại của họ. Và tất nhiên, câu hỏi luôn hiện diện trong đầu của họ khi bắt đầu mùa giải là cuộc đua giành ngôi vô địch sẽ diễn ra giữa những đội bóng nào?",
  "slug": "giai-ngoai-hang-anh-2022-2023-van-co-the-la-cuoc-dua-tay-doi-y05JBIw1N3",
  "body": "<h2>Cuộc đua song mã?</h2><p><img src=\"https://image.thanhnien.vn/w2048/Uploaded/2022/zurugt/2022_08_04/man-city-4420.jpg\"></p><p>   Nhiều khả năng cuộc đua giành ngôi vô địch Premier League mùa này vẫn sẽ diễn ra giữa <a href=\"https://thanhnien.vn/man-city/\" rel=\"noopener noreferrer\" target=\"_blank\">Man City</a> (trái) với <a href=\"https://thanhnien.vn/liverpool/\" rel=\"noopener noreferrer\" target=\"_blank\">Liverpool</a></p><p><br></p><p>Theo một số chuyên gia, nhiều khả năng cuộc đua giành ngôi vô địch<a href=\"https://thanhnien.vn/tim-kiem/?q=premier%20league\" rel=\"noopener noreferrer\" target=\"_blank\"> Premier League</a> vẫn sẽ là cuộc chiến tay đôi giữa <a href=\"https://thanhnien.vn/tim-kiem/?q=man%20city&m=0&t=&c=0&y=-1&o=\" rel=\"noopener noreferrer\" target=\"_blank\">Man City</a> với <a href=\"https://thanhnien.vn/tim-kiem/?q=liverpool&m=0&t=&c=0&y=-1&o=\" rel=\"noopener noreferrer\" target=\"_blank\">Liverpool</a>.</p><p> Cả 2 đều đã chiêu mộ những tiền đạo mới cùng một tiền vệ chủ chốt. Do </p><p>vậy, cuộc so tài giữa 2 chân sút Haaland (Man City) và Nunez (Liverpool)</p><p> sẽ rất đáng xem. Hơn nữa, vẫn có những trận chiến nhỏ trong suốt chiến </p><p>dịch của họ. Liệu “The Citizens” có giải quyết được vấn đề hậu vệ cánh </p><p>của họ? Liệu “Đoàn quân đỏ” có thể bù đắp cho sự ra đi của Mane? 2 HLV </p><p>Guardiola và Klopp đã chi phối mọi thứ trong những năm qua và mùa giải </p><h2>2022-2023 cũng sẽ không khác gì.</h2><p><br></p><p>Sau 2 ứng viên hàng đầu, cơ hội chia đều cho các đội mạnh còn lại. </p><p>Chelsea đã bổ sung Koulibaly và Sterling nhưng vẫn đang gặp khó khăn </p><p>trên <a href=\"https://thanhnien.vn/the-thao/tin-chuyen-nhuong/\" rel=\"noopener noreferrer\" target=\"_blank\">thị trường chuyển nhượng</a>.</p><p> HLV Tuchel biết rõ rằng cần phải có thêm nhiều bản hợp đồng nữa để có </p><p>đủ sức cạnh tranh do Christensen, Rudiger, Lukaku… đều đã ra đi.</p><p>M.U và <a href=\"https://thanhnien.vn/arsenal/\" rel=\"noopener noreferrer\" target=\"_blank\">Arsenal</a></p><p> cũng hướng đến mục tiêu trở lại top 4. “Quỷ đỏ” đã bổ sung 2 hậu vệ và </p><p>một tiền vệ tấn công. Tuy nhiên, vấn đề cấp bách nhất là tương lai của </p><p>Ronaldo. Siêu sao người BĐN đang muốn chuyển đi nhưng cho đến nay vẫn </p><p>chưa có người mua. Nếu Ronaldo ra đi, CLB sẽ cần một người thay thế để </p><p>giúp HLV Ten Hag tiến hành một cuộc cách mạng tại Old Trafford.</p><p><a href=\"https://thanhnien.vn/tottenham/\" rel=\"noopener noreferrer\" target=\"_blank\">Tottenham</a></p><p> đã mua sắm rất nhiều khi HLV Conte hướng đến mục tiêu thu hẹp khoảng </p><p>cách với Man City và Liverpool. Richarlison, Perisic, Spence, Bissouma </p><p>và Lenglet là những bản hợp đồng mới trong khi không có sự ra đi đáng </p><p>tiếc nào.</p><p><br></p><h2>Khốc liệt ở cuối bảng?</h2><p><br></p><p>Như mọi khi, cuộc chiến ở đầu bên kia của <a href=\"https://thethao.thanhnien.vn/\" rel=\"noopener noreferrer\" target=\"_blank\">bảng xếp hạng</a> cũng sẽ không bao giờ nhàm chán. <a href=\"https://thanhnien.vn/everton/\" rel=\"noopener noreferrer\" target=\"_blank\">Everton</a></p><p> đã thoát hiểm một cách ngoạn mục ở mùa trước và HLV Lampard đã cảnh báo</p><p> về một mùa giải khó khăn khác. Trong khi đó, 3 đội mới thăng hạng - </p><p>Nottingham Forest, Fulham và Bournemouth - sẽ phải rất vất vả trong ngày</p><p> trở lại với Premier League. Trong số này, Forest đã chi tiêu nhiều nhất</p><p> trên thị trường chuyển nhượng mùa hè nhưng đó không phải là dấu hiệu </p><p>của sự an toàn.</p><p>Newcastle sẽ không phải bận tâm đến nỗi lo rớt hạng vì họ là một trong những CLB giàu nhất ở nước Anh. <a href=\"https://thanhnien.vn/aston-villa/\" rel=\"noopener noreferrer\" target=\"_blank\">Aston Villa</a></p><p> và Leeds cũng có thể tiếp tục sống sót vì họ đã hoạt động rất tích cực </p><p>trên thị trường chuyển nhượng. Tuy nhiên, cần để mắt đến <a href=\"https://thanhnien.vn/leicester/\" rel=\"noopener noreferrer\" target=\"_blank\">Leicester</a>.</p><p> “Bầy cáo” có tiềm năng trở thành phiên bản của Everton mùa trước. Một </p><p>sự cố nào đó đã xảy ra tại sân King Power. Không có một bản hợp đồng mới</p><p> nào trong khi thủ môn Schmeichel đã ra đi. Có vẻ như HLV Rodgers không </p><p>còn có thể đưa đưa đội bóng này đi xa hơn nữa.</p>",
  "author": {
    "$oid": "62ef2b30279d8fd4f9f2d6d6"
  },
  "tagList": [
    "football"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659847532434"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659847532435"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659923506471"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef43da279d8fd4f9f2fa59"
  },
  "title": "West Ham vs Man City: Cùng hướng về Haaland",
  "description": "Man City sẽ khép lại vòng đấu mở màn Premier League mùa giải 2022 - 2023 bằng chuyến làm khách trên sân của West Ham vào đêm nay (22 giờ 30).\n\nĐây được xem là trận đấu đáng chú ý nhất ở vòng này, nhất là khi mọi con mắt sẽ hướng về tiền đạo Haaland, tân binh trị giá 51 triệu bảng của nửa xanh thành Manchester.",
  "slug": "west-ham-vs-man-city-cung-huong-ve-haaland-GCr5mtdo2L",
  "body": "<p>Tiền đạo người Na Uy được kỳ vọng sẽ tiếp thêm sức mạnh cho đội bóng </p><p>đã thâu tóm 4 chức vô địch trong 5 mùa giải gần nhất. Tuy nhiên, mùa </p><p>giải của Haaland và Man City đã không có được sự khởi đầu tốt khi họ </p><p>thất bại trước <a href=\"https://thanhnien.vn/liverpool/\" rel=\"noopener noreferrer\" target=\"_blank\">Liverpool</a> trong trận Siêu cúp Anh (3-1) hồi cuối tuần qua.</p><p>    <img src=\"https://image.thanhnien.vn/w2048/Uploaded/2022/pwivoviu/2022_08_06/3-3191.jpg\">  </p><p>   Chuyến đi đến Sân vận động London vào đêm nay là một sự thử nghiệm </p><p>tốt cho đội hình đã được tân trang của HLV Guardiola với Alvarez và </p><p>Phillips cũng đã cập bến Etihad để thay thế cho sự ra đi của Zinchenko, </p><p>Fernandinho, Sterling và Jesus.</p><p>West Ham cũng đã tăng cường sức mạnh qua việc ký hợp đồng với tiền </p><p>đạo người Ý Scamacca, khi HLV Moyes đang tìm cách thu hẹp khoảng cách </p><p>với tốp 4 Premier League sau 2 mùa giải liên tiếp giành quyền tham dự </p><p>cúp châu Âu. Với chiều cao 1,96 m, Scamacca sẽ là mối đe dọa cho hàng </p><p>thủ vốn tranh chấp bóng bổng không tốt của Man City. </p><p>Nếu Scamacca chưa có đủ thể lực để xuất trận, West Ham vẫn có một dàn</p><p> cầu thủ tấn công tốt có thể gây ra các vấn đề cho Man City, như họ đã </p><p>thể hiện ở mùa trước, với Bowen, Antonio, Lanzini, Soucek và Rice. Tuy </p><p>nhiên, HLV Moyes vẫn rất dè chừng sức mạnh tấn công của đội khách, đặc </p><p>biệt là Haaland, nên ông hy vọng tiền đạo này sẽ chưa bắt kịp tốc độ </p><p>cùng Man City.</p><p>Vấn đề của Man City là họ thường khởi đầu khá chậm chạp trong những </p><p>mùa giải gần đây. Nếu điều đó lại xảy ra, người hâm mộ sẽ chờ xem phản </p><p>ứng của HLV Guardiola như thế nào, nhất là khi ông đã có trong tay những</p><p> tiền đạo cần thiết để thay đổi chiến thuật. Chẳng hạn, Alvarez và </p><p>Haaland có thể chơi cùng nhau trong sơ đồ 2 tiền đạo hoặc Man City cũng </p><p>có thể chơi với một cặp tiền vệ trung tâm trong sơ đồ 4-2-3-1. HLV </p><p>Guardiola nói: “Hai trận đấu với West Ham và Bournemouth (ngày 13.8) sẽ </p><p>là những trận bản lề cho thấy chúng tôi cần phải làm những gì tiếp </p><p>theo”. </p><p>Cũng trong tối nay, người hâm mộ đang chờ xem diện mạo M.U dưới bàn tay của <a href=\"https://thanhnien.vn/hlv-erik-ten-hag-thay-doi-thai-do-ve-cristiano-ronaldo-truoc-tran-m-u-gap-brighton-post1485570.html\" rel=\"noopener noreferrer\" target=\"_blank\">Erik ten Hag </a>như</p><p> thế nào khi đón tiếp Brighton. Chỉ có một sự khởi đầu tốt trên sân nhà </p><p>thì “Quỷ đỏ” mới mang lại niềm tin mới cho một mùa giải được mong đợi. </p>",
  "author": {
    "$oid": "62ef2b30279d8fd4f9f2d6d6"
  },
  "tagList": [
    "football"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659847642977"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659847642977"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659847642977"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef4451279d8fd4f9f2fab6"
  },
  "title": "MU đá trận ra quân Ngoại hạng Anh: Báo Anh dự đoán Ronaldo và Martinez đá chính ",
  "description": "MU chính thức bắt đầu kỷ nguyên dưới thời HLV Erik Ten Hag bằng trận đấu với Brighton ở vòng 1 Premier League 2022/23. ",
  "slug": "mu-da-tran-ra-quan-ngoai-hang-anh-bao-anh-du-doan-ronaldo-va-martinez-da-chinh-px_QxqzDZW",
  "body": "<p>Cristiano Ronaldo đã bỏ lỡ chuyến du đấu mùa hè của <a href=\"https://www.24h.com.vn/manchester-united-c48e1521.html\" rel=\"noopener noreferrer\" target=\"_blank\">MU</a></p><p> ở Thái Lan và Australia do vấn đề gia đình trong bối cảnh có nhiều đồn </p><p>đoán xung quanh tương lai của CR7. Cùng với người đại diện Jorge Mendes,</p><p> siêu sao người Bồ Đào Nha đã tổ chức các cuộc thảo luận với HLV Erik </p><p>Ten Hag và ban lãnh đạo MU tại đại bản doanh Carrington vào tuần trước.</p><p><br></p><p><img src=\"https://cdn.24h.com.vn/upload/3-2022/images/2022-08-06/MU-da-tran-ra-quan-Ngoai-hang-Anh-Bao-Anh-du-doan-Ronaldo-va-Martinez-da-chinh-3-1659781542-600-width740height498.jpg\"></p><p><br></p><p>Ronaldo được dự đoán sẽ đá chính ở trận MU ra quân Ngoại hạng Anh</p><p><br></p><p>Tương lai của Ronaldo vẫn chưa được xác định nhưng cầu thủ 37 tuổi </p><p>hiện vẫn là cầu thủ thuộc biên chế MU cho đến thời điểm hiện tại. CR7 đã</p><p> trở lại tập luyện với các đồng đội sau quãng thời gian vắng mặt trong </p><p>mùa hè này. Ronaldo cũng chơi 45 phút trong trận giao hữu hè cuối cùng </p><p>của MU với Rayo Vallecano và có khả năng sẽ đá chính ở trận ra quân <a href=\"https://www.24h.com.vn/premier-league-2020-2021-c48e2367.html\" rel=\"noopener noreferrer\" target=\"_blank\">Premier League</a>.</p><p>Không có Ronaldo, HLV Ten Hag thường xuyên xếp Jadon Sancho, Marcus </p><p>Rashford và Anthony Martial đá cùng nhau trên hàng công trong giai đoạn </p><p>tiền mùa giải. Tuy nhiên, chiến lược gia người Hà Lan đã phải nhận một </p><p>tin dữ khi Martial dính chấn thương gân khoeo và không đủ thể lực để góp</p><p> mặt ở cuộc tiếp đón Brighton.</p><p>MU đã mang về 3 tân binh gồm Tyrell Malacia, Christian Eriksen và </p><p>Lisandro Martinez trong kỳ chuyển nhượng mùa hè này, nhưng “Quỷ đỏ” vẫn </p><p>chưa đón tiền đạo nào khiến HLV Ten Hag không có nhiều lựa chọn ở vị trí</p><p> này.</p><p>Nói chung, sẽ có một vài bất ngờ khi HLV Ten Hag sử dụng đội hình xuất phát ở trận đấu chính thức đầu tiên. Một số <a href=\"https://www.24h.com.vn/manchester-united-c48e1521.html\" rel=\"noopener noreferrer\" target=\"_blank\">CĐV MU</a></p><p> kêu gọi chiến lược gia người Hà Lan xếp Eriksen đá chính sau những màn </p><p>trình diễn ấn tượng của tiền vệ người Đàn Mạch trước mùa giải. </p><p>Cơn đau đầu lớn nhất của HLV Ten Hag có thể là ở vị trí hậu vệ trái, </p><p>nơi Luke Shaw và tân binh Malacia đang cạnh tranh cho một suất đá chính.</p>",
  "author": {
    "$oid": "62ef2b30279d8fd4f9f2d6d6"
  },
  "tagList": [
    "football",
    "mu"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659847761668"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659847761668"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659847761668"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef44b5279d8fd4f9f2fb0d"
  },
  "title": "MU & bóng đá tổng lực thời Ten Hag: Cơ sở để kết thúc kỷ nguyên Pep - Klopp ",
  "description": "MU vẫn đang nỗ lực để hướng đến một tương lai mới cùng HLV Erik Ten Hag. Và trọng tâm trong kế hoạch đó, nhà cầm quân người Hà Lan hướng đến lối chơi tấn công tổng lực. ",
  "slug": "mu-bong-da-tong-luc-thoi-ten-hag-co-so-de-ket-thuc-ky-nguyen-pep-klopp-p9_lVxsA_P",
  "body": "<p><strong>MU chơi tấn công tổng lực</strong></p><p><br></p><p>“Total voetbal”, đó là hành trang Erik Ten Hag mang theo trong chuyến phiêu lưu đến nước Anh. Ở đó, các fan <a href=\"https://www.24h.com.vn/manchester-united-c48e1521.html\" rel=\"noopener noreferrer\" target=\"_blank\">MU</a> đang mong ngóng về một thứ <a href=\"https://www.24h.com.vn/bong-da-c48.html\" rel=\"noopener noreferrer\" target=\"_blank\">bóng đá</a> mới mẻ, hợp thời đại.</p><p><br></p><p><img src=\"https://cdn.24h.com.vn/upload/3-2022/images/2022-07-29/MU-hlv-ten-hag-dong-y-dan-mu-bong-da-tong-luc-ha-lan--1659070141-666-width740height489.jpg\"></p><p>            </p><p>HLV Ten Hag xây dựng lối chơi tấn công tổng lực cho MU</p><p><br></p><p>Các fan “Quỷ đỏ” đã chán ngán trong hàng thập kỷ, kể từ sau thời Sir </p><p>Alex Ferguson. Những Van Gaal, Mourinho dù xây dựng đội bóng theo hướng </p><p>khác nhau nhưng tựu trung lại đều đã trở nên cũ kỹ.</p><p>MU dưới thời Van Gaal hướng đến mục tiêu kiểm soát bóng, nhưng triển </p><p>khai tấn công lại quá chậm. Trong khi đó, cách chơi phòng ngự có phần </p><p>tiêu cực với Mourinho quả thực là thảm họa về phong cách chiến thuật.</p><p>Với Ole Gunnar Solskjaer, đội bóng này hướng đến mục tiêu chơi phòng </p><p>ngự phản công hiệu quả. Giai đoạn đầu tiên, “Solsa” làm việc không hề </p><p>tệ. Nhưng sự xuất hiện của Ronaldo cũng như việc nhà cầm quân người Na </p><p>Uy có quá ít tùy biến khiến đội bóng này nhanh chóng phá sản kế hoạch ở </p><p>chiến dịch 2021/22.</p><p>Với Erik Ten Hag, MU hướng đến lối chơi tấn công thực sự đặc thù. </p><p>Điều đó đã được thể hiện phần nào qua tour du đấu mùa hè của “Quỷ đỏ”. 5</p><p> trận giao hữu đầu tiên, MU ghi đến 17 bàn, tức trung bình 3,4 bàn/trận.</p><p>Trong ngày ra mắt ở MU, HLV Ten Hag tự tin rằng ông có thể chấm dứt </p><p>kỷ nguyên thống trị của hai HLV đại tài Pep Guardiola và Jurgen Klopp. </p><p>Đó là một tuyên bố mạnh bạo, trong bối cảnh Man City và Liverpool của </p><p>hai vị \"tướng\" tài này đã thống trị bóng đá Anh trong nửa thập kỷ qua, </p><p>đồng thời luôn phô diễn sức mạnh ở châu Âu.</p><p><strong>Chờ đợi vào kết quả</strong></p><p><br></p><p>Mấu chốt trong kế hoạch đó, Ten Hag tin rằng thứ bóng đá tổng lực mà </p><p>ông xây dựng cho MU ưu việt hơn hai đại gia kia. Bởi lẽ, ông là một HLV </p><p>người Hà Lan, và bóng đá tổng lực đã “ngấm vào máu”.</p><p><img src=\"https://cdn.24h.com.vn/upload/3-2022/images/2022-07-29/MU-mu-dai-chien-liverpool-ngay-ten-hag-gioi-thieu-bon-1659070141-673-width740height444.jpg\"></p><p><br></p><p>Người hâm mộ MU chờ đợi vào kết quả của lối chơi mới</p><p><br></p><p>Trong phòng làm việc của Ten Hag ở Ajax, dù ông đã rời đi nhưng đến </p><p>nay vẫn còn treo 3 bức ảnh. Đó là ảnh chân dung của Rinus Michels, Johan</p><p> Cruyff và Louis van Gaal - 3 biểu tượng của bóng đá Hà Lan.</p><p>Trong khi đó, cựu Giám đốc Thể thao Matthias Sammer của Bayern mô tả,</p><p> Ten Hag là sự pha trộn giữa một người Hà Lan và một người Đức ở khía </p><p>cạnh bóng đá. Có nghĩa là một HLV hết mình vì bóng đá đẹp, nhưng lại hết</p><p> sức kỷ luật.</p><p>Nhìn vào khoảng thời gian Ajax gặt hái thành công với HLV Ten Hag, có</p><p> thể thấy điểm mạnh trong lối chơi của đội bóng này: Chú trọng vào khâu </p><p>kiểm soát bóng, pressing và những đường chuyền theo chiều dọc hướng về </p><p>phía trước, nhấn mạnh vào những pha di chuyển và khai thác khoảng trống </p><p>giữa hai tuyến của đối thủ.</p><p>Tuy vậy, con người hiện tại của MU có đủ đáp ứng các tiêu chí để Ten </p><p>Hag xây dựng lối chơi kể trên hay không lại là vấn đề lớn. Những gì đã </p><p>diễn ra trong phiên chợ hè 2022 khó có thể nói là làm hài lòng nhà cầm </p><p>quân người Hà Lan. Những tưởng một đội bóng khổng lồ như MU sẽ có nguồn </p><p>ngân sách chuyển nhượng dư dả. Nhưng CEO Richard Arnold đã thu hẹp lại, </p><p>buộc Ten Hag phải nỗ lực liệu cơm gắp mắm với những con người ông đang </p><p>có.</p><p>Dẫu sao, MU của Ten Hag với phiên bản bóng đá tổng lực cũng rất đáng </p><p>để chờ đợi. Đó sẽ là một “Quỷ đỏ” có phong cách rõ ràng, tư duy hợp thời</p><p> đại, dù kết quả thành công đến đâu còn là câu chuyện dài phía trước.</p>",
  "author": {
    "$oid": "62ef2b30279d8fd4f9f2d6d6"
  },
  "tagList": [
    "football",
    "mu"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659847861274"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659847861274"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659847861274"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef44fc279d8fd4f9f2fb68"
  },
  "title": "Ronaldo vẫn còn cửa rời MU đá Cúp C1: CR7 quẫn trí chọn bến đỗ \"hạng 3\"? ",
  "description": "Với khát khao thi đấu và nâng cao thành tích ghi bàn ở Champions League, Ronaldo sẵn sàng \"hạ mình\" lựa chọn những bến đỗ kém danh tiếng lẫn thực lực? ",
  "slug": "ronaldo-van-con-cua-roi-mu-da-cup-c1-cr7-quan-tri-chon-ben-do-hang-3-AxGAP-uJK-",
  "body": "<p><strong>Đại gia \"chê\" Ronaldo: CR7 còn cửa nào rời MU?</strong></p><p>MU đang ngày càng mệt mỏi với những diễn biến xoay quanh tương lai của Cristiano Ronaldo. Sau khi bỏ lỡ 3 tuần chuẩn bị cho mùa giải mới, CR7 chỉ có mặt tại đại bản doanh vào hôm 27/7 nhưng vẫn kiên quyết yêu cầu ra đi vì mong muốn tham dự Champions League.</p><p><img src=\"https://cdn.24h.com.vn/upload/3-2022/images/2022-07-29/Ronaldo-van-con-cua-roi-MU-da-Cup-C1-CR7-quan-tri-chon-ben-do-ronaldo-2-1656995593-165699560-4722-1436-165699584-1659042151-914-width740height444.jpg\"></p><p><br></p><p>Nếu rời <a href=\"https://www.24h.com.vn/manchester-united-c48e1521.html\" rel=\"noopener noreferrer\" target=\"_blank\">MU</a>, Ronaldo chỉ có thể lựa chọn giữa Sporting Lisbon, Napoli hoặc Dortmund?</p><p><br></p><p>Dù vậy bên cạnh thái độ cứng rắn từ giới lãnh đạo MU, bản thân Ronaldo cũng chìm trong tuyệt vọng vì chưa tìm được bến đỗ mới. Cho tới thời điểm hiện tại, giới truyền thông xác định ít nhất 5 đội bóng lớn đã từ chối chiêu mộ CR7 gồm PSG, Bayern Munich, Chelsea, Barcelona, Atletico Madrid.</p><p>Bên cạnh vấn đề tài chính (mức đãi ngộ của Ronaldo quá cao kể cả </p><p>trường hợp giảm lương), nhóm \"đại gia\" này không muốn đi vào vết xe đổ </p><p>của Juventus hay MU, đặt niềm tin mù quáng vào siêu sao 37 tuổi để đánh </p><p>đổi bằng thành tích tập thể sa sút.</p><p>Tất nhiên nói vậy không có nghĩa Ronaldo hết \"cửa\" đá Champions </p><p>League mùa tới. Nhà báo Laurie Whitwell (tờ The Athletic), nguồn tin uy </p><p>tín về MU hé lộ Sporting Lisbon vẫn đang tìm hiểu khả năng tái hợp CR7 </p><p>sau khi biết cuộc đàm phán mới nhất giữa anh và MU thất bại.</p><p>Chưa hết, một số nguồn tin khác cho hay siêu \"cò\" Jorge Mendes, người</p><p> đại diện của Ronaldo còn liên hệ với Dortmund vì tin rằng đội bóng Đức </p><p>cần giải pháp thay thế Sebastien Haller (điều trị ung thư tinh hoàn). </p><p>Gây sốc hơn cả phải kể đến Napoli. Theo trang AS (Tây Ban Nha), đại diện</p><p> Serie A là một trong những đội được siêu \"cò\" Jorgre Mendes trực tiếp </p><p>mời chào nhưng chỉ có họ tỏ ra hào hứng với Ronaldo.</p><p>AS nhấn mạnh, Chủ tịch Aurelio De Laurentiis rất tự tin vào tiềm lực </p><p>tài chính, mối quan hệ thân thiết cùng Jorge Mendes, thậm chí ấp ủ dự </p><p>định biến Ronaldo thành biểu tượng của Napoli như huyền thoại Diego </p><p>Maradona.</p><p><strong>Ronaldo quẫn trí vì Cúp C1 & Messi, hạ mình chọn bến đỗ \"hạng 3\"?</strong></p><p><br></p><p>Dù là tên tuổi lớn của bóng đá châu Âu, Sporting Lisbon, Dortmund hay</p><p> Napoli không phải ứng viên vô địch Champions League trong vài năm trở </p><p>lại đây. Thậm chí theo thể thức chia hạt giống ở Champions League </p><p>2022/23, họ đều thuộc nhóm 3 (Champions League chia 4 nhóm hạt giống).</p><p><img src=\"https://cdn.24h.com.vn/upload/3-2022/images/2022-07-29/Ronaldo-quan-tri-vi-Cup-C1-dai-gia-ngo-lo-tha-chon-doi-284885940_577504947032070_6227664172165015981_n--1-1659038046-118-width740height925.jpg\"></p><p><br></p><p>Ronaldo sẽ chấp nhận hạ mình, đầu quân cho các đội \"hạng 3\" để nâng cao thành tích ở Champions League?</p><p><br></p><p>Rõ ràng vị thế của những đội bóng này không hề tương xứng với </p><p>Ronaldo, người sở hữu 5 chiếc cúp bạc cùng kỷ lục ghi bàn mọi thời đại </p><p>(140 bàn/183 trận). Việc anh lựa chọn đầu quân cho Sporting Lisbon, </p><p>Dortmund, Napoli chẳng khác nào bước lùi trong sự nghiệp.</p><p>Tuy nhiên nhà báo Laurie Whitwell khẳng định: \"Kỉ lục ghi bàn ở </p><p>Champions League và Lionel Messi là nhân tố thúc đẩy Ronaldo rời MU\".</p><p>Ronaldo không đặt nặng khả năng vô địch lẫn tiến sâu mà chỉ cần tiếp </p><p>tục hít thở bầu không khí Champions League, nâng cao thành tích ghi bàn.</p><p> Trong bối cảnh Lionel Messi đuổi sát phía sau (125 bàn) và kém 2 tuổi, </p><p>CR7 thà chơi 6 trận vòng bảng rồi bị loại còn hơn phải làm khán giả.</p><p>Sau lưng Ronaldo hiện không còn đường lùi. Fan MU dần mất đi tình yêu</p><p> với anh, fan Atletico giăng biểu ngữ yêu cầu đội bóng bỏ ý định chiêu </p><p>mộ anh, ban lãnh đạo Bayern Munich liên tục chơi \"mèo vờn chuột\" bằng </p><p>những phát ngôn ỡm ờ về khả năng mua hay không mua CR7. Chỉ cần thêm một</p><p> quyết định sai lầm, Ronaldo sẽ đập nát hình tượng mà anh cất công tạo </p><p>dựng suốt nhiều năm trời.</p>",
  "author": {
    "$oid": "62ef2b30279d8fd4f9f2d6d6"
  },
  "tagList": [
    "football",
    "mu"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659847932925"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659847932926"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659848197745"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef470a279d8fd4f9f2fe0e"
  },
  "title": "Vì sao MU phải chia tay Ronaldo",
  "description": "Wayne Rooney tin rằng Cristiano Ronaldo là rào cản để HLV Erik ten Hag xây dựng một Manchester United mới mẻ và giàu sức sống hơn.",
  "slug": "vi-sao-mu-phai-chia-tay-ronaldo-Ic8ir8Gjgz",
  "body": "<p>Rooney có bài bình luận trên <em>The Times</em>, lý giải việc MU nên để người đồng đội cũ rời sân Old Trafford trong kỳ chuyển nhượng mùa hè này. <em>Zing</em> lược dịch và gửi đến bạn đọc.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/bpivpawv/2022_08_07/mu.jpeg\">             </p><p>Wayne Rooney đánh giá việc chia tay Cristiano Ronaldo sẽ giúp Manchester </p><p>United dễ dàng xây dựng một đội hình trẻ hướng đến tương lai. Ảnh: <em>Sky Sports</em>.</p><p>                                            </p><h3><strong>MU cần trẻ hóa </strong></h3><p> Sẽ thực sự thú vị khi xem Manchester United chơi như thế nào ở mùa giải</p><p> năm nay. Dưới thời Ten Hag, tôi nghĩ họ sẽ tiến bộ. Song mục tiêu cơ </p><p>bản của đội chủ sân Old Trafford mùa này là phải trở lại top 4 Ngoại </p><p>hạng Anh. Trong bối cảnh Manchester City, Liverpool, Tottenham và </p><p>Arsenal tăng cường sức mạnh hè này, Chelsea vẫn tiếp tục mua sắm, MU cần</p><p> thêm một hoặc hai bản hợp đồng nữa để hoàn thiện đội hình và cạnh tranh</p><p> với các đối thủ.</p><p> Kỳ chuyển nhượng hè 2022 chưa kết thúc và tôi </p><p>tin rằng mọi thứ với MU sẽ được định đoạt vào vài tuần cuối cùng của </p><p>phiên chợ mua sắm cầu thủ. Lối chơi của \"Quỷ đỏ\" ở mùa giải mới sẽ phụ </p><p>thuộc rất nhiều vào việc họ chiêu mộ thêm được ai.</p><p>MU đang làm mọi cách để đưa Frenkie de Jong về bởi họ chắc chắn phải </p><p>mua thêm một tiền vệ. Ngoài ra, đội bóng thành Manchester cũng cần thêm </p><p>một \"số 9\" mới trên hàng công.  Tôi nghĩ MU nên để Ronaldo rời đi. Không</p><p> phải là anh ấy không thể chơi trong đội hình của Ten Hag, đồng đội cũ </p><p>của tôi có thể chơi ở bất kỳ CLB nào trên thế giới. Ronny (biệt danh </p><p>Rooney gọi Ronaldo - ND) sẽ luôn ghi bàn cho đội bóng của bạn.</p><p>Song,</p><p> quan điểm cá nhân tôi cho rằng MU hiện chưa sẵn sàng để cạnh tranh danh</p><p> hiệu. Vì vậy mục đích quan trọng nhất lúc này là phải xây dựng được một</p><p> đội bóng giàu tiềm năng, sẵn sàng vô địch giải đấu trong 3 đến 4 năm </p><p>tới. </p><p>Bạn phải lên kế hoạch cho điều đó ngay từ bây giờ.  Nếu các </p><p>tin tức từ truyền thông là sự thật, rằng Cristiano muốn rời CLB, thì MU </p><p>nên cho phép anh ấy rời đi. Đổi lại, họ có cơ hội chiêu mộ một \"số 9\" </p><p>mới trong đội hình, người sẽ thi đấu cho đội trong 3 hoặc 4 năm tới.</p><p><br></p><p> Tay tiền đạo mới này sẽ thực sự giúp MU xây dựng một đội bóng có thể </p><p>thành công trong tương lai. Ten Hag phải nhận được sự kiên nhẫn. Ông ấy </p><p>cần được trao thời gian để xây dựng một đội bóng trẻ trung như thế. Nếu </p><p>MU để Ronaldo rời đi, Ten Hag sẽ dễ dàng hơn trong việc tạo ra một đội </p><p>bóng mới, đủ khả năng cạnh tranh danh hiệu trong tương lai.</p><p><br></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/bpivpawv/2022_02_18/ronaldo.jpg\">                            </p><p>Sự hiện diện của một chân sút 37 tuổi như Ronaldo tại MU có thể tước đi cơ hội của nhiều cầu thủ trẻ khác. Ảnh: <em>Reuters</em>.</p><p>                </p><h3><strong>Thay đổi của Ten Hag</strong></h3><p>Giai đoạn chuẩn bị cho mùa giải mới, tôi có mặt tại Carrington, nói chuyện </p><p>với một số cầu thủ và Steve McClaren (trợ lý HLV của Ten Hag - ND). Tôi </p><p>biết Ten Hag đang cố gắng thay đổi bầu không khí của đội bóng, điều đó </p><p>thực sự mang lại nhiều nét tích cực cho mọi người. </p><p>Khi Ralf Rangnick nắm quyền, nhiều cầu thủ MU cảm thấy khó khăn để giải quyết mỗi khi có vấn đề nào đó nảy sinh, điều này xuất phát từ việc thiếu trao </p><p>đổi (giữa HLV và cầu thủ - ND) định kỳ. Ten Hag đã giải quyết việc này.</p><p>Hiện tại, MU có những cầu thủ giỏi trong đội hình. Nhưng tôi nghĩ họ đã </p><p>không trình diễn đúng với khả năng tốt nhất của mình. Dưới thời vị HLV </p><p>mới, họ phải tiếp tục nỗ lực và chứng minh khả năng ngay lập tức. </p><p><br></p><p> Xem MU chơi ở mùa giải trước thật khó chịu. Điều quan trọng và dễ thấy </p><p>nhất là họ trông không giống một tập thể đúng nghĩa hay một đội bóng </p><p>đoàn kết và sở hữu lối chơi rõ ràng. Các cầu thủ MU trông chẳng vui vẻ </p><p>khi xuất hiện hay thi đấu trên sân. </p><p>Ở thời điểm đó, MU dường như </p><p>là tập hợp một các cá nhân rời rạc và thi đấu riêng rẽ. Nhiều lần ở mùa </p><p>trước, tôi không thể phân tích được dàn sao \"Quỷ đỏ\" đang chơi kiểu bóng</p><p> đá nào hay cố tuân theo triết lý huấn luyện của ai. Tất cả chỉ là những</p><p> mảnh ghép rời rạc.</p><p> Tôi nghĩ một trong những điều nổi bật mà </p><p>chúng ta dễ thấy nhất từ Ten Hag thời gian qua là việc HLV này cố gắng </p><p>tạo dấu ấn của mình lên đội, giúp MU định hình được lối chơi rõ ràng. </p><p>Điều đó thật sự quan trọng với một đội bóng như MU.</p>",
  "author": {
    "$oid": "62ef2b30279d8fd4f9f2d6d6"
  },
  "tagList": [
    "football",
    "mu"
  ],
  "favorited": [
    {
      "$oid": "62cff2fbc7ffb94bfe4eba48"
    }
  ],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659848458875"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659848458876"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659952887224"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef47e7279d8fd4f9f2ff1b"
  },
  "title": "Truyện cổ Mân Đàn",
  "description": "Album Truyện cổ Mân Đàn để giúp các bạn có thể theo dõi đầy đủ hơn các kỳ truyện dài. Mỗi lần post truyện mới mình sẽ thêm ảnh vào album này và dẫn 1 đường link cả album, thay vì phải post nhiều link của các kỳ trước, vì như vậy rất khó theo dõi và cồng kềnh. Mong các bạn ủng hộ.",
  "slug": "truyen-co-man-dan-u4-tOM-bwT",
  "body": "<p>Kỳ 11: </p><p>       “Lập cao kế, Gia Lữ Dai lấy lòng tình nhân</p><p>        Trúng mưu sâu, Tây Môn Gích đứng ngồi chẳng được”</p><p><br></p><p>      Giáp Ngọ, tháng Sáu, mùa hạ, nước Mân thời Tây Môn Gích. </p><p><br></p><p><br></p><p>      Trong phủ Âu Chân Phát phía đông thành Mân, Thái Thượng hoàng Á </p><p>Lách cả đêm mất ngủ đứng ngồi không yên. Tả hữu đứng ngoài lo lắng, tới </p><p>sáng một kẻ đánh liều vào hỏi:</p><p>      - Lão nhân gia hàng ngày thưởng </p><p>thức không biết bao nhiêu sơn hào hải vị, tới bữa bỏ quên những món rau </p><p>xanh, nay bị trĩ âu cũng là điều dễ hiểu. Chỉ mong người đừng quá lo </p><p>lắng mà hại thận, tiểu nhân có biết một danh y lừng lẫy, nhất định hàng </p><p>xóm của ông ấy sẽ chữa khỏi bệnh cho người.  </p><p><br></p><p>      Á Lách lắc đầu:</p><p><br></p><p>      - Ta ngày ngày nhai thần dược cao su, có thể chữa bách bệnh, đứng </p><p>ngồi không yên đâu phải thân này bị trĩ, mà bởi trong lòng ta lo lắng </p><p>bất an. Đêm đêm ta vẫn xem thiên văn, đến hôm qua lại thấy chòm sao </p><p>Dương Vật đột nhiên gãy khúc, chỉ e Tây Môn Gích đại họa lâm đầu, đến </p><p>ngai vàng cũng chẳng thể giữ nổi. Ta nghe phương Bắc có một tù trưởng </p><p>nổi dậy, đánh đâu thắng đó, đến nay cách kinh thành chỉ còn vài trăm </p><p>dặm. Than ôi, cơ nghiệp Á Lách ta gây dựng phải chăng sắp tàn.</p><p><br></p><p>      Mọi người nghe vậy đều lấy làm sợ hãi, lúc này thì ai ai cũng đứng ngồi không yên.</p><p><br></p><p><br></p><p>      Tin dữ lan ra khắp chốn, cả triều đình một phen nhốn nháo. Kẻ thì </p><p>sau đó kinh hãi chẳng thể tiểu tiện nổi, người thì đêm đêm sợ đến độ đại</p><p> tiện không  kiểm soát được, có những kẻ hoảng loạn đến mất trí đêm đêm </p><p>vào nhầm phòng em dâu, lại có người thì căng thẳng phát điên rồi ân ái </p><p>với chó ngựa.</p><p><br></p><p>      Quả nhiên ba ngày sau Viên Can kéo quân đến </p><p>công thành, quân Mân rệu rã chẳng còn chút huyết sắc, chiến mã thì run </p><p>rẩy vì bị chủ lạm dụng quấy rối hàng đêm, tướng lĩnh thuộc hạ đều cúi </p><p>bao quy đầu xin hàng, đưa điểu nhi ra chịu trói. Tây Môn Gích biết vận </p><p>mình chẳng thể kéo dài, nhưng phận hoàng đế nào lại dễ dàng hạ mình chịu</p><p> nhục. Y bèn đứng một mình trên thành cất tiếng hô lớn:</p><p>      - Tướng kia có phải Viên Can đấy chăng?</p><p><br></p><p>      Phía dưới không có người đáp lại, Gích tiếp tục đề khí:</p><p>      - Nhà ngươi to gan dám đem đầu tới đây nạp mạng…</p><p><br></p><p><br></p><p>      Quân sĩ phía dưới lúc này đã đầu hàng gần hết, Viên Can vẫn không </p><p>mảy may nói một lời, chỉ rút trường kiếm ra lệnh xông tới, Gích vội </p><p>thét:</p><p>      - Khoan… khoan đã… Bớ quân gian ác, đã tới đây rồi thì ta</p><p> phải cho ngươi biết thế nào là… đừng… đừng xông lên vội, từ từ đã…     </p><p> </p><p><br></p><p>       Nói rồi Gích vừa lau nước mắt vừa dạng chân cho đũng </p><p>quần mau khô, lập tức thảo sớ nhường ngôi để bảo toàn tính mạng, xin </p><p>được làm Tể tướng mong hưởng nốt phú quý vinh hoa, nguyện đem hết kinh </p><p>nghiệm giường chiếu tận lòng giúp Viên Can cai trị Mân Đàn. Những kẻ </p><p>chống đối như Qua Bích, Bái Bái, Can Gia Khoa đều bị đày đi xa xứ, vô </p><p>tình sau này lại được hưởng cuộc sống tốt đẹp. </p><p>******************************************</p><p><br></p><p><br></p><p>      Từ khi làm Tể tướng, Tây Môn Gích như cá gặp nước, bao nhiêu việc </p><p>triều chính được trút bỏ, y chuyên tâm hơn đi tìm mỹ nữ, nhân cơ hội các</p><p> văn võ bá quan mải mê chinh chiến mà y tới tận nhà thăm vợ con, ngay cả</p><p> hoàng hậu và công chúa cũng bị y quấy rầy. Viên Can hay tin thì tức </p><p>giận lắm, nhưng hiềm vì Gích rất hữu dụng để ngu hóa Mân Đàn, lại do bá </p><p>tính vốn tôn thờ Gích còn cung kính hơn người đã khuất, nên lão vẫn chưa</p><p> dám trừng trị.</p><p><br></p><p>      Viên Can ra chiếu lệnh cho Gích nhanh chóng</p><p> tìm người kế thừa chiếc long nội y số thập nhất mà Gích đã bao năm nắm </p><p>giữ, trấn an lòng dân, bảo đảm cho xã tắc tiếp tục được loạn luân. Nhân </p><p>cách hạ đẳng thì Mân triều không thiếu, nhưng tìm được một người vừa trẻ</p><p> vừa tài mới là kế hay lâu dài. Trong triều lúc này có Gia Lữ Dai nổi </p><p>lên như một thi thể lâu ngày trên hồ nước, được Mân Ngu Si Đàn hết lời </p><p>ngợi khen. </p><p>******************************************</p><p><br></p><p>      </p><p>Gia Lữ Dai sinh Ất Hợi, là người gốc vùng Khôi Sơn Võ, sau vì loạn binh </p><p>biến Nhâm Thân mà thân phụ y phiêu bạt tới xứ Bách San. Từ nhỏ, Gia Lữ </p><p>Dai đã thích thêu thùa khâu vá, ham chơi búp bê, đồ hàng, nhảy dây, tết </p><p>tóc. Quần áo y mặc cũng là loại vải hoa sặc sỡ. Nhờ chăm chỉ tắm trong </p><p>nước hoa hồng, thân thể Gia Lữ Dai lúc nào cũng tỏa ngát mùi u hương, </p><p>làn da trắng bóc không một mỹ nữ nào sánh bằng. Lũ trẻ con chơi cùng </p><p>thấy vậy thì ghét lắm. Phụ thân Gia Lữ Dai vốn là người nghiêm khắc, mỗi</p><p> lần thấy con hớn hở chạy về khoe vừa được đám bạn gọi trêu là Gia Lữ </p><p>quận chúa bằng giọng thích thú thì không khỏi tức giận. Nhiều đêm ông </p><p>nằm trằn trọc, nước mắt lưng tròng, giá như cái đêm đầy mưa gió ấy ông </p><p>chỉ quay tay thì đâu nên nỗi...</p><p><br></p><p>      Gia Lữ Dai được cha mẹ cho </p><p>đọc nhiều sách người lớn, truyền bá cảnh phòng the, những áng văn đồi </p><p>trụy để thức tỉnh giới tính. Qua những tác phẩm ấy, Gia Lữ Dai  biết đến</p><p> những thành tích đầy dâm loạn của Tây Môn Gích, từ đó đem lòng ái mộ, </p><p>thầm quyết tâm có ngày được đến Mân quốc, dù chỉ được trông thấy Gích </p><p>một lần thôi cũng đủ làm y mãn nguyện cả đời. </p><p><br></p><p>      Cầu được ước</p><p> thấy, tới nay Gia Lữ Dai còn là một mệnh quan Mân triều, hàng ngày được</p><p> thỏa sức nhìn ngắm, gần gũi người trong mộng, quả thực không còn gì lạc</p><p> thú bằng. Y ngày đêm lên kế hoạch gây sự chú ý của Tây Môn Gích. </p><p><br></p><p><br></p><p>      Một lần, Gia Lữ Dai rủ gái lầu xanh vào khách điếm, không quên nhờ</p><p> người loan tin khắp kinh thành. Tới nơi, y vứt cho ả một xấp ngân </p><p>phiếu, rồi dặn cùng ngồi xem hát kịch đến canh Hợi hãy tự động ra về. Kỹ</p><p> nữ không khỏi ngạc nhiên, đem tâm sự ra hỏi thì Gia Lữ Dai thổ lộ:</p><p>      - Ta vốn chỉ thích nam nhân, không có cảm xúc với nhà ngươi, xin hãy xem kịch rồi cầm tiền về đi cho.</p><p>      - Đã vậy hà cớ chi ngài lại rủ thiếp tới đây?</p><p><br></p><p>      - Phải làm thế thì mọi người mới nghĩ ta là đấng nam nhi, cánh đàn</p><p> ông cũng vì lẽ đó mà chẳng đề phòng ta nữa, ta càng có cơ hội tiếp xúc </p><p>họ.</p><p><br></p><p>      Nói rồi thò tay vào tư trang cô gái, lấy hết phấn son, gương lược, rồi nở một nụ cười thật tươi:</p><p>      - Ta muốn mấy thứ này, số tiền kia chắc đã đủ rồi chứ!</p><p>******************************************</p><p><br></p><p><br></p><p>      Tây Môn Gích hay tin Gia Lữ Dai đưa gái lầu xanh đi vui thú thì cả</p><p> mừng. Bỏ dở bát thuốc bổ thận, y vội vã lên xe ngựa sang phủ Gia Lữ </p><p>phủ. Vừa thấy bóng Gích trước cửa, Dai đã lao tới ôm chầm lấy. Gích </p><p>những tưởng huynh đệ vì lâu ngày không gặp nên cũng chẳng né tránh, nào </p><p>ngờ đợi mãi chẳng thấy Gia Lữ Dai buông tay, y bèn nhẹ nhàng đẩy tiểu đệ</p><p> ra xa, rồi mới ôn tồn vỗ về:</p><p>      - Ta hay tin đệ mới mười tám xuân</p><p> xanh đã năm lần bảy lượt cùng kỹ nữ nhấp nhô giữa chốn Mân thành. Thành</p><p> tích như vậy khiến đại ca ta không khỏi hổ thẹn, chiếc quần lót số thập</p><p> nhất của ta mấy mươi năm nay cuối cùng cũng đã tìm được truyền nhân.</p><p><br></p><p><br></p><p>      Nói rồi tụt quần lót trao cho Gia Lữ Dai. Dai nhận lấy, đưa lên </p><p>mặt hít một hơi thật sâu rồi trang trọng cất vào tay áo, bước vào khuê </p><p>phòng bưng tách trà mời Gích.</p><p><br></p><p>      Gích nhấp ngụm trà, từ từ ngồi xuống ghế cất lời khuyên bảo:</p><p>      - Phàm đã là mệnh quan triều đình phải biết noi gương cho thiên hạ, trên có loạn luân thì dưới mới thái bình…</p><p><br></p><p>      Nói đến đây đầu óc choáng váng nặng trĩu, mắt mũi tối sầm rồi không biết gì nữa…</p><p>******************************************</p><p><br></p><p><br></p><p>      Một làn hơi ấm phả vào mặt, Tây Môn Gích từ từ mở mắt, chỉ thấy </p><p>đôi môi Gia Lữ Dai đang kề sát má, cả hai đang lõa lồ chẳng chút xiêm y.</p><p> Gích như bừng tỉnh, y hoảng hốt, chẳng kịp vơ lấy quần áo, cứ thế sợ </p><p>hãi chạy thẳng ra ngoài, hậu môn máu tuôn chảy không ngừng. Phía trong, </p><p>Gia Lữ Dai đang ôm mặt khóc nức nở, trên đầu vẫn đội chiếc quần lót thêu</p><p> chữ thập nhất đỏ chói.</p><p><br></p><p>      Giáp Ngọ, mùa hạ, Viên Can năm thứ </p><p>nhất, một vệt máu đỏ thắm trải dài từ phủ Gia Lữ tới phủ Tây Môn. Dân </p><p>chúng đi qua hiếu kỳ không khỏi bàn tán. Thành Mân lại có thêm một người</p><p> đứng ngồi không yên…</p>",
  "author": {
    "$oid": "62ef2b30279d8fd4f9f2d6d6"
  },
  "tagList": [
    "football",
    "mu"
  ],
  "favorited": [
    {
      "$oid": "62cff2fbc7ffb94bfe4eba48"
    }
  ],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659848679361"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659848679361"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659952880869"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef5276279d8fd4f9f302e1"
  },
  "title": "Bộ phim Hàn có quá ít người xem",
  "description": "Một số bộ phim truyền hình Hàn Quốc buộc phải bỏ bớt tập phim vì tỷ lệ người xem quá thấp. Việc giữ nguyên thời lượng khiến tác phẩm trở thành gánh nặng chi phí.",
  "slug": "bo-phim-han-co-qua-it-nguoi-xem-HQhdARNsZ1",
  "body": "<p><br></p><p><br></p><p>A Beautiful Mind: Lấy cảm hứng từ tiểu thuyết Frankenstein của Mary Sheller, A Beautiful Mind kể về Lee Young Oh (Jang Hyuk thủ vai), bác sĩ giải phẫu thần kinh nổi tiếng thế giới nhưng bị chứng vô cảm. Cuộc sống anh rẽ vào lối ngoặt mới khi các bệnh nhân điều trị tại bệnh viện anh làm việc lần lượt qua đời một cách khó hiểu.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_04/a_beautiful_mind_1.4.jpg\"></p><p>A Beautiful Mind: Lấy cảm hứng từ tiểu thuyết Frankenstein của Mary Sheller, A Beautiful Mind kể về Lee Young Oh (Jang Hyuk thủ vai), bác sĩ giải phẫu thần kinh nổi tiếng thế giới nhưng bị chứng vô cảm. Cuộc sống anh rẽ vào lối ngoặt mới khi các bệnh nhân điều trị tại bệnh viện anh làm việc lần lượt qua đời một cách khó hiểu.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_04/a_beautiful_mind_1.3.jpg\"></p><p>A Beautiful Mind: Lấy cảm hứng từ tiểu thuyết Frankenstein của Mary Sheller, A Beautiful Mind kể về Lee Young Oh (Jang Hyuk thủ vai), bác sĩ giải phẫu thần kinh nổi tiếng thế giới nhưng bị chứng vô cảm. Cuộc sống anh rẽ vào lối ngoặt mới khi các bệnh nhân điều trị tại bệnh viện anh làm việc lần lượt qua đời một cách khó hiểu.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_04/a_beautiful_mind_1.2.jpg\"></p><p>A Beautiful Mind: Lấy cảm hứng từ tiểu thuyết Frankenstein của Mary Sheller, A Beautiful Mind kể về Lee Young Oh (Jang Hyuk thủ vai), bác sĩ giải phẫu thần kinh nổi tiếng thế giới nhưng bị chứng vô cảm. Cuộc sống anh rẽ vào lối ngoặt mới khi các bệnh nhân điều trị tại bệnh viện anh làm việc lần lượt qua đời một cách khó hiểu.</p><p><br></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_04/a_beautiful_mind_1.1.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_04/a_beautiful_mind_1.2.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_04/a_beautiful_mind_1.3.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_04/a_beautiful_mind_1.4.jpg\"></p><p><strong>A Beautiful Mind</strong>: Lấy cảm hứng từ tiểu thuyết <em>Frankenstein </em>của Mary Sheller, <em>A Beautiful Mind</em> kể về Lee Young Oh (Jang Hyuk thủ vai), bác sĩ giải phẫu thần kinh nổi tiếng thế giới nhưng bị chứng vô cảm. Cuộc sống anh rẽ vào lối ngoặt mới khi các bệnh nhân điều trị tại bệnh viện anh làm việc lần lượt qua đời một cách khó hiểu.</p><p>Tỷ suất người xem trung bình của bộ phim là 3,7%, mức rating thấp kỷ lục đối với một tác phẩm công chiếu trên đài truyền hình lớn tại thời điểm ấy. Từ 16 tập, bộ phim bị cắt giảm xuống còn 14 tập. Dù bất ngờ và buồn rầu trước quyết định này, dàn diễn viên hiểu rằng đây là điều khó tránh khỏi khi nhà đài không còn đủ chi phí để duy trì dự án.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_04/a_beautiful_mind_2.2.jpg\"></p><p>Tỷ suất người xem trung bình của bộ phim là 3,7%, mức rating thấp kỷ lục đối với một tác phẩm công chiếu trên đài truyền hình lớn tại thời điểm ấy. Từ 16 tập, bộ phim bị cắt giảm xuống còn 14 tập. Dù bất ngờ và buồn rầu trước quyết định này, dàn diễn viên hiểu rằng đây là điều khó tránh khỏi khi nhà đài không còn đủ chi phí để duy trì dự án.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_04/a_beautiful_mind_2.1.jpg\"></p><p><br></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_04/a_beautiful_mind_2.2.jpg\"></p><p>Tỷ suất người xem trung bình của bộ phim là 3,7%, mức rating thấp kỷ lục đối với một tác phẩm công chiếu trên đài truyền hình lớn tại thời điểm ấy. Từ 16 tập, bộ phim bị cắt giảm xuống còn 14 tập. Dù bất ngờ và buồn rầu trước quyết định này, dàn diễn viên hiểu rằng đây là điều khó tránh khỏi khi nhà đài không còn đủ chi phí để duy trì dự án.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/mom_is_acting_up_1.1.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/mom_is_acting_up_1.2.jpg\"></p><p><strong>Mom Is Acting Up</strong>: <em>Mom Is Acting Up</em> bắt đầu lên sóng từ tháng 10/2012. Bộ phim xoay quanh cuộc sống của Na Moon Hee (Na Moon Hee thủ vai), chủ điều hành một nhà hàng thành công. Một ngày nọ, những đứa con đã trưởng thành của cô quay về sống với cô sau khi gặp thất bại. Thay vì chiều lòng, dỗ dành con cái, Na Moon Hee dạy dỗ họ một cách nghiêm khắc.</p><p>Mom Is Acting Up dự kiến kéo dài 120 tập. Về sau, bộ phim bị cắt giảm xuống còn 27 tập. Việc bộ phim liên tục thiếu người xem khiến đài MBC phải bỏ bớt tập phim và chuyển sang tập trung vào dự án khác.</p><p><br></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/mom_is_acting_up_2.1.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/mom_is_acting_up_2.2.jpg\"></p><p><em>Mom Is Acting Up</em> dự kiến kéo dài 120 tập. Về sau, bộ phim bị cắt giảm xuống còn 27 tập. Việc bộ phim liên tục thiếu người xem khiến đài MBC phải bỏ bớt tập phim và chuyển sang tập trung vào dự án khác.</p><p>A Piece Of Your Mind: A Piece Of Your Mind là bộ phim tình cảm xoay quanh Moon Ha Won (Jung Hae In thủ vai) và Han Seo Woo (Chae Soo Bin thủ vai). Moon Ha Won là lập trình viên AI kiêm người sáng lập công ty AH, trong khi Han Seo Woo là chuyên gia thu âm nhạc cổ điển.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/a_piece_of_your_mind_1.4.jpeg\"></p><p>A Piece Of Your Mind: A Piece Of Your Mind là bộ phim tình cảm xoay quanh Moon Ha Won (Jung Hae In thủ vai) và Han Seo Woo (Chae Soo Bin thủ vai). Moon Ha Won là lập trình viên AI kiêm người sáng lập công ty AH, trong khi Han Seo Woo là chuyên gia thu âm nhạc cổ điển.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/a_piece_of_your_mind_1.3.jpg\"></p><p>A Piece Of Your Mind: A Piece Of Your Mind là bộ phim tình cảm xoay quanh Moon Ha Won (Jung Hae In thủ vai) và Han Seo Woo (Chae Soo Bin thủ vai). Moon Ha Won là lập trình viên AI kiêm người sáng lập công ty AH, trong khi Han Seo Woo là chuyên gia thu âm nhạc cổ điển.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/a_piece_of_your_mind_1.2.jpg\"></p><p>A Piece Of Your Mind: A Piece Of Your Mind là bộ phim tình cảm xoay quanh Moon Ha Won (Jung Hae In thủ vai) và Han Seo Woo (Chae Soo Bin thủ vai). Moon Ha Won là lập trình viên AI kiêm người sáng lập công ty AH, trong khi Han Seo Woo là chuyên gia thu âm nhạc cổ điển.</p><p><br></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/a_piece_of_your_mind_1.1.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/a_piece_of_your_mind_1.2.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/a_piece_of_your_mind_1.3.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/a_piece_of_your_mind_1.4.jpeg\"></p><p><strong>A Piece Of Your Mind</strong>: <em>A Piece Of Your Mind</em> là bộ phim tình cảm xoay quanh Moon Ha Won (Jung Hae In thủ vai) và Han Seo Woo (Chae Soo Bin thủ vai). Moon Ha Won là lập trình viên AI kiêm người sáng lập công ty AH, trong khi Han Seo Woo là chuyên gia thu âm nhạc cổ điển.</p><p>Theo kế hoạch, A Piece Of Your Mind phát hành 16 tập, nhưng bộ phim bị cắt giảm xuống còn 12 tập. Tỷ suất người xem trung bình cao nhất của bộ phim là 2,4%. Khán giả phàn nàn bộ phim có cốt truyện không đặc sắc, diễn biến chậm chạp, dễ khiến người xem cảm thấy chán nản.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/a_piece_of_your_mind_2.2.jpg\"></p><p>Theo kế hoạch, A Piece Of Your Mind phát hành 16 tập, nhưng bộ phim bị cắt giảm xuống còn 12 tập. Tỷ suất người xem trung bình cao nhất của bộ phim là 2,4%. Khán giả phàn nàn bộ phim có cốt truyện không đặc sắc, diễn biến chậm chạp, dễ khiến người xem cảm thấy chán nản.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/a_piece_of_your_mind_2.1.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/a_piece_of_your_mind_2.1.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/a_piece_of_your_mind_2.2.jpg\"></p><p>Theo kế hoạch, <em>A Piece Of Your Mind</em> phát hành 16 tập, nhưng bộ phim bị cắt giảm xuống còn 12 tập. Tỷ suất người xem trung bình cao nhất của bộ phim là 2,4%. Khán giả phàn nàn bộ phim có cốt truyện không đặc sắc, diễn biến chậm chạp, dễ khiến người xem cảm thấy chán nản.</p><p>Ex-Girlfriend Club: Nhân vật chính của Ex-Girlfriend Club là Bang Myung Soo (Byun Yo Han thủ vai), tác giả truyện tranh. Sau khi bộ truyện tranh viết về mối quan hệ tình cảm trong quá khứ của anh trở nên nổi tiếng và được chuyển thể thành phim, anh bắt đầu gặp lại những người bạn gái cũ được anh nhắc tới trong truyện, trong đó bao gồm Kim Soo Jin (Song Ji Hyo thủ vai).</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/ex_girlfriend_club_1.4.jpg\"></p><p>Ex-Girlfriend Club: Nhân vật chính của Ex-Girlfriend Club là Bang Myung Soo (Byun Yo Han thủ vai), tác giả truyện tranh. Sau khi bộ truyện tranh viết về mối quan hệ tình cảm trong quá khứ của anh trở nên nổi tiếng và được chuyển thể thành phim, anh bắt đầu gặp lại những người bạn gái cũ được anh nhắc tới trong truyện, trong đó bao gồm Kim Soo Jin (Song Ji Hyo thủ vai).</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/ex_girlfriend_club_1.3.jpg\"></p><p>Ex-Girlfriend Club: Nhân vật chính của Ex-Girlfriend Club là Bang Myung Soo (Byun Yo Han thủ vai), tác giả truyện tranh. Sau khi bộ truyện tranh viết về mối quan hệ tình cảm trong quá khứ của anh trở nên nổi tiếng và được chuyển thể thành phim, anh bắt đầu gặp lại những người bạn gái cũ được anh nhắc tới trong truyện, trong đó bao gồm Kim Soo Jin (Song Ji Hyo thủ vai).</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/ex_girlfriend_club_1.2.jpg\"></p><p>Ex-Girlfriend Club: Nhân vật chính của Ex-Girlfriend Club là Bang Myung Soo (Byun Yo Han thủ vai), tác giả truyện tranh. Sau khi bộ truyện tranh viết về mối quan hệ tình cảm trong quá khứ của anh trở nên nổi tiếng và được chuyển thể thành phim, anh bắt đầu gặp lại những người bạn gái cũ được anh nhắc tới trong truyện, trong đó bao gồm Kim Soo Jin (Song Ji Hyo thủ vai).</p><p><br></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/ex_girlfriend_club_1.1.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/ex_girlfriend_club_1.2.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/ex_girlfriend_club_1.3.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/ex_girlfriend_club_1.4.jpg\"></p><p><strong>Ex-Girlfriend Club</strong>: Nhân vật chính của <em>Ex-Girlfriend Club</em> là Bang Myung Soo (Byun Yo Han thủ vai), tác giả truyện tranh. Sau khi bộ truyện tranh viết về mối quan hệ tình cảm trong quá khứ của anh trở nên nổi tiếng và được chuyển thể thành phim, anh bắt đầu gặp lại những người bạn gái cũ được anh nhắc tới trong truyện, trong đó bao gồm Kim Soo Jin (Song Ji Hyo thủ vai).</p><p>Ban đầu, Ex-Girlfriend Club dự kiến kéo dài 16 tập, nhưng rồi bộ phim giảm xuống 12 tập. Bộ phim khởi đầu với tỷ suất người xem trung bình là 1,16%. Đây cũng là mức rating cao nhất trong toàn bộ tác phẩm. Sau tập đầu, tỷ suất người xem trung bình của Ex-Girlfriend Club không thể vượt qua con số 1%.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/ex_girlfriend_club_2.2.jpg\"></p><p>Ban đầu, Ex-Girlfriend Club dự kiến kéo dài 16 tập, nhưng rồi bộ phim giảm xuống 12 tập. Bộ phim khởi đầu với tỷ suất người xem trung bình là 1,16%. Đây cũng là mức rating cao nhất trong toàn bộ tác phẩm. Sau tập đầu, tỷ suất người xem trung bình của Ex-Girlfriend Club không thể vượt qua con số 1%.</p><p><br></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/ex_girlfriend_club_2.1.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/ex_girlfriend_club_2.2.jpg\"></p><p>Ban đầu, <em>Ex-Girlfriend Club</em> dự kiến kéo dài 16 tập, nhưng rồi bộ phim giảm xuống 12 tập. Bộ phim khởi đầu với tỷ suất người xem trung bình là 1,16%. Đây cũng là mức rating cao nhất trong toàn bộ tác phẩm. Sau tập đầu, tỷ suất người xem trung bình của <em>Ex-Girlfriend Club</em> không thể vượt qua con số 1%.</p><p>Love Frequency 37.2: Love Frequency 37.2 kể về người dẫn chương trình radio với biệt danh Captain (Yoon Gun thủ vai). Không ai nắm rõ thông tin chính xác về tên tuổi, nghề nghiệp của anh. Mỗi tập phim kể về một câu chuyện tình yêu khác nhau. Đây đều là câu chuyện Captain nhận được từ khán giả của anh.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/love_frequency_1.2.jpg\"></p><p>Love Frequency 37.2: Love Frequency 37.2 kể về người dẫn chương trình radio với biệt danh Captain (Yoon Gun thủ vai). Không ai nắm rõ thông tin chính xác về tên tuổi, nghề nghiệp của anh. Mỗi tập phim kể về một câu chuyện tình yêu khác nhau. Đây đều là câu chuyện Captain nhận được từ khán giả của anh.</p><p><br></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/love_frequency_1.1.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/love_frequency_1.2.jpg\"></p><p><strong>Love Frequency 37.2</strong>: <em>Love Frequency 37.2</em> kể về người dẫn chương trình radio với biệt danh Captain (Yoon Gun thủ vai). Không ai nắm rõ thông tin chính xác về tên tuổi, nghề nghiệp của anh. Mỗi tập phim kể về một câu chuyện tình yêu khác nhau. Đây đều là câu chuyện Captain nhận được từ khán giả của anh.</p><p>Theo kế hoạch, Love Frequency 37.2 có tổng cộng 12 tập, nhưng bộ phim giảm xuống chỉ còn 6 tập. Một bộ phận nhỏ người xem cảm thấy hài lòng và yêu thích tác phẩm, tuy nhiên, Love Frequency 37.2 không thể thu hút sự chú ý của phần đông công chúng.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/love_frequency_2.2.jpg\"></p><p>Theo kế hoạch, Love Frequency 37.2 có tổng cộng 12 tập, nhưng bộ phim giảm xuống chỉ còn 6 tập. Một bộ phận nhỏ người xem cảm thấy hài lòng và yêu thích tác phẩm, tuy nhiên, Love Frequency 37.2 không thể thu hút sự chú ý của phần đông công chúng.</p><p><br></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/love_frequency_2.1.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/mfsy2/2022_08_07/love_frequency_2.2.jpg\"></p><p>Theo kế hoạch, <em>Love Frequency 37.2</em> có tổng cộng 12 tập, nhưng bộ phim giảm xuống chỉ còn 6 tập. Một bộ phận nhỏ người xem cảm thấy hài lòng và yêu thích tác phẩm, tuy nhiên, <em>Love Frequency 37.2</em> không thể thu hút sự chú ý của phần đông công chúng.</p><p><br></p>",
  "author": {
    "$oid": "62a2e976949b34418e39f941"
  },
  "tagList": [
    "zing",
    "film"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659851382241"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659851382241"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659851382241"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef6b24279d8fd4f9f308d1"
  },
  "title": "Tin đồn: việc dùng chip cũ trên iPhone 14 “không Pro” sẽ trở thành thông lệ cho iPhone sau này?",
  "description": "Tin đồn: việc dùng chip cũ trên iPhone 14 “không Pro” sẽ trở thành thông lệ cho iPhone sau này?",
  "slug": "tin-don-viec-dung-chip-cu-tren-iphone-14-khong-pro-se-tro-thanh-thong-le-cho-iphone-sau-nay-MLkDI48qaI",
  "body": "<p><img src=\"https://photo2.tinhte.vn/data/attachment-files/2022/08/6080000_cover_iPhone_14_Apple_A15_tinhte.jpg\"></p><p>Vào đầu tuần này, nhà phân tích Ming-Chi Kuo đã báo cáo rằng <a href=\"https://tinhte.vn/tag/apple\" rel=\"noopener noreferrer\" target=\"_blank\">Apple</a> không chỉ có kế hoạch sử dụng chip <a href=\"https://tinhte.vn/tag/a16\" rel=\"noopener noreferrer\" target=\"_blank\">A16</a> mạnh nhất dành riêng cho 2 mẫu <a href=\"https://tinhte.vn/tag/iphone-14\" rel=\"noopener noreferrer\" target=\"_blank\">iPhone 14</a> Pro mà cũng có kế hoạch làm như vậy cho các dòng <a href=\"https://tinhte.vn/tag/iphone\" rel=\"noopener noreferrer\" target=\"_blank\">iPhone</a> tiếp theo sau đó. Và nguồn tin của iDropnews mới đây cũng đưa ra nhận định tương tự, nói rằng: <em>“Đây là kịch bản có khả năng xảy ra nhất vào thời điểm này, mặc dù vẫn còn nhiều chi tiết cần được xử lý trước khi nó xảy ra”</em>.</p><p><br></p><p>Các tin đồn trước đó đều cho biết 2 chiếc iPhone 14 và 14 Max/Plus năm nay sẽ dùng lại chip A15 Bionic của năm ngoái, tuy nhiên không có nghĩa là Apple sẽ công khai điều này. Thay vào đó họ có thể gọi con chip này là “A16”, tương tự những gì đã làm với dòng Apple Watch, và gọi con chip mới trên iPhone 14 Pro là “A16 Pro”.</p><p><br></p><p>AW Series 7 trang bị con chip S6, nhưng Apple vẫn gọi nó là S7. Điều tương tự dự kiến sẽ xảy ra với Series 8, nhiều khả năng sẽ có chip “S8” giống như S6 đã có trong Series 6 và 7. Đối với thế giới smartwatch thì điều này không có gì là tồi tệ vì nhu cầu cho các bộ vi xử lý tốt hơn không nhiều và các công ty chủ yếu tập trung vào thời lượng pin và các cảm biến, nhưng câu chuyện hoàn toàn khác đối với smartphone.</p><p><br></p><p>Việc công khai sử dụng chip cũ trên dòng sản phẩm mới sẽ là một tình huống marketing tồi tệ. Vì vậy iDropnews cho rằng Apple một là sẽ không đề cập đến điều này trong sự kiện hoặc sẽ gọi nó là A16 và tự cho mình thời gian để chuẩn bị những câu trả lời tốt nhất khi mọi người bắt đầu chú ý. Và phương án thứ 2 có vẻ là kịch bản hợp lý hơn ngay lúc này.</p><p><br></p><p>Tóm lại, tin đồn cho rằng Apple sẽ không gọi <a href=\"https://tinhte.vn/tag/chip-tren-iphone-14\" rel=\"noopener noreferrer\" target=\"_blank\">chip trên iPhone 14</a> và 14 Max là “A15” dù nó thực sự là “A15”, tương tự như AW Series 7, và điều này dự kiến sẽ tiếp diễn trong tương lai. Anh em nghĩ sao về thông tin này?</p><p><br></p>",
  "author": {
    "$oid": "62ef545f279d8fd4f9f303c5"
  },
  "tagList": [
    "tinhte",
    "iphone"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659857700739"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659857700740"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659857700740"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef7481279d8fd4f9f30b83"
  },
  "title": "Google, Microsoft muốn loại bỏ giây thứ 61 trên đồng hồ",
  "description": "Giây nhuận trên đồng hồ nguyên tử vốn được tạo để đồng bộ với chuyển động quay của Trái Đất, nhưng cũng có thể khiến hệ thống máy tính và phần mềm gặp lỗi.",
  "slug": "google-microsoft-muon-loai-bo-giay-thu-61-tren-dong-ho-6WivCkdEuC",
  "body": "<p><br></p><p>                                                                                                                                                                                                                 <img src=\"https://znews-photo.zingcdn.me/w960/Uploaded/yqdlcqrwq/2022_07_26/19725072022_1.jpeg\">                                                                             </p><p>Các hãng công nghệ muốn loại bỏ giây nhuận vì gây ra sự cố cho hệ thống máy tính. Ảnh: <em>AP</em>.</p><p>                                            </p><p>Theo <em>CNET</em>,một giây bổ sung gây khó khăn cho các hệ thống máy tính, vốn dựa trên mạng lưới quản lý thời gian không có giây nhuận để lên lịch cho các hoạt động được hẹn giờ trước, chẳng hạn như cập nhật phần mềm hay bổ sung dữ liệu.</p><p>Các hãng công nghệ lập luận chèn giây nhuận gây ra nhiều vấn đề như mất kết nối Internet, các sự cố nghiêm trọng hơn so với lợi ích mà nó mang lại. Các công ty cũng cho rằng chèn giây nhuận là vô ích,bởi tốc độ quay thực tế của Trái Đất không thay đổi nhiều trong lịch sử.</p><p>\"Chúng tôi dự đoán nếu chỉ dựa vào Thời gian Nguyên tử Quốc tế (TAI, tiêu chuẩn đo thời gian không sử dụng giây nhuận) mà không cần tính toán giây nhuận, mọi thứ vẫn hoạt động tốt trong ít nhất 2.000 năm nữa. Đến lúc đó,chúng ta mới cân nhắc điều chỉnh\", nhà khoa học Ahmad Byagowi thuộc Meta, công ty mẹ của Facebook cho biết.</p><p>Không chỉ các hãng công nghệ, chiến dịch vận động bỏ giây nhuận cũng được 2 cơ quan đo đếm thời gian đồng ý, bao gồm Viện Tiêu chuẩn và Công nghệ Quốc gia Mỹ (NIST) và Văn phòng Cân đo Quốc tế Pháp (BIPM). Sự ủng hộ của các chính phủ đóng vai trò quan trọng, bởi họ và những nhà khoa học mới là những người chịu trách nhiệm về hệ thống đồng hồ toàn cầu.</p><p>Năm 2021, NIST từng nhận định giây nhuận có ưu lẫn khuyết điểm. Chúng giúp đảm bảo các quan sát thiên văn được đồng bộ hóa với thời gian trên đồng hồ. Tuy nhiên, giây nhuận cũng có thể gây rắc rối cho một số ứng dụng </p><p>định vị và cơ sở hạ tầng viễn thông.</p><p>Với việc Trái Đất quay nhanh hơn, sẽ đến lúc con người cần sử dụng giây nhuận âm, trừ đi một giây thay vì cộng vào. Theo kỹ sư Oleg Obleukhov của Meta, điều này sẽ gây hàng loạt vấn đề mới cho các phần mềm dựa vào bộ hẹn giờ hoặc hoạt động theo lịch trình.</p><p>                                                </p><p>                                                                                                 <img src=\"https://znews-photo.zingcdn.me/w960/Uploaded/yqdlcqrwq/2022_07_26/19825072022.jpg\">                                            Một giây thêm vào đồng hồ từng khiến nhiều website gặp lỗi. Ảnh: <em>Laughing Squid</em>.</p><p>               </p><p>Năm 2012, giây nhuận khiến hàng loạt sản phẩm công nghệ gặp sự cố như diễn đàn Reddit, Mozilla, LinkedIn, Yelp và dịch vụ đặt vé máy bay Amadeus. </p><p>Năm 2017, lỗi hệ thống của Cloudflare vì bổ sung giây nhuận khiến website của nhiều khách hàng ngừng hoạt động.</p><p>Một trong những sự cố thời gian đáng nhớ nhất là Y2K, khi các máy tính, vi mạch đồng hồ điện tử thời ấy chỉ dùng 2 số cuối của năm thay vì 4 số để tiết kiệm dung lượng lưu trữ. Khi chuyển giao sang thế kỷ mới, mọi hoạt động sử </p><p>dụng máy tính và vi mạch đồng hồ điện tử bị đảo lộn bởi máy tính sẽ không thể phân biệt năm 2000 với 1900 do giá trị hiển thị là 00. </p><p>Đến năm 2038, sự cố tương tự có thể xảy ra khi một số máy tính dùng bộ </p><p>32-bit, đếm thời gian từ 1/1/1970 sẽ vượt giới hạn lưu trữ. Đầu năm nay,các trình duyệt cập nhật phiên bản 100 khiến một số website gặp lỗi bởi chúng chỉ nhận diện các phiên bản với 2 chữ số.</p>",
  "author": {
    "$oid": "62ef735f279d8fd4f9f30b57"
  },
  "tagList": [
    "technology"
  ],
  "favorited": [
    {
      "$oid": "62ee5cff279d8fd4f9f2d292"
    }
  ],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659860097023"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659860097023"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659865991697"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef75a7279d8fd4f9f30cd1"
  },
  "title": "Trái Đất vừa trải qua ngày ngắn nhất lịch sử",
  "description": "Do Trái Đất quay nhanh hơn, 29/6 là ngày ngắn nhất được ghi nhận từ khi áp dụng đồng hồ nguyên tử.",
  "slug": "trai-dat-vua-trai-qua-ngay-ngan-nhat-lich-su-w9vw0HGJCV",
  "body": "<p>Trái Đất ghi nhận ngày ngắn nhất vào 29/6, khi hoàn thành một vòng quay nhanh hơn 1,59 mili-giây (ms) so với 24 tiếng thông thường. Theo <em>Time and Date</em>, đó là ngày ngắn nhất được ghi nhận từ khi các nhà khoa học sử dụng đồng hồ nguyên tử để đo tốc độ quay của Trái Đất vào thập niên 1960.Kỷ lục vừa ghi nhận cho thấy Trái Đất đang quay nhanh hơn, nguyên nhân cụ thể chưa được sáng tỏ. Trước đó, các kỷ lục ngày ngắn nhất là 19/7/2020, khi Trái Đất quay nhanh hơn 1,47 ms. Đến 26/7, kỷ lục suýt phá vỡ khi Trái Đất hoàn thành một vòng nhanh hơn 1,50 ms.</p><p>                                    </p><p>                                          </p><p><img src=\"https://znews-photo.zingcdn.me/w960/Uploaded/yqdlcqrwq/2022_08_03/01303082022.jpg\">                                                                             </p><p>Có nhiều nguyên nhân ảnh hưởng đến tốc độ quay của Trái Đất. Ảnh: <em>NASA</em>.</p><p><br></p><p>Trái Đất không phải khối cầu tuyệt đối. Vòng quay của hành tinh bị tác động </p><p>bởi nhiều yếu tố như cấu trúc lõi, thủy triều đại dương, lực hấp dẫn từ Mặt Trăng và biến đổi khí hậu, bao gồm nóng lên toàn cầu nhưng tỷ lệ không cao.</p><p>Theo <em>Vice</em>, \"hành tinh xanh\" đã nhiều lần phá kỷ lục tốc độ quay trong ngày nhanh nhất từ năm 2020. Trước đó, Trái Đất trải qua hàng chục năm ghi nhận những ngày dài hơn bình thường do tốc độ quay chậm, khiến 27 giây nhuận được thêm vào Giờ Phối hợp Quốc tế (UTC).</p><p>Tiến sĩ toán học Leonid Zotov từ Đại học Quốc gia Moscow (Nga) đặt giả thuyết rằng dao động Chandler (Chandler wobble) cũng có thể ảnh hưởng đến tốc độ quay. Theo <em>Business Insider</em>, hiện tượng này mô tả sự chêch lệch trong chuyển động quay trên trục Trái Đất, lần đầu được phát hiện vào cuối thập niên 1880.\"Đương nhiên đây là điều kỳ lạ. Rõ ràng có gì đó thay đổi theo cách mà chúng ta chưa từng chứng kiến, kể từ khi hình thành lĩnh vực thiên văn vô tuyến vào những năm 1970\", Matt King, Giáo sư Đại học Tasmania (Australia) cho biết.</p><p>Thay đổi này rất nhỏ và con người không thể cảm nhận, nhưng nếu tích tụ theo thời gian, sự chênh lệch có thể ảnh hưởng đến các hệ thống định vị, liên lạc vệ tinh. Sẽ đến lúc các nhà khoa học trừ đi một giây trong giờ UTC, còn gọi là giây nhuận âm. Trong quá khứ, giây nhuận được bổ sung để giữ thời gian nguyên tử đồng bộ với chuyển động quay thực tế của Trái Đất, nhưng chưa bao giờ dùng để trừ bớt.</p><p><br></p><p>                                                                                                                   <img src=\"https://znews-photo.zingcdn.me/w960/Uploaded/yqdlcqrwq/2022_08_03/01403082022.jpg\">                                            Trái Đất nhiều lần phá kỷ lục ngày ngắn nhất từ 2019 đến nay. Ảnh: <em>Time and Date</em>.</p><p>               </p><p>Theo Viện Tiêu chuẩn và Công nghệ Quốc gia Mỹ (NIST), giây nhuận có ưu lẫn khuyết điểm. Chúng giúp đảm bảo các quan sát thiên văn được đồng bộ với thời gian trên đồng hồ, nhưng cũng có thể gây rắc rối cho một số ứng dụng định vị và cơ sở hạ tầng viễn thông.</p><p>Gần đây, các hãng công nghệ vận động dừng thêm giây nhuận do có thể khiến hệ thống máy tính và phần mềm gặp lỗi. Dù chưa thể tìm hiểu nguyên nhân gây ra hiện tượng quay nhanh gần đây, nhưng nhìn chung Trái Đất đã quay chậm hơn trong thời gian dài do tương tác với Mặt Trăng. Những nghiên cứu trước đây ước tính trong 6,7 triệu năm tới, ngày sẽ kéo dài thêm một phút.</p>",
  "author": {
    "$oid": "62ef735f279d8fd4f9f30b57"
  },
  "tagList": [
    "earth"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659860391035"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659860391036"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659864388007"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef7751279d8fd4f9f30e05"
  },
  "title": "Tìm thấy 2 siêu Trái Đất nằm rất gần Hệ Mặt Trời",
  "description": "Các hành tinh vừa được phát hiện có kích thước lớn hơn 1,2-1,5 lần, khối lượng gấp 2-3 lần so với Trái Đất.",
  "slug": "tim-thay-2-sieu-trai-dat-nam-rat-gan-he-mat-troi-0O9qDttS_b",
  "body": "<p><br></p><p>                                                                                                                <img src=\"https://znews-photo.zingcdn.me/w960/Uploaded/yqdlcqrwq/2022_06_19/12419062022.jpg\">                                                                             </p><p>Kính viễn vọng TESS vừa giúp phát hiện 2 siêu Trái Đất cách chúng ta 33 năm ánh sáng. Ảnh: <em>NASA</em>.</p><p>                                            </p><p>Theo thông cáo báo chí của Viện Công nghệ Massachusetts (MIT), ngôi sao chủ của hệ hành tinh có tên HD 260655. Ngôi sao này tương đối nhỏ, nhiệt độ mát mẻ nên được xếp vào nhóm sao lùn M (M-dwarf, sao lùn đỏ).</p><p>Theo hệ thống phân loại Morgan Keenan dựa trên quang phổ, sao lùn M nhỏ hơn đáng kể so với Mặt Trời. Ngôi sao trung tâm của Hệ Mặt Trời thuộc nhóm sao dải chính G (G-type main-sequence star), nhưng số lượng chỉ bằng 1/10 so với các sao lùn đỏ.</p><p>Theo <em>CNET</em>, hành tinh vòng trong (inner planet) quay quanh HD 260655 theo chu kỳ 2,8 ngày Trái Đất,kích thước lớn hơn 1,2 lần và khối lượng gấp đôi so với Trái Đất. Trong khi đó, hành tinh vòng ngoài mất 5,7 ngày Trái Đất để quay một vòng quanh ngôi sao chủ, kích thước bằng 1,5 lần và khối lượng gấp 3 lần Trái Đất. Tất cả được xem là hành tinh đất đá. Michelle Kunimoto, nhà khoa học thuộc Viện Nghiên cứu Vật lý Thiên văn và Không gian Kavli của MIT, cho biết 2 hành tinh quay quanh HD 260655 là những mục tiêu phù hợp để nghiên cứu bầu khí quyển bởi ngôi sao chủ của chúng có độ sáng cao.</p><p>Theo Kunimoto, các nghiên cứu có thể trả lời một số câu hỏi như \"Có bầu khí </p><p>quyển giàu chất bay hơi xung quanh các hành tinh này không\" và \"Có dấu </p><p>hiệu của nước hoặc các loài sinh vật dựa trên carbon không\". Nói cách khác, việc nghiên cứu các hành tinh này nhằm xác định liệu bầu khí quyển của chúng có lớp bảo vệ giống tầng ozone hay có tồn tại sinh vật không.</p><p>Dù vậy, nhóm nghiên cứu nhấn mạnh các hành tinh vừa được tìm thấy không phù hợp để con người sinh sống. Do nằm gần ngôi sao chủ, nhiệt độ của </p><p>chúng rất cao để giữ nước. Theo nghiên cứu, hành tinh vòng trong của HD </p><p>260655 có nhiệt độ 436,6 độ C, còn hành tinh vòng ngoài là khoảng 286,6 độ C. Sứ mệnh của TESS là tìm kiếm các ngoại hành tinh (hành tinh ngoài Hệ Mặt Trời). Ảnh: <em>NASA</em>.</p><p>Kính viễn vọng TESS được phóng vào tháng 4/2018, phục vụ sứ mệnh tìm kiếm các hành tinh ngoài Hệ Mặt Trời. Nó hoạt động bằng cách phát hiện sự sụt giảm ánh sáng đột ngột của các ngôi sao, dấu hiệu cho thấy có thể một </p><p>hành tinh di chuyển ngang qua chúng.Đó là lý do khi nhìn thấy ánh sáng giảm bất thường của HD 260655 vào tháng 10/2021, các nhà khoa học đã tìm thấy 2 hành tinh quay quanh ngôi sao sau nhiều tháng thử nghiệm. Avi Shporer, thành viên thuộc nhóm nghiên cứu của MIT cho biết hoàn toàn có khả năng tồn tại nhiều hơn 2 hành tinh quay quanh ngôi sao này.</p>",
  "author": {
    "$oid": "62ef735f279d8fd4f9f30b57"
  },
  "tagList": [
    "science"
  ],
  "favorited": [
    {
      "$oid": "62ee5cff279d8fd4f9f2d292"
    }
  ],
  "comments": [
    {
      "$oid": "62efa1bb9b2ddb50dba796ae"
    }
  ],
  "publishAt": {
    "$date": {
      "$numberLong": "1659860817812"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659860817812"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659871675884"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef77a2279d8fd4f9f30e6f"
  },
  "title": "Sinh viên Việt Nam đứng đầu cuộc thi Solution Challenge 2022 của Google",
  "description": "Dự án Gateway của 4 sinh viên Nguyễn Đăng Khương, Trương Hoàng Duy, Nguyễn Võ Đăng Cao, Nguyễn Mạnh Hùng giành vị trí cao nhất cuộc thi Solution Challenge 2022 của Google.",
  "slug": "sinh-vien-viet-nam-dung-dau-cuoc-thi-solution-challenge-2022-cua-google-4vby5yPqmD",
  "body": "<p>Cuộc thi năm nay thu hút 835 dự án từ các bạn trẻ của nhiều quốc gia trên thế giới như Canada, Hàn Quốc, Đức, Thổ Nhĩ Kỳ, Ấn Độ… Riêng Đông Nam Á có 74 dự án, trong đó có 16 dự án từ Việt Nam tham gia.</p><p>Kết quả, dự án Gateway của nhóm GDSC Trường đại học Hoa Sen gồm 4 sinh viên Nguyễn Đăng Khương, Trương Hoàng Duy, Nguyễn Võ Đăng Cao, Nguyễn Mạnh Hùng đã giành vị trí cao nhất, top 3 dự án xuất sắc nhất của cuộc thi (không chia giải nhất, nhì, ba).</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659860898/svsgjafrqapefc8ru6xs.jpg\"></p><p>Hai dự án khác nằm trong top 3 cuộc thi gồm dự án Xtrinsic của nhóm sinh viên Đại học Freiburg (Đức) và Blossom của Đại học Waterloo (Canada).</p><p>Mỗi thành viên các đội trong top 3 nhận được giải thưởng trị giá 3.000 USD cùng chứng chỉ từ Google.</p><p>Gateway là một sản phẩm xây dựng các chốt kiểm tra 5K không cần sự hỗ trợ hoặc can thiệp của con người. Mục tiêu chính của dự án là giảm bớt áp lực cho lực lượng y tế, cộng đồng, các doanh nghiệp trong công cuộc phòng chống, ngăn ngừa dịch COVID-19.</p><p>Với các điều kiện tiên quyết như giá thành thấp, học sinh, sinh viên có thể lắp đặt thông qua các thiết bị linh kiện điện tử, ứng dụng điện thoại để thiết lập Gateway tại nơi sinh sống và làm việc của họ.</p><p>Đồng thời, Gateway hoàn toàn là ứng dụng open-source (mã nguồn mở), do đó mọi người đều có thể tham gia hỏi đáp hoặc cùng nhóm phát triển dự án.</p><p>Nguyễn Đăng Khương, thành viên của đội GDSC, cho biết từ tháng 10-2020 Việt Nam đã gỡ bỏ lệnh giãn cách để người dân học tập và làm việc bình thường, nhưng những khâu kiểm tra quá lâu và luôn phải cần 1-2 nhân viên bảo vệ chốt ở các cổng ra vào tòa nhà để kiểm tra.</p><p>\"Gateway là một giải pháp hữu ích và thích hợp để đặt ở các cửa ra vào của tất cả các tòa nhà, trường học, giúp việc kiểm soát dịch bệnh COVID-19 hiệu quả hơn và tránh lây nhiễm chéo một cách tối đa\" - Khương chia sẻ.</p><p>Solution Challenge là cuộc thi thường niên do cộng đồng Developer Student Clubs tổ chức với sự hậu thuẫn từ hãng công nghệ hàng đầu thế giới Google.</p><p>Mục tiêu tìm ra các giải pháp cho các vấn đề của cộng đồng địa phương bằng cách sử dụng một hoặc nhiều sản phẩm nền tảng của Google.</p>",
  "author": {
    "$oid": "62cff2fbc7ffb94bfe4eba48"
  },
  "tagList": [
    "sinhvien",
    "solution",
    "challenge",
    "google"
  ],
  "favorited": [
    {
      "$oid": "62cff2fbc7ffb94bfe4eba48"
    },
    {
      "$oid": "62a2e971949b34418e39f93d"
    },
    {
      "$oid": "62ee5cff279d8fd4f9f2d292"
    },
    {
      "$oid": "62f0959bbc71187f4b1524d9"
    },
    {
      "$oid": "62ef1a9f279d8fd4f9f2d405"
    }
  ],
  "comments": [
    {
      "$oid": "62ef8b6a9b2ddb50dba79461"
    },
    {
      "$oid": "62f09714bc71187f4b1527ca"
    }
  ],
  "publishAt": {
    "$date": {
      "$numberLong": "1659860898880"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659860898880"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659934484768"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef8a8a9b2ddb50dba792ce"
  },
  "title": "Báo Tây Ban Nha đưa tin Hồng Đăng, Hồ Hoài Anh được trả hộ chiếu",
  "description": "Theo tờ Ultima Hora của Tây Ban Nha, Hồng Đăng và Hồ Hoài Anh được trả hộ chiếu từ ngày 3/8. Sau hơn một tháng không được rời Mallorca, họ đã có thể về nước.",
  "slug": "bao-tay-ban-nha-dua-tin-hong-dang-ho-hoai-anh-duoc-tra-ho-chieu-dDMS68_wYV",
  "body": "<p>Ngày 7/8, tờ <em>Ultima Hora</em> của Tây Ban Nha đưa tin tòa án Palma đã quyết định trả lại hộ chiếu Hồng Đăng và Hồ Hoài Anh. Theo <em>Ultima Hora</em>, họ bị tịch thu hộ chiếu và cấm rời khỏi Tây Ban Nha từ tháng 6 vì vướng cáo buộc hiếp dâm cô gái 17 tuổi trong khách sạn ở Andratx. Khi đó, cả hai từ chối khai báo khi bị bắt trước quan tòa nhưng với điều kiện họ không được rời Mallorca. <em>Ultima Hora</em> cho biết gần một tháng rưỡi sau khi vụ việc xảy ra, họ đã có thể trở về nước.</p><p><em>Ultima Hora </em>cho biết hai nghi phạm sau vài giờ bị bắt được đưa đến tòa án Via Germany. Cả hai đều sử dụng quyền không được làm chứng trước thẩm phán. Sau đó, thẩm phán quyết định trả tự do cho hai bị cáo mà không cần tại ngoại, nhưng tịch thu hộ chiếu của họ.</p><p>Sau khi thông tin được truyền thông Tây Ban Nha đăng tải, một số tờ báo Anh cũng dẫn lại nguồn tin.</p><p>Hồng Đăng và Hồ Hoài Anh vướng cáo buộc hiếp dâm.</p><p><img src=\"https://znews-photo.zingcdn.me/w1920/Uploaded/qfssu/2022_08_07/hd_1542_1.jpg\"></p><p><img src=\"https://znews-photo.zingcdn.me/w960/Uploaded/qfssu/2022_08_07/hd_1542_1.jpg\"></p><p>Hồng Đăng và Hồ Hoài Anh vướng cáo buộc hiếp dâm.</p><p>Ngày 1/7,<em> Ultima Hora</em> cũng là tờ báo đầu tiên đăng thông tin \"một diễn viên và nhạc sĩ nổi tiếng của Việt Nam, 37 và 42 tuổi” bị cô gái 17 tuổi người Anh tố cưỡng hiếp trên đảo Mallorca (Tây Ban Nha). Cô gái 17 tuổi nói với cảnh sát rằng mình bị tấn công tại khách sạn ở Andratx, phía tây nam hòn đảo. Trước đó, cô gặp các nghệ sĩ ở một nhà hàng gần đó và giao lưu, uống rượu với họ.</p><p>Người thân đã báo cảnh sát sau khi được nhận được thông tin từ cô gái. Tờ báo địa phương <em>Ultima Hora </em>đưa tin cô gái 17 tuổi nói với các cảnh sát rằng hai người đàn ông 37 và 42 tuổi đã bắt cô tắm sau khi hiếp dâm để loại bỏ bằng chứng trong trường hợp họ bị buộc tội.</p><p>Sáng 5/7, Thứ trưởng Bộ Văn hóa, Thể thao và Du lịch Tạ Quang Đông nhắc đến diễn viên Hồng Đăng, nhạc sĩ Hồ Hoài Anh và cho biết 2 người đang tại ngoại ở Tây Ban Nha, họ đã có luật sư bảo vệ quyền lợi, và chờ gặp thẩm phán.</p><p><br></p>",
  "author": {
    "$oid": "62ee5cff279d8fd4f9f2d292"
  },
  "tagList": [
    "life",
    "showbiz"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659865738183"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659865738186"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659865738186"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62ef8b279b2ddb50dba7939c"
  },
  "title": "Tàu chiến Trung Quốc và Đài Loan theo sát nhau",
  "description": "Tàu chiến Trung Quốc và Đài Loan theo sát nhau trên biển vào ngày 7/8, trước khi Bắc Kinh dự kiến kết thúc 4 ngày tập trận lớn chưa từng có quanh hòn đảo.",
  "slug": "tau-chien-trung-quoc-va-dai-loan-theo-sat-nhau-LGKxZNNw4T",
  "body": "<p>Khoảng 10 tàu chiến từ mỗi bên đã di chuyển sát nhau tại eo biển Đài Loan và một số tàu Trung Quốc đại lục đã vượt qua đường trung tuyến - vùng đệm không chính thức phân chia hai phía, <em>Reuters</em> ngày 7/8 dẫn một nguồn thạo tin.</p><p>Trong một tuyên bố, cơ quan phòng vệ đảo Đài Loan cho biết nhiều tàu chiến, máy bay và drone của Trung Quốc đã mô phỏng đòn tấn công vào hòn đảo này cùng lực lượng hải quân của họ. Cơ quan phòng vệ Đài Loan cho biết đã điều động máy bay và tàu để ứng phó “phù hợp”.</p><p><img src=\"https://znews-photo.zingcdn.me/w960/Uploaded/ifyiv/2022_08_07/1.JPG\">Một tàu quân sự của Đài Loan được chụp hình từ phía tàu của Hải quân Trung Quốc vào ngày 6/8. Ảnh: <em>Hải quân Trung Quốc</em>.</p><p>Cũng như ngày 6/8, lực lượng Trung Quốc áp sát đường trung tuyến. Trong lúc đó, phía Đài Loan theo sau giám sát và ngăn chặn khả năng phía Trung Quốc vượt qua đường ranh giới không chính thức mỗi khi có thể.</p><p>“Cả hai phía đều thể hiện sự kiềm chế”, nguồn tin của <em>Reuters</em> nói, dùng cụm từ “mèo vờn chuột” để mô tả diễn biến trên biển. “Một phía định vượt qua, phía bên kia ngáng đường, buộc đối phương di chuyển tới vị trí bất lợi và cuối cùng phải quay trở lại”, theo mô tả.</p><p>Phía Đài Loan cho biết hệ thống tên lửa chống hạm đặt trên bờ cùng hệ thống tên lửa đất đối không Patriot của hòn đảo đang trong trạng thái sẵn sàng.</p><p>Trung Quốc tổ chức đợt tập trận lần này để phản đối chuyến thăm Đài Loan của Chủ tịch Hạ viện Mỹ Nancy Pelosi. Đợt tập trận này mở màn vào ngày 4/8 và theo lịch sẽ kéo dài tới trưa ngày 7/8 (giờ địa phương), <em>Tân Hoa xã</em> đưa tin.</p><p>Các khu vực tập trận phân bố ở 6 vùng biển xung quanh Đài Loan - hòn đảo Bắc Kinh coi là vùng lãnh thổ không thể tách rời và không loại trừ khả năng thống nhất bằng vũ lực.</p><p><br></p>",
  "author": {
    "$oid": "62ee5cff279d8fd4f9f2d292"
  },
  "tagList": [
    "war",
    "china"
  ],
  "favorited": [
    {
      "$oid": "62f096f3bc71187f4b152754"
    }
  ],
  "comments": [
    {
      "$oid": "62f0954bbc71187f4b1523fc"
    },
    {
      "$oid": "62f09558bc71187f4b152424"
    },
    {
      "$oid": "62f0955bbc71187f4b15242c"
    },
    {
      "$oid": "62f0955ebc71187f4b152434"
    },
    {
      "$oid": "62f09563bc71187f4b15243c"
    }
  ],
  "publishAt": {
    "$date": {
      "$numberLong": "1659873060000"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659865895844"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659934607676"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62efa1839b2ddb50dba795f0"
  },
  "title": "Tương lai của \"con gái\" Thor trong MCU: Không kế nhiệm thần sấm thì cũng là thực thể vũ trụ mạnh nhất nhì Marvel",
  "description": "Thor đã gia nhập hội \"bố bỉm sữa\" sau khi nhận nuôi con gái của phản diện Gorr the God Butcher trong bom tấn Love and Thunder, và rất có thể cô bé này sẽ trở thành 1 trong những nhân vật mạnh nhất vũ trụ Marvel trong các dự án tương lai của MCU.",
  "slug": "tuong-lai-cua-con-gai-thor-trong-mcu-khong-ke-nhiem-than-sam-thi-cung-la-thuc-the-vu-tru-manh-nhat-nhi-marvel-F1l0V1RXPU",
  "body": "<p>Là 1 trong những bộ phim hiếm hoi của MCU mang nặng yếu tố tình cảm, Thor: Love and Thunder đã mang đến cái kết giàu cảm xúc và để lại nhiều xúc động trong lòng khán giả. Sau hành trình dài chu du khắp vũ trụ để tàn sát các vị thần, phản diện Gorr the God Butcher lại bất ngờ quyết định sử dụng điều ước mà Eternity ban tặng để hồi sinh cô con gái bé nhỏ của mình, và trao cho Thor chăm sóc tại New Asgard.</p><p>Love, tên của cô bé theo câu chuyện của Korg, sở hữu những đặc điểm tương đồng với rất nhiều nhân vật quan trọng trong truyện tranh Marvel, bao gồm cả Eternity và những cô con gái của Thor. Với việc Marvel Studios đang âm thầm xây dựng 1 thế hệ siêu anh hùng trẻ hơn, rất có thể Love sẽ là 1 mảnh ghép cực kỳ quan trọng đối với bức tranh tương lai của MCU. Và nguyên tác truyện tranh sẽ giúp chúng ta có những ý tưởng thú vị về vai trò của nhân vật này trong các dự án sắp tới.</p><p><strong>Mistress Love</strong></p><p><a href=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-1-165985522090516087647.png\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-1-165985522090516087647.png\"></a></p><p>Câu chuyện của Love trong MCU có thể sẽ lấy cảm hứng từ một thực thể vũ trụ có cùng tên với cô bé. Mistress Love, hay gọi ngắn gọn là Love, ra mắt lần đầu tiên trong chương truyện <em>The Defenders #107</em> với vai trò là hiện thân của tình yêu trong vũ trụ Marvel. Cô thường xuất hiện cùng một số thực thể trừu tượng, vô hình khác, ví dụ như Eternity trong <em>The Infinity Gauntlet #3</em>.</p><p>Mistress Love có thể kiểm soát tình yêu trong mọi thực thể sống, mặc dù năng lực của cô gặp khá nhiều hạn chế khi đối đầu với Thanos ở trạng thái cao nhất. Được đánh giá là một trong số những thực thể vũ trụ mạnh nhất của Marvel, nhưng sức mạnh của Mistress Love lại không đạt đến đẳng cấp đa vũ trụ như Eternity. Ngoài ra, dù thường xuất hiện trong hình hài nữ giới, nhân vật này cũng không có hình dáng hay giới tính cụ thể. Mistress Love sẽ hiện thân theo những cách khác nhau tùy theo từng trường hợp và đối tượng.</p><p><strong>Torunn Thorsdóttir (Earth-TRN591)</strong></p><p><a href=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-1-16598552239901372029452.png\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-1-16598552239901372029452.png\"></a></p><p>Vì Love đã trở thành con nuôi của Thor trên màn ảnh lớn, nên sẽ không có gì ngạc nhiên nếu Marvel Studios quyết định xây dựng nhân vật này dựa trên chính những đứa con của chàng thần sấm trong truyện tranh, trong đó có cả Torunn Thorsdóttir.</p><p>Torunn là thành viên của biệt đội Next Avengers của vũ trụ Earth-TRN591, lần đầu xuất hiện trong chương truyện <em>Generations: Iron Man & Ironheart #1</em> (2017). Mặc dù không được khai thác quá sâu về mặt cá tính hay sức mạnh, nhưng dường như Torunn chịu khá nhiều ảnh hưởng từ người cha của mình trong lý tưởng trừ gian diệt bạo, bảo vệ những cá thể vô tội.</p><p>Bên cạnh đó, vì là con gái của Thor, Torunn cũng sở hữu những đặc điểm siêu nhiên của người Asgard, ví dụ như siêu sức mạnh, siêu thể lực cùng tuổi thọ dài gấp nhiều lần người Trái Đất. Bộ giáp mà cô thường mặc không khỏi khiến người khác liên tưởng đến Destroyer, một trong những ác nhân mạnh nhất mà Thor từng đối đầu. Ngoài ra, món vũ khí mà Torunn yêu thích là 1 thanh kiếm khổng lồ, như 1 cách để tri ân người mẹ của mình - Lady Sif (theo bộ phim hoạt hình <em>Avengers: Heroes of Tomorrow</em> ra mắt năm 2008).</p><p><strong>Torunn Thorsdóttir (Earth-10943)</strong></p><p><a href=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-3-16598552245631341309348.png\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-3-16598552245631341309348.png\"></a></p><p>1 phiên bản khác của Torunn Thorsdóttir cũng xuất hiện trong chương truyện <em>Avengers #1 (Vol.4)</em>, phát hành năm 2010. Phiên bản này mang khá nhiều nét tương đồng với Torunn của vũ trụ Earth-TRN591, từ trang phục cho đến cả mối quan hệ với Next Avengers - bao gồm những \"cậu ấm cô chiêu\" của các thành viên Avengers gạo cội như Captain America, Black Panther, Giant-Man hay The Wasp. Phiên bản Torunn này đến từ 1 thực tế phân kỳ, được hình thành sau khi các Avengers của Earth-616 du hành thời gian, đi đến tương lai để đánh bại Ultron.</p><p>Torunn đóng vai trò khá quan trọng trong nhiều bộ truyện tranh và hoạt hình của Marvel. Trong lần đầu tiên xuất hiện, cô đã cùng đồng đội đối đầu với Immortus, một trong những biến thể mạnh nhất của Kang the Conqueror - phản diện lớn tiếp theo mà Marvel Studios sẽ khai thác trong thời gian tới. Đó có lẽ là lý do vì sao nhiều fan tin rằng Love sẽ được lấy phần lớn cảm hứng từ nhân vật này trong tương lai của MCU.</p><p><strong>Brigid Thorsdottir</strong></p><p><a href=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-5-16598552250332028377016.png\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-5-16598552250332028377016.png\"></a></p><p>Love cũng có thể đi theo những mạch truyện hiện đại hơn, lấy cảm hứng từ những nhân vật mới mẻ hơn trong vũ trụ Marvel, ví dụ như Brigid Thorsdottir. Brigid xuất hiện lần đầu tiên trong chương truyện <em>Captain Marvel #23</em>, khi Carol Danvers du hành thời gian đến năm 2051.</p><p><br></p><p>Nhân vật này từng hợp tác với một số siêu anh hùng còn sống sót sau 1 sự kiện đại hồng thủy đã cướp đi mạng sống của cha cô, đồng thời quét sạch gần như mọi sự sống trên Trái Đất. Bên cạnh đó, vì không thể sử dụng được búa thần Mjolnir, Brigid đã quyết định trở thành 1 thợ rèn để chế ra thần binh cho các siêu anh hùng khác.</p><p>Bên cạnh đó, Brigid còn từng tham gia vào trận chiến chống lại Ove, con trai của Namor the Sub-Mariner (sẽ xuất hiện trong bom tấn Black Panther: Wakanda Forever) và Amora the Enchantress của Asgard, và cũng là 1 trong số những pháp sư mạnh nhất vũ trụ Marvel. Trong trận chiến này, Brigid đã chứng tỏ giá trị của bản thân, nhấc bổng được búa Mjolnir và qua đó trở thành Thor kế tiếp. Đây cũng chiến là viễn cảnh mà nhiều fan đã vẽ ra cho Love trong MCU sau khi chàng thần sấm \"nghỉ hưu\".</p><p><strong>Thena Thorsdóttir</strong></p><p><a href=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-7-16598552261031311227602.png\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-7-16598552261031311227602.png\"></a></p><p>Thena Thorsdóttir là 1 nhân vật quan trọng của vũ trụ MC2 (là thực tại của 20 năm sau), đồng thời cũng là thành viên chủ chốt của biệt đội Avengers, trong đó có Spider-Girl. Câu chuyện về xuất thân của Thena cũng mang nhiều điểm tương đồng với Love, bởi cô cũng là 1 trong số ít những người sống sót sau khi Galactus phá hủy quê nhà Asgard.</p><p>Ban đầu, Thena vốn là kẻ thù của Avengers vì những hiểu lầm không đáng có. Nhưng sau đó, cô đã trở thành đồng minh của biệt đội này, tương tự như cha của mình. Cô từng sử dụng 1 món thần binh hùng mạnh do Jarvis chế tạo, sau khi chiếc búa thần của cô bị phá hủy trong trận chiến với J2, con trai của Juggernaut.</p><p><strong>Eternity</strong></p><p><a href=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-9-16598552240351609648140.png\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-9-16598552240351609648140.png\"></a></p><p>Trong Thor: Love and Thunder, Eternity là thực thể vũ trụ đã trực tiếp thực hiện điều ước của Gorr the God Butcher và đưa Love trở về từ cõi chết. Trong phân cảnh đó, nếu để ý kỹ, chúng ta có thể thấy những họa tiết ngôi sao, vũ trụ lập kín hình bóng của Love khi phản chiếu trong mặt nước, giống hệt như Eternity. Điều này khiến không ít fan tin rằng cô bé thực chất chính là Eternity ở 1 hình dạng mới.</p><p>Ngoài ra, trong nguyên tác truyện tranh, Eternity từng phân tách bản thân thành những mảnh vỡ, đại diện cho những khía cạnh khác nhau của chính mình, và nhập vào nhiều thực thể khác trong đa vũ trụ. Đôi khi Eternity cũng trà trộn vào thế giới dưới hình dạng của con người và sử dụng bí danh Adam Quadmon.</p><p><strong>Singularity</strong></p><p><a href=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-11-1659855225562421314214.png\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-11-1659855225562421314214.png\"></a></p><p>Dựa vào hình dạng với đầy họa tiết vũ trụ như đã nêu trên, nếu không phải là Eternity, Love hoàn toàn có thể trở thành (hoặc có liên quan) đến Singularity. Thực thể hùng mạnh này xuất hiện lần đầu tiên trong chương truyện <em>A-Force #1</em> với tư cách là một thực thể kỳ dị lượng tử sống rơi từ trên trời xuống Battleworld. Vẻ ngoài ma mị của Singularity có khá nhiều điểm tương đồng với Eternity và Love trong MCU.</p><p>Singularity trỗi dậy từ sự kiện Secret Wars (phiên bản phát hành năm 2015), và là 1 trong những sự kiện quan trọng nhất của truyện tranh Marvel cho đến thời điểm hiện tại. Secret Wars đã được xác nhận là \"Endgame kế tiếp\" của MCU và sẽ là bộ phim \"chốt sổ\" cho giai đoạn 6 cũng như Multiverse Saga của vũ trụ điện ảnh này.</p><p><strong>Infinity</strong></p><p><a href=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-13-16598552240702117517002.png\" rel=\"noopener noreferrer\" target=\"_blank\"><img src=\"https://kenh14cdn.com/203336854389633024/2022/8/7/photo-13-16598552240702117517002.png\"></a></p><p>Infinity là người chị em của Eternity, đồng thời là hiện thân của không gian, của tất cả mọi thứ nằm trong vũ trụ Marvel. Đó là lý do vì sao thực thể này có thể dễ dàng thao túng, điều khiển không gian, thời gian, vật chất và năng lượng. Infinity xuất hiện lần đầu tiên trong chương truyện <em>Quasar #24</em> và hoàn toàn có thể là nguồn cảm hứng để Marvel Studios khai thác Love trong tương lai.</p><p>Là 1 thực thể năng lượng lượng tử thuần khiết, Quasar có thể sử dụng Quantum Band, những bảo vật hùng mạnh để thâm nhập vào Vùng Lượng tử (Quantum Zone) và cả Infinity. Dù chưa được xác nhận, nhưng Quantum Band hoàn toàn có thể có liên kết với chiếc vòng tay bí ẩn của Ms. Marvel trong MCU, cho thấy hành trình trong tương lai của Love nhiều khả năng sẽ liên quan đến cả Kamala Khan và Carol Danvers.</p><p><br></p>",
  "author": {
    "$oid": "62ee5cff279d8fd4f9f2d292"
  },
  "tagList": [
    "thor",
    "mcu",
    "cinema"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659871619833"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659871619834"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659871619834"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62f09819bc71187f4b152a72"
  },
  "title": "saddsaasdadsasddasasd",
  "description": "asdadsasdadsdsa",
  "slug": "saddsaasdadsasddasasd-AWF3B5WfRx",
  "body": "<p>sddsaasd</p><p>asdasd</p><p>asdsaasdasd</p><p><br></p><p><br></p><p><br></p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659934744/a92holljyhpscaszzvvi.png\"></p><p><br></p><p><br></p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1659934743/xrehvaw4mg04mhela2qy.png\"></p><p><br></p><p>262626</p>",
  "author": {
    "$oid": "62f0959bbc71187f4b1524d9"
  },
  "tagList": [
    "react",
    "redux"
  ],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1659934800000"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1659934745066"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1659934745066"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62f47d4fbc71187f4b15408a"
  },
  "title": "Hai tháng thực tập tại DSV",
  "description": "Hai tháng thực tập tuyệt vời ở Designveloper",
  "slug": "hai-thang-thuc-tap-tai-dsv-U4zUEuqdQd",
  "body": "<h1>Giới thiệu một chút về bản thân</h1><p>Mình là sinh viên năm 3 ĐHBK. Đến với DSV như duyên số, cuối năm 3 thì bên trường mình có mở chương trình intern. Sau khi tìm hiểu thì mình có làm bài test online do DSV cung cấp và đã được ứng tuyển. </p><h1>Tháng 1</h1><p>Tuần đầu là tuần để mình giao lưu tìm hiểu, tìm hiểu đề tài. Vì là tuần đầu tiên nên mình gặp rất nhiều khó khăn. Các thành viên trong nhóm, mentor gần như là rất mới. Mặc dù đa số là các bạn là dân Bách Khoa nhưng không hẵn là quen hết. Nên tuần đầu chủ yếu là giao lưu và kết bạn. Đối với dân IT nói chung thì việc giải trí là hết sức quan trọng, sau những giờ code căng thẳng thì Tam Quốc Sát là sự lựa chọn không tồi. Chúng tôi từng chơi sau giờ ăn trưa, đó là thời gian rảnh rỗi nhất trong ngày vì chiều lại code tiếp rồi :v . Từ đó chúng tôi cũng thân nhau hơn, trò chuyện nhiều hơn. Từ đó chúng tôi trao đổi, support nhau về code về technical.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1660189785/b6rwfzvk5xuso77brskt.jpg\"></p><h1>Tháng 2</h1><p>Tới tháng tiếp theo thì chúng tôi cũng chơi nhiều quen nhau nhiều nên cũng thân nhau hơn. Thì tới tháng này bên công ty có tạo bàn bóng bàn cho mọi người giải trí ở tầng 3 thì tất nhiên chúng tôi không thể bỏ qua. </p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1660189786/obfijrk5cmqyd8buwqxg.jpg\"></p><p>Tuy nhiên deadline cũng đến gần. Chúng tôi cũng không còn nhiều thời gian. Như vậy cũng là thời gian chúng tôi bên nhau cũng gần kết thúc.</p><p><img src=\"http://res.cloudinary.com/dd8b69mls/image/upload/v1660189786/gffga2ypzutxmvyaytn5.jpg\"></p><p><img src=\"https://:0\"></p><p>Sau 2 tháng thực tập không chỉ nhận được nhiều kiến thức mà còn nhiều ký ức. Những ký ức không thể nào phai những lần chơi tam quốc sát, những lần chưa chơi đã thoi thóp. Tất nhiên tôi sẽ không quên những ký ức về kỳ thực tập này. Có được mentor tuyệt vời, các đồng đội tuyệt vời giúp cho kỳ thực tập của tôi không bị nhàm chán. Ngày nào tôi cũng muốn được gặp mọi người để được đồ sát một người nào đó. Cám ơn mọi người đã cho tôi 1 kỳ thực tập tuyệt vời. </p>",
  "author": {
    "$oid": "62f0959bbc71187f4b1524d9"
  },
  "tagList": [
    "intern"
  ],
  "favorited": [
    {
      "$oid": "62f0959bbc71187f4b1524d9"
    }
  ],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1660190031901"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1660190031901"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1660207669158"
    }
  },
  "__v": 0
},{
  "_id": {
    "$oid": "62f5dbaebc71187f4b15436a"
  },
  "title": "アメリカでサル痘とうになった男性だんせい「今いままででいちばん痛いたかった」",
  "description": "アメリカでサル痘とうになった男性だんせい「今いままででいちばん痛いたかった」\nサル痘とうという病気びょうきになった人ひとが、アメリカなどで増ふえています。日本にっぽんでも見みつかりました。\n\nニューヨークに住すんでいる26歳さいの男性だんせいは、7月がつの初はじめにサル痘とうになったことがわかりました。最初さいしょは熱ねつが出でて、頭あたまが痛いたくなりました。3日みっかから4日よっかぐらいで熱ねつが下さがったあと、体からだのいろいろな所ところに5mmぐらいの水みずぶくれができました。\n\n腕に赤い発疹\n男性だんせいは「水みずぶくれは最初さいしょかゆくて、それから痛いたくなりました。痛いたみを止とめる薬くすりを飲のんでも、痛いたくて寝ねることができませんでした。今いままでの経験けいけんでいちばん痛いたかったです。1週間しゅうかんぐらい続つづきました」と話はなしました。\n\nニキビのような5ミリほどの水ぶくれ\n男性だんせいは、病院びょういんでもらった天然痘てんねんとうの薬くすりを飲のんで治なおりました。熱ねつなどが出でてから治なおるまで18日にちかかりました。",
  "slug": "-GT27TfIbtZ",
  "body": "<p>サル痘</p><p>とう</p><p>という病気</p><p>びょうき</p><p>になった人</p><p>ひと</p><p>が、アメリカなどで増</p><p>ふ</p><p>えています。日本</p><p>にっぽん</p><p>でも見</p><p>み</p><p>つかりました。</p><p><br></p><p>ニューヨークに住</p><p>す</p><p>んでいる26歳</p><p>さい</p><p>の男性</p><p>だんせい</p><p>は、7月</p><p>がつ</p><p>の初</p><p>はじ</p><p>めにサル痘</p><p>とう</p><p>になったことがわかりました。最初</p><p>さいしょ</p><p>は熱</p><p>ねつ</p><p>が出</p><p>で</p><p>て、頭</p><p>あたま</p><p>が痛</p><p>いた</p><p>くなりました。3日</p><p>みっか</p><p>から4日</p><p>よっか</p><p>ぐらいで熱</p><p>ねつ</p><p>が下</p><p>さ</p><p>がったあと、体</p><p>からだ</p><p>のいろいろな所</p><p>ところ</p><p>に5mmぐらいの水</p><p>みず</p><p>ぶくれができました。</p><p><img src=\"https://www3.nhk.or.jp/news/contents/easy/still/manu_2022_0810_02.jpg\">男性</p><p>だんせい</p><p>は「水</p><p>みず</p><p>ぶくれは最初</p><p>さいしょ</p><p>かゆくて、それから痛</p><p>いた</p><p>くなりました。痛</p><p>いた</p><p>みを止</p><p>と</p><p>める薬</p><p>くすり</p><p>を飲</p><p>の</p><p>んでも、痛</p><p>いた</p><p>くて寝</p><p>ね</p><p>ることができませんでした。今</p><p>いま</p><p>までの経験</p><p>けいけん</p><p>でいちばん痛</p><p>いた</p><p>かったです。1週間</p><p>しゅうかん</p><p>ぐらい続</p><p>つづ</p><p>きました」と話</p><p>はな</p><p>しました。</p><p><br></p><p><img src=\"https://www3.nhk.or.jp/news/contents/easy/still/manu_2022_0810_03.jpg\">男性</p><p>だんせい</p><p>は、病院</p><p>びょういん</p><p>でもらった天然痘</p><p>てんねんとう</p><p>の薬</p><p>くすり</p><p>を飲</p><p>の</p><p>んで治</p><p>なお</p><p>りました。熱</p><p>ねつ</p><p>などが出</p><p>で</p><p>てから治</p><p>なお</p><p>るまで18日</p><p>にち</p><p>かかりました。</p>",
  "author": {
    "$oid": "62f5db73bc71187f4b15435c"
  },
  "tagList": [],
  "favorited": [],
  "comments": [],
  "publishAt": {
    "$date": {
      "$numberLong": "1660279726246"
    }
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1660279726246"
    }
  },
  "updatedAt": {
    "$date": {
      "$numberLong": "1660279726246"
    }
  },
  "__v": 0
}]